{"conversations": [["The 80s was definitely the best year for horror. They gave us iconic slasher villains like Freddie Krueger and Jason Voorhees!", "I'd have to disagree. I'm more partial to the Alfred Hitchcock era, he was a true master of suspense.", "I've never really heard too much about Hitchcock, but I've seen The Birds. Black and white movies aren't my thing though.", "I highly recommend you check more of his movies out! Without Hitchcock, the horror genre would never be the same.", "What kind of films would you suggest to me? Obviously I've seen The Birds already!", "There are so many out there! A few of my personal recommendations include Psycho, Dial M for Murder, and The Man Who Knew Too Much.", "Sounds good! Are there color versions of any of these films? Black and white is quite dull on the eyes.", "Some of the best movies ever made have been in black and white, but I'm sure there are some remastered colored versions out there, if that floats your boat.", "I see what you're getting out, I'll check some of those movies out. Any newer horror movies you looking forward too?", "None really, I feel that newer horror movies are too cliché and rely too heavily on overused jump scares."], ["What did you think of The Babadook?", "Loved it now that I finally got a chance to watch it. Far too often nidern day horror is disappointing.", "See I knew you would like it, it reminds me of a good classic horror film.", "I can certainly see the comparison, it was refreshing to not rely on so many jump scares.", "Yeah for me it's all about atmosphere and this film had it in spades.", "Agreed it also makes me wonder what Jennifer Kent is going to direct next.", "Whatever it is I eagerly anticipate it, think she's got quite the future ahead of her.", "No doubt about it, Noah Wiseman also played the bratty little kid to perfection.", "He did, but not sure I would necessarily say he was bratty, well okay he was, but more a product of his environment.", "Yeah that kid had things pretty rough."], ["Have you ever seen The Blair Witch Project?", "I did. I saw it when it first came out in theaters actually.", "How did you like it? Was it hard to watch?", "It really was. I literally couldn't stomach the shaky cam.", "That's what made me hate it at first, but I started appreciating it upon subsequent viewing.", "That's how it was with me. You see how terrifying it is after watching it a few times.", "That's true. That's why I don't go into the woods to this day.", "I believe that movie started the whole \"found footage\" movie fascination.", "You're right. That air of mystery and possibility of it being true really draws people.", "I didn't know it wasn't real until the characters came out at the MTV movie awards!"], ["Do you like horror movies", "Sometimes", "Have you seen the blair witch project?", "No it looks kind of dumb to me", "It was a little dumb", "And i dont like movies with the camera like that", "Yea i understand that, it hurts my head", "I dont know why movie companies think its a good idea", "I dont either", "Its an awful idea"], ["Have you seen the movie They're Watching?", "I think so, is that the movie with Brigid Brannagh?", "Yes, I really enjoyed it. I thought they did a good job creating a creepy element with the town and townspeople.", "Agreed, the scene with all of the townspeople gathered outside of Becky's house was very creepy.", "It was! I thought the ending was interesting too.", "Agreed, you pretty much expected Becky to be the witch though.", "True, but they did it in a unique enough way that you don't mind how predictable it was. The effects were well done too.", "They sure were! The magic at the end was really good, and the parts where they found Kate and Vladimir were very well done.", "They were, though those scenes were a bit gory for my taste.", "That's understandable, but they certainly made an impact!"], ["Paranormal Activity was pretty good", "It was and made you think about if it could be real.", "How did you like how the storyline unfolded?", "I though it was a bit dsijointed.", "Id say it was more along the lines of a horror film.", "Yeah but where do you think the film could have gone", "In a direction where you would see something", "The aura of not knowing was the entire plot.", "Yeah it was a strange way to go about it", "But audiences were freaked out I bet."], ["Name a good horror movie for me to watch.", "Warlock.", "What is that one?", "It's an amazing movie from 1989.", "Is there another one?", "Yeah, there is a part 2, which I like better.", "I am a fan of horror movies. Are there any other good ones you know about?", "Yes, Critters is awesome.", "Is that like Gremlins?", "Yes, but it's a bit scarier."], ["I like this movie i am watching", "What is it called", "The amity ville horror", "Ooh i like that one", "I know its scary right", "Yeah it is really spooky", "Yeah it is like terrifying", "I like this director", "We should look up more of his work", "Yeah lets do that"], ["What Stephen King adaptation is your favorite horror movie?", "The Green Mile.", "Try again, I don't consider that horror, even if it's the genre.", "Umm, you go.", "I really liked The Mist.", "What's that about?", "A fog covers a town and huge inter-dimensional spiders invade.", "WOAH, nice for arachnaphobists.", "The best part is the ending: they kill themselves to not be killed by the spiders but the fog is so thick that they can't see the military help that arrives 30 seconds later.", "Dang, that's intense! But thanks for ruining it."], ["Hey are you going to watch the Halloween horror movie marathon this weekend?", "I might, how recent are the movies they are showing?", "Movies from the 80's till this past year.", "Awesome I'm coming over to your place then this weekend.", "I really hope they show Freddy vs Jason that movie was so badass!", "Omg I know.That movie was a dream come true.", "Even though it got a lot of bad reviews I absolutely loved the battle between Freddy and Jason.", "Yes that was some of the best parts!", "I just wish they would make a sequel to that movie already.", "They totally should since it was foreshadowing that Freddy was still alive."], ["So, what horror films do you want to see?", "Well, gosh there's several that have been out for awhile i want to watch but haven't gotten around to. For examples, Train to Busan/", "I don't think I've heard of that one.", "Yeah, it's from South Korea.  It's about this guy and his young daughter who get onboard a bullet and it starts getting taken over by zombies.  i heard it's got a lot of action and is real suspenseful.", "Whoa, that sounds pretty cool.", "Yeah, another one I want to see is The Girl With All the Gift.", "I'm sensing a theme here...", "Haha.. yeah, they both have to do with zombies... although I don't think they're called that in The Girl.", "Yeah, I've heard people praising that film as really good.", "I may have to read the book it's based on first"], ["I need a good horror movie to watch; can you recommend anything new?", "Have you seen Get Out yet?", "No, but I heard about it. Tell me more.", "It is Jordan Peele's first movie as director and he has a good knack for creating suspense and creepy situations.", "Isn't he that guy from SNL?", "Yeah, and there is a comic relief character, but sometimes you need the relief because the movie is so intense.", "So is it like a horror-comedy?", "It is mostly horror, and commentary on how supposedly non-racist liberal whites exploit black Americans.", "Whoa that sounds heavy. Is it preachy, though?", "Nope, but the social commentary is really unsettling."], ["Man check out this costume.  It's looks just like Freddy Kruger.", "Cool.  You going to be Freddy this year?", "No, I was thinking about being the Swamp Monster and having my Mom help me make the costume.", "I'm going to buy mine.  I was thinking about going as Pinhead.  I saw that mask around here somewhere.", "Yeah, that'd be cool.  Those were great movies.", "Yeah, he was pretty brutal.", "What's your favorite horror flick.", "Halloween.  How bout yours?", "I don't know.  The bloodier the better.", "Right.  Like chainsaw massacre."], ["I saw Sixth Sense again not too long ago.", "That's a classic. That's when M.Night Shyamalan was doing it right.", "Yes, he's just now beginning to turn around with The Visit and Split.", "Yeah but in the Sixth Sense, he really got the atmosphere right.", "I agree. No one saw that ending coming.", "Neither did I. Haley Joel Osment did such a great job in that role.", "He really did. Bruce Willis too, but Osment stole the show.", "That part with Donnie Wahlberg at the beginning was one of the scariest parts.", "Yes that and the part with the little girl who kept appearing to the little boy.", "I don't know if I could handle a gift, or curse, like being able to see dead people. It would drive me nuts."], ["What do you think of The Purge movies?", "They're a bit ridiculous but they seem like they could happen in America.", "How could that happen?", "If the NRA took over, it would probably happen.", "Would you consider it horror?", "Yeah, definitely. It's basically home invasion, but the whole country.", "I only saw the first one. Did you see the others?", "Yup.", "How were they?", "The second was awful, but the third redeems itself a bit."], ["Have you ever seen Waxworks?", "The movie with Paris Hilton?", "No, there was an older one.", "Oh, really?  What was it about?", "Some kids go to a wax museum at night.", "Okay, and what happens?", "They get sucked into the exhibits.  Pretty much they die.", "Sounds interesting.  When is it from?", "I want to say the 80s.", "I might have to check that out."], ["Have you seen the movie \"Get Out\"?", "Yes I loved it!", "Wasn't it super interesting?", "It really was. I was so intrigued by it.", "I was too. I didn't expect it at all.", "Remember when he found those pictures?", "Yes! I was so shocked!", "That family was really crazy.", "Yes they were. I'm so glad he survived.", "Me too. That chick was crazy."], ["Did you see the \"Nightmare on Elm Street\" remake?", "Yes, I did.", "What did you think about it?", "It was not my favorite, to say the least!", "I just can not see anyone else playing Freddy. Robert England is Freddy.", "I agree with that. I just don't understand why they felt it should be remade.", "I agree. Would it kill someone to come up with an orginal idea?!", "I know! They are remaking all the classics.", "Instead of remakes of perfectly good movies they could do more sequels, or just leave them alone!", "I agree with that!"], ["What is a good horror movie you've watched recently?", "I watched The Thing again the other night.", "You watch that a lot, you must really like that movie.", "Yes, it's one of my favorite horror movies. Not only that, I think it's one of the best movies of any genre.", "Who directed The Thing?", "John Carpenter, same guy that made Halloween.", "Oh, that was really good too. He is a talented director.", "Yeah, he has a great mind for horror.", "Doesn't it take place in Antarctica?", "Yes, that location is really unique for a horror movie. It also helps create a tremendous feeling of isolation and claustrophobia which really adds to the level of tension and fear in the movie. That's a big reason why I love it."], ["I've been watching a lot of horror movies lately", "Oh yea, any good ones?", "I really like Saw", "It is a classic, especially the 1st movie", "It definetly had elements of mystery and some really horrific scenes", "Being trapped in a room with a physcho like that would make me crazy.", "Yea, I think thats the point", "Saw 2 was pretty good too.", "Yea, it was not a bad sequel", "I liked that it kept the same elements and didnt go too crazy with the storyline."], ["How much did you like The Ring?", "I thought it was an OK movie.", "Why would you say that?", "I just think the premise was boring.", "In what manner?", "Watching a video tape?", "Yeah it was just new.", "But they should have something different that was believable.", "Oh ok yeah I get where youre coming from", "But the villain so to speak was pretty cool in that she was scary."], ["Are thier any good thiller moviers out now", "Over the weekend i watch kissing by sharon sala", "Yeah man she's good", "It had on the edge of my seat", "Everything exspecally when he lock her in the basement for 6 month with no food", "It wasn't funny at all just creepy", "It was really scary", "And creepily", "On Saturday i will see something funny", "But this movie was not bad"], ["I want to watch a good horror movie. Do you know of any good ones?", "I like the Rob zombie films.", "Yeah I've seen some of those they're pretty good.", "The devils reject is my favorite.", "I should rent that!", "I have it, you can borrow it.", "That would be great!", "What are you doing tonight? Come over and watch it.", "I'm free tonight.", "Great, be there at 7:00."], ["Did you ever see Basket Case?", "That is a true cult horror movie.", "That movie is so scary.", "It's really freaky too. The monster is very scary.", "Can you recommend another movie like that one?", "Sure, try part 2 and 3.", "I had no idea there was more than one.", "There is. You should also check out Dead Alive, since that one is an oddball horror flick too.", "I will. Who directed Dead Alive?", "Peter Jackson"], ["The Shining was on last night.  Man, that movie is scary.", "I know.  All work and no play makes Johnny a frightening character.", "Every time it comes on, I have to watch, yet I always regret it.  I have trouble sleeping after I do.", "Yeah, I know what you mean.  It really messes with your mind.", "It's cool, though, how it's become part of popular culture now.  You see references to it in a lot of other shows.", "Really, like what?", "Well, there's one South Park that totally parallels it.  One of the character buys a Blockbuster, so that's kind of like the hotel.", "Oh yeah, I remember that one.  You're right; it is connected.", "And, I think The Simpsons did a parody actually called The Shining for one of their Halloween specials.", "Cool!  I'll have to check that one out!"], ["Do you like the 'Nightmare on Elm Street' movies?", "I do, I was always more of a 'Halloween' person though.", "So you like 'Freddy vs Jason'?", "I haven't seen it actually. Is it good?", "Yeah, it's alright. It's not as good as the individual franchise movies, though.", "Yeah, 'Nightmare on Elm Street' has I think more movies than 'Halloween'?", "I'm not sure - there's loads of both movies though.", "They're classics. They don't make horror movies like that anymore.", "No way. I was so scared of going to sleep as a kid.", "Me too! Freddy Krueger was such a terrifying character!"], ["What lesser know horror film have you enjoyed and recommend?", "Well I saw a film last year pretty indie but sort of known... It follows.", "I have seen it. I t was good especially considering the budget.", "I loved that it was filmed in Michigan my home state.", "Oh that is always neat. To see a film where you know the area super well.", "I also thought it was cool there were no opening credits like it just jumped right in.", "I don't know if I had taken not e of that while watching. I did find it captivating.", "Ya no opening credits and doesn't ever show the title of the film in it until the end.", "Iwonder why he made that choice, maybe because of the impact It Follows could have at the end?", "I think so, works so well with the entire movie plot."], ["What is your favorite movie?", "I like The Revenant.", "Oh yeah that is a good one.  Leo is so good in it.", "Yeah he won the Oscar for that role I believe.", "Yeah he did.  It took him forever to win one.", "Yeah but at least he won it for a good role instead of being given one later just because.", "True.", "So what is your favorite movie then?", "Mine is The Prestige.", "Oh I have never heard of that one."], ["Is the Conjuring series really based on a true story?", "Sort of. The characters are based on real people, Ed and Lorraine Warren, who claim to an exorcist and a psychic.", "The Amityville Haunting was also supposedly based on a true story, but it turned out to be hoax.", "It is hard to make a horror film that is an actual true story. What matters is if it feels real.", "Okay, so does The Conjuring series feel real?", "Almost, except the characters based on the Warrens are too perfect.", "What is a horror movie based on a true story that feels like it could have happened?", "I think Ti West's films qualify, like The Innkeepers.", "What is that about?", "It is filmed in a real inn that is supposedly haunted. Some employees try to see if they can prove it is, and then weird stuff happens."], ["What is the worst horror movie remake you have seen?", "That's a good question.  The first one that comes to mind is Nightmare on Elm Street.", "The one with Jackie Earle Haley as Freddy Krueger?", "Yes, that's the one.  It was scary, but they went too far into the back story.", "Yes, I didn't like the direction they took Freddy Krueger and the parents.", "That's because Wes Craven didn't have a part in the direction of this movie.", "It was interesting to learn about micro-naps in the movie.", "They did keep that part realistic.  That was actually a little scary thinking you could fall alseep without realizing it.", "The ending was kept similar though with Nancy's mom getting pulled by Freddy.", "The original was still better, even without today's digital effects."], ["I love the original Halloween.", "Me too. I watch it every year.", "I love his slow walk.", "It's very menacing.", "Michael Myers is a scary guy.", "He becomes a supernatural being.", "Does he?", "Yes, he never stops. Even after being shot.", "He just keeps coming with that knife.", "He is the greatest."], ["I saw Pet Semetary.", "Cool.  Who directed that?", "Mary Lambert.", "Didn't it star that woman from Star Trek TNG?", "Denise Crosby.", "Right.  Who else was it in?", "Fred Gwynne.", "Cool!  What happens in the end?", "Denise kills her husband.", "Chilling."], ["So, is Psycho the first slasher movie?", "Basically, yeah. There were other things in the next couple decades, but the next heir apparent was probably Halloween -- which, coincidentally, stars Janet Leigh's daughter.", "Oh, yeah. Halloween.", "Then, you know, Friday the 13th is a shameless rip-off. Mask-wearing unstoppable zombie man on a spooky-sounding day, hunting not babysitters but camp councilors.", "Hey... that's... I hadn't thought of that before.", "Yeah, then Wes Craven sorta did a satire in Nightmare on Elm Street... then again, a decade later, with Scream.", "Those are satire? I mean, I guess Scream obviously is, but Nightmare?", "The first one, sure -- though the later ones didn't quite get the joke, aside from Robert Englund being a huge pot of overcooked ham.", "Now that you mention it, there was New Nightmare -- which... wasn't a satire, I guess, exactly, but it was... meta.", "Exactly. That's pretty much all Wes Craven does... er, I mean did."], ["I saw a good horror movie last week.  It was about a guy who wanted to know if there is an afterlife.", "What was it called", "We Go On", "What happens in it", "The guy has nighmares about death and dying and he is afraid of everything", "Sounds bad, so what does he do", "He inherits money and he puts out an ad saying he will pay 30,000 dollars to someone who can prove there is an aftelife", "Sounds really interesting", "Well, lets just say it turns out sort of badly for him", "Don't mess with the Occult heh?"], ["Have you ever seen this horror film called \"Candyman\"?", "I'm not sure.  Who's in it?", "Virginia Madsen and Tony Todd are the main actors.", "Oh, I like Madsen.  She's a good actress.", "I agree.  She does good work in it.", "What year was it made?", "It was made in 1992.", "I like early '90s horror films a lot.", "Well, this one's really creepy!", "Oh, I'll like it then."], ["I saw the scariest movie ever last night!", "What did you watch?", "The original Halloween.", "Oh that is a good one. John Carpenter is a great director.", "I like him too. What's your favorite movie of his?", "I like Escape from L.A.a lot.", "That one is pretty good, not very scary though. What's your favorite scary movie by John Carpenter?", "Probably, Vampires then.", "I liked that one too. Its great when vampires are actually scary and they aren't sparkling teenagers.", "I couldn't agree more!"], ["Have you seen the movie Get Out yet?", "No I haven't seen it. Is it as good as the hype?", "Even better. Jordan Peele did such a good job writing and directing that film.", "I heard that was his debut film too, is that right?", "That's true. And with him being a comedian it's surprising that he could delve into such dark territory.", "Right you are. I've been wanting to see it because I've heard so many positive things about it.", "It's filled with subliminal messages and little easter eggs to look for.", "Right and I did hear it was actually frightening. That means a lot since modern horror movies aren't scary anymore.", "This one definitely is. There's a seen where the main character is sent into the Sunken Place, which is just blood curdling.", "He was under hypnosis, I remember hearing about that part."], ["Have you seen the movie tusk?", "No. Haven't heard of it", "Oh, man. You gotta watch it!!", "What is it about?", "A guy gets turned into a walrus.", "What? That's sounds crazy!", "It is! It's the weirdest movie I've ever seen", "I'll have to check it out", "Please do. It's got johnny depp in it", "No kidding?"], ["I just saw The Shining.", "The movie or the tv movie?", "The movie, 1980.", "Who directed it?", "Stanley Kubrick?", "I remember Jack Nicholson, but not the wife.", "Shelley Duval.", "Right.  What happens in the end?", "Nicholson gets lost in the maze and freezes to death. He ends up in the old photo of the place.", "Wow, neat."], ["Have you seen Black Coat's Daughter?", "Yes, last week. Did you like it?", "I did and didn't. Did you?", "I think you should elaborate more. I did like it.", "Fair enough, I enjoyed that it was an original take on a horror movie. I disliekd how slow the pacing was.", "I did also find it very slow. But I think that created the tension to some degree.", "Probably true. What I also found tricky was that emma roberts was suppose to be the one character Kat grown up.", "Ya, that took me a while to figure out, those actresses don't really look alike to me.", "Exactly. I will say it is one of those films that stays with you after.", "Yes I find myself relfecting on moments or thinking of it after too."], ["What's the worst horror movie that you enjoy watching?", "I loved watching The Stuff when i was a kid.", "I never heard of it before. What is it about?", "It had to do with some yogurt that was being sold that was taking over the bodies of people after they ate it.", "Wow, that actually sounds pretty scary.", "How about you? What horrible horror flick did you enjoy most?", "I think my all time kid favorite was The Gate.", "I remember that one. It was about a family that lived in a house that had a gateway to hell in the basement. What year did it come out in?", "I think it came out in 1987.", "Yeah that sounds right, i was about 8 at the time. No wonder it freaked me out pretty good."], ["Did you ever see Halloween?", "The original one, yes.", "That was a spooky one.", "Yes, Michael Meyers always creeped me out", "Wasn't Jamie Lee Curtis in that one as well?", "Yes, I believe it was one of her first movies.", "I just remember her going into the house at the end", "yeah, that was pretty freaky.", "I always thought she was a good actress.", "Yes, I agree"], ["Did you watch The Ring 2?", "Yea, unfortunately. It was very bad.", "Oh, why do you say that?", "Because, it was basically the same movie as the first one, except now, we already know what happens.", "Oh yea, I see your point.", "Yea, the only twist they put on it, was now it deals with college kids.", "I liked how the threat became global.", "Yea I guess that was pretty interesting. But what does that even mean really?", "I don't know, I guess we'll find out in the ring 3!", "Haha, no thanks, I'll skip the next one"], ["Have you seen any good movies lately?", "Paranormal activity", "Those are good", "They are, i enjoyed them", "They are a lottle confusing though", "Yes they are", "They should have didnt them more in order", "Yes they should have", "They were still good though", "Yes"], ["What do you want to watch tonight?", "Oh I'm in the mood for monster on the loose.", "Great I know a great one. Pumpkin Head.", "Sounds good, what's it about?", "It's about this guy who's son was killed by some out of towners and he summons a demon from hell to avenge his son's death.", "Who is in it?", "It's the guy that played the cyborg in Aliens, the one that saves Sigourney Weaver and the little girl.", "I don't remember his name but I know who you are talking about.", "It's a really good movie and there is no CGI at all.", "Sounds good, let's see some revenge!"], ["Do you remember that movie with Eliza Dushku in it about 15 years ago?", "Was it the one where they were camping?  Pretty sure the name is Wrong Turn.", "I remember now.  That was such a great movie.  I wished the sequels were as good as the original.", "They never are.  The ending was my favorite part when they came back to the convenience store to rip down the map.", "That was funny.  I was really sad when the boyfriend was hit with all the arrows.", "That was upsetting.  He almost made it back to the truck, but the killers were just too good at hunting.", "How about the part with the ranger station in the trees?  Would you have jumped out of it?", "I would definitely have jumped because it was on fire.", "I can tell you this, I did not want ot take a camping trip to the mountains anytime soon after seeing that movie.", "Just don't take any unmarked roads and you'll be fine."], ["Did you know that Johnny Depp was in the first Freddy Kreuger movie?", "What?  This is news to me!", "Yeah, I think it was one of his first ever movie roles.", "This had to be during his 21 Jump Street years, right?", "I think so.  It sounds about right.", "That's so weird, I don't remember him in that movie at all.", "Well, spoiler alert he actually dies in it.", "Oh, maybe that's why I don't remember him.", "Still, he had a pretty big role in the movie.", "I think I should rewatch it to see him."], ["What do you think is the scariest movie you've ever seen?", "I'd have to say \"It.\" that movie really messed me up.", "That was scary. What part do you think was the scariest?", "Probably when he came up out of the drain in the shower.", "Oh yeah, that was really creepy.", "I was scared to shower for years after I saw that.", "I think the scariest parts were the flashes where they'd see him watching them, but then he'd be gone so fast.", "Tell me about it.I thought I saw clowns everywhere for a month after I first saw it.", "Did you know they're remaking it?", "I heard that, I kind of want to see it, but I'm still pretty scared of it. I don't know what I'll do."], ["What's your favorite horror movie?", "Of all time? Probably 'The Shining'.", "Oh, good one. That's scary because it's kind of 'real life' terror.", "Exactly - I'm not scared by monsters and zombies and stuff.", "'The Exorcist' is another great one like that.", "Exactly! I like when scary stuff just happens to normal people.", "I saw 'The Blair Witch Project' in cinemas and that freaked me out so bad.", "Before anyone knew it wasn't real? Oh, me too. I was so scared.", "I saw the original 'Jaws' in a cinema too, and that is so much scarier on a big screen.", "People don't think of 'Jaws' as a horror movie but it's terrifying!"], ["What horror movie do you feel is truly original?", "I thought Cabin in the woods was a very original take on the horror genre.", "I will say the put an interesting twist on archetypal horror film stereotypes.", "Well said.i also loved the amount of humor they showed. Truly a fun horror film,", "I did also aprreciate the humor found in it.", "Chris hemsworth role was kind of flat though.", "I barely remember his role at all.", "Kristen Connolly's role was much more memorable. But she is less well known in general.", "Ya she is less popular but I think a great actress. I liked her in the whispers tv show.", "She was a lso in house of cards.. but I like her best in cabin in the woods."], ["I finally saw Light's Out!", "By David F. Sandberg, starring Teresa Palmer?", "Yeah but I never heard of those people before. Palmer was so cool, though, as the lead.", "Did you notice her Sandman poster on the door? Best Easter egg of the year.", "No, I didn't, but it's cool to have an alternative type strong female lead in horror.", "I agree, and her boyfriend was kind of the damsel in distress!", "Actually everyone was strong in their own way. I love when characters in a horror movie aren't useless.", "Yeah, this movie did not feel like a slasher or an exploitation flick at all.", "Is there another movie like that you would recommend?", "Well, have you seen Hush?"], ["How do you feel about Scream?", "For its genre it was not that bad", "I liked the ensemble cast", "Yeah that helped with the acting", "I think that it really did a great job but they should have stopped at the first one.", "Why  the second was better!", "I think the scenes in the 2nd one relied too much on the first.", "Yeah well it was almost the same premise.", "Thats why they should have just done 1", "Well thats not how they do it in horror movies in Hollywood"], ["Have you ever seen the Blair Witch Project 2?", "No, I didn't know there was a second one.", "It's actually a scary movie.", "Oh, the first one really wasn't scary at all.", "This one is more like a movie, not a lost and found footage deal.", "What's it about?", "A group of young people go into an old house and find a witch.", "And they probably all die?", "Pretty much, but the music and the atmosphere were dark and scary.", "I might have to see it."], ["Do you watch horror movies?", "Yes", "One of my favorites was the haunting", "Thats the one where they were doing a sleep study right?", "Yes, thats the one", "I remember that one", "Did you like it", "Yes it was pretty good", "The children were creepy though", "A little bit"], ["How did you feel about the original Paranormal Activity?", "That was a fantastic concept.  It was one of the first crowd-funded movies.", "I completely forgot about that.  My name is in the credits for contributing on the DVD.", "Mine too!  The movie started a bit slower, but definitely got more intense.", "Yes, I found I would think about the movie when trying to go to sleep.", "I would get scared that my husband would start screaming in the kitchen or something.", "At the end, when she popped up really close to the camera, I screamed.", "Oh, I did too.  I was so embarrassed in the theater.", "I will admit, I thought that maybe this was a real found footage movie by the end.", "I did look up the characters and actors too to make sure it was just a movie."], ["What do you think is the scariest horror movie?", "I would have to say some thing with a paranormal element.", "Like Blair Witch?", "That one is so scary! When they are running with the camera, I always scream!", "I like stuff with vampires too.", "Or anything with a ghost element.", "Like Paranormal activity?", "That one and the second one, wow, when the baby is all possessed!", "The Conjuring is another one.", "I need to see that one!"], ["Out of all The Shining remakes out there, none has out done the original.", "They really can't. Everyone knows what's going to happen in that story.", "True, but they could try to find an actor that matched or surpassed Jack Nicholson's performance.", "I don't think there are that many actors that can. That guy is good at what he does.", "I know, right. He really made The Shining the classic it is.", "Can you imagine a different actor sticking his face through a hole in the door he had just made with an ax and looking as psycho?", "Not today. I think that's my favorite scene in the movie.", "That's everyone's favorite. I remember being scared out of my mine watching that for the first time.", "That wasn't as scary as the naked, decomposing woman in room 237.", "I used to avoid staying in hotel rooms with that number for a long time just because of that one scene."], ["What do you think was the best zombie movie of all time?", "There's really only one choice.  Night of the Living Dead.", "For sure.  Even if it's not THE BEST in terms of plot it's actually way up there.", "It is, not only that it was ground breaking.", "The way the zombies kept coming, we've never seen that before Night of the Living Dead.", "And the famous line, they're coming to get you Barbara.", "I love that line.  One of the best in movie history.", "One criticism, the consistency could use some work.  Medium zombies, slow zombies, they were all over.", "Yeah but the plot and acting were great, and give it some slack it was the first of it's kind.", "Definitely one of the scariest movies ever made."], ["Isn't it cute that Sarah Michelle Gellar and Freddie Prinze Jr. are still married?", "It's adorable! Weren't they in a horror movie together at one point?", "Yeah, it's called I Know What You Did Last Summer.", "What is that movie about?", "It's about a group of people who cover up a car accident and then they're stalked by a killer.", "Oh, stalker horror movies are the best.", "I know! They always give me the creeps.", "Yeah, I start looking over my shoulder a lot more after watching one.", "And I get paranoid about hearing things in my house at night.", "I guess that's the point of watching a horror movie."], ["What's your favorite horror movie?", "That's a tough one as there are so many. I've always been partial to the Shining.", "The old one, right? The new one wasn't nearly as good.", "Definitely the old one. It deviated from the original a lot, but it was so well made.", "Jack Nicholson is truly frightening in that movie.", "He does a really good job of showcasing the descent into madness.", "Those twins in the hallway were super creepy, too.", "Yeah and the naked chick in the tub? So gross.", "I wasn't really a fan of the portrayal of Wendy.", "She did seem a bit whiny and incapable, didn't she?"], ["I been looking into some movies wondering if they are scary or not", "let me know what they are called", "Well they are made by some little company and were straight to VHS", "Okay then", "They were called puppet master", "Oh those movies those are cult classics", "So they are good", "Yeah they are good horror but not really scary", "Oh why not", "Just the theme is scary but never hits the mark but they are good"], ["Whats the scariest movie you have seen recently?", "Well, I would have to say The Conjuring.", "I have heard of that, whats it about?", "Its about a family that moves into a house controlled by a demonic witch.", "Wow, sounds pretty scary.", "Yeah, and they claim its based on a true story too!", "Dang, that just makes it even more spooky.", "I don't really believe that its based on a true story though.", "Why is that?", "I have heard people say they visited the actual house and nothing happened, and people currently live there."], ["I wasn't too thrilled with the movie we watched last night.", "Which one was it?", "The horror film, Ghost Ship.", "Not sure if I saw that one.", "It was okay, but I wouldn't tell anyone to watch it.", "That bad.", "Well it had it's moments. Like when a cord came down across deck and cut people in half.", "Sounds a little gory.", "Yeah, a little, but other than that, nothing to brag about.", "Guess that's why I don't know that movie."], ["Hi.", "Hey there.", "Do you watch a lot of horror movies?", "I wouldn't say a lot.", "Not a fan.", "I like them alright.", "Oh okay.", "What about you?", "Yeah love horror movies.", "cool."], ["Were you ever a fan of the Nightmare on Elm Street series?", "Was I? Most definitely, since I was 6 years old and saw part 1 for the first time.", "That's the best one in my opinion, all the others were not so good.", "You're right, that was the best one but I liked part 3 also.", "That was The Dream Warriors right? The one with the kids in the mental hospital?", "Yes that's a classic to me. That's the last of the series that actually had some scares in it.", "I agree with that. Did you see Freddy's Dead? Part 6 I believe.", "Yes when the woman found out she was Freddy's daughter? That was a fun movie, not scary but entertaining.", "Yes I loved the cartoonishness of it, and that we got to see Robert Englund out of makeup.", "That rebooted version of Nightmare on Elm Street was terrible. They should have left it alone."], ["When did you see your last movie in theaters?", "I went and saw Fate of the Furious about a month ago.", "Oh yeah I saw that one too.  I didnt really like it thought. What did you think?", "I was a fan but I am a sucker for that series.", "Or maybe more specifically you are a sucker for Vin Diesel.", "That is true, I do like movies he is in.", "Does that include the XXX movie franchise.", "Oh absolutely! I love all of those.", "I did not like the newest one, The Return of Zander Cage.", "Yeah that one took a dip but I still loved it."], ["So, what are some of the more recent good horror films?", "Jeez. I can't get on board with most of them. So many weak franchises", "I'm with you there. Annabelle, Conjuring, Insidious. It's just all the same", "Isn't it funny how horror works? So many trends and ripoffs.", "The last good ones were The Babadook and The Witch", "I really loved The Babadook. And The Witch was quite interesting", "Not as scary as hyped, mistake in marketing there.", "I can't even think of any horror titles coming out this year actually.", "I know. It's really depressing", "Think I'll just go back to the old classics, like Halloween"], ["What was the last horror movie you watched?", "I like the classics, so it was Evil Dead.", "The breakout role for Bruce Campbell?", "Yes, exactly.  It's my favorite movie of all time.", "What is so appealing about it?", "The grittyness and the creativity.", "What do you mean by that?", "Well, they had a limited budget so they never let you see the real evil spirit to maintain a constant tension.  They also got very creative for the special effects and makeup due to the low budget.  The film quality, or lack thereof, lent itself to the overall eerieness of the movie too.", "So nothing to do with the acting itself?", "No, the acting was also great.  Bruce Campbell is a bit hokey but still feels real, like how an actual person would when faced with possessions in a cabin in the woods."], ["Do you like horror movies?", "Sometimes, but I hate being scared.", "Stop by a punk, why are you scared so easy?", "It just gives me nighmares and I'd rather not watch them at night.", "So you watch them in the day time?", "Yes, that is the only time I can.", "I really like watching them at night in the dark.", "Why is that.", "It gives me and thrill and I try to guess when the action is coming.", "You are funny and it is probably fun to watch a movie with you."], ["Did you enjoy Scream?", "Yes, it was probably the best horror film of the 90's.", "I am a big fan of the slasher genre.", "Me too. There is so much to like about it.", "I like Psycho and Halloween.", "Which one do you like best?", "I prefer Halloween, just because I saw it first.", "Donald Pleasance was great in that film.", "Yes and so was Jamie Lee Curtis.", "I think Halloween is the best of the slasher genre. But, Scream is definitely up there with Friday the 13th."], ["Which did you find scarier conjuring 1 or 2?", "Hands down conjuring 1. It was way scarier and better performances all around.", "I disagree for me the second was more frightening in general.", "I will say Vera Farminga was very good in both.", "She is the queen of horror to me.", "Agreed. But the performance for the supporting actors was stronger in the first conjuring.", "Maybe the daughters in the first one were all very good especially given the ages of some of them.", "Exactly, I especially thought  Mackenzie Foy was great. i also loved her in interstellar.", "She is a great little talent , sure we will see more of her. I liked Joey King.Patrick stewart was just  okay.", "Funny patrick and King are both in the tv show fargo but different seasons."], ["I think I have watched all the horror movies on streaming! All that is left is zombie movies, which I do not like.", "I know a zombie movie you would probably like.", "Which one?", "The Girl with All the Gifts. It has an 84% rating on Rotten Tomatoes and Roger Ebert gave it 3/4 stars.", "I don't like zombie movies, though. How is this one different?", "It s beautiful and haunting and a very fresh take on the genre. The main character is a young girl, very intelligent, and Glenn Close plays a lead role.", "Glenn Close, in a zombie movie? What is the plot?", "A fungus is taking over humans and turning them into mindless zombies. But children who were infected while still in the womb might be able to resist the fungus.", "Is the young girl you mentioned one of those children who can resist it?", "She might be. But if she is, Glenn Close's character wants to use her brain to make a vaccine."], ["I saw The Blair Witch Project.", "Cool.  Wasn't that low budget?", "Yes, it cost $60K but made $250M.", "Who directed it?", "Daniel Myrick and Eduardo Sánchez.", "Who was the girl?", "Heather Donahue.", "What happens in the end?", "It is implied everyone dies.", "Cool."], ["I watched A Nightmare on Elm Street and I don't know if I should watch the sequels.", "You definitely should! At least watch some of them. Especially Wes Craven's New Nightmare.", "Is that the remake?", "No, it is a sequel after one of the times Freddy Krueger supposedly dies. But it is directed by Wes Craven, who also did the original.", "If Kruger is dead, how can they make a sequel?", "This movie takes place in \"our\" world, with the actors and even Wes Craven playing themselves. Even Robert Englund plays himself.", "Whoa, that sounds meta! Does he still play Freddy or what?", "Yeah, but the Freddy that appears isn't the same as the one in the first movie. It's scarier and less funny, the way Craven originally thought of it.", "Is the same girl the main character?", "Heather Langenkamp is the lead, yeah, but she's an adult and is kind of tired of only being known for her role in the Nightmare movies."], ["Hey what's your favorite scary movie?", "My favorite horror movie is The Shining", "With Jack Nicholson right?", "Yeah he did a fantastic job in that.", "Have you read the book?", "Yes I did, I'm a huge Stephen King fan", "What did you like most about the movie?", "I loved Kubrick's directing, how meticulous he was. And I loved the Suspense factor.", "How many times have you seen it?", "At least 20 times since my childhood."], ["You know what movie I watched the other day?  Bram Stoker's Dracula.", "Oh, I haven't seen it in a while.  I remember liking Gary Oldman in it.", "Of course!  He's outstanding in it.", "When he was old dracula, that makeup was amazing looking!", "Yes, and his accent is pretty good, too.", "He can play anything, and I'd believe it.", "You know who's really bad in the movie?  Keanu Reeves.", "Oh man, he's a terrible actor.", "I wonder why Coppola cast him in it?", "I don't know.  He ruined the scenes he was in, but it's still a good film."], ["Do you have a favorite Stephen King movie?", "In general, I think his movie adaptation are pretty awful.", "I didn't think the Shining or Carrie were bad.", "He does have some good ones, but then there are ones like Dreamcatcher.", "In his defence, Dreamcatcher was a pretty wild book to start with.", "yes, toilet weasels are pretty hard to make believable.", "I think a lot of his stuff is hard to make into a movie because of all the stuff going on in people's heads.", "His books are so long, too, that the really good ones are the ones where are there are lots.", "You mean like the stand and IT?", "Yes, exactly, with a longer scope, you can really explore the horrors of the story."], ["What is the scariest horror movie you have ever seen?", "I don't really like horror movies.", "Really? I love them.", "Ya they are just not my thing. The scariest one I have probably seen is Scream, if you count that as a horror.", "I guess you could count it, although it is not the scariest.", "Ya. They were ok movies. I just don't like a lot of violence.", "Ya I get that. Which one is your favorite?", "I have to say number 3. I really like Courtney Cox", "Oh ya she is one of my favorites. If you aren't to afraid you should check out I Know What You Did Last Summer, its not to scary.", "Ok. I will definitely think about it."], ["Have you seen all of the Leprechaun movies?", "Yes, except the one that WWE made. That was not good.", "Which is your favorite?", "Part 1 of course. But, part 2 and 3 have a special place in my heart.", "What happens in Leprechaun 2?", "He kidnaps a girl and then marry's her.", "That sounds crazy. What happens in part 3?", "He is in Las Vegas in part 3.", "Wow, cool and where is part 1 set?", "It takes place on a farm mostly."], ["Jason versus Freddy was awful in my opinion.", "Why?", "I just think they are 2 different horror characters.", "Yeah I see what you mean but it was a combination of both.", "I think you could have gone with Jason versus anyone else.", "Well Freddy exists everywhere.", "But just in dreams.", "So you think Jason cant arrive in dreams", "I think then you go to almost science fiction", "No it was a horror movie and it worked right into what the movie should have been"], ["Did you see the new movie the ring?", "No, have no", "No i havent either", "It took them a long time to come out with another one", "I know, i wonder why", "Me too", "Its like they didnt plan on it and then suddenly they did", "Yup, that sounds exactly right", "I wonder if its any good", "Me too"], ["What's your favorite horror movie?", "Has to be Texas Chainsaw Massacre.", "Oh, God. That movie scares me so much!", "Ugh, the sounds in that movie alone are enough to creep me out.", "Yes. Like in the beginning with those camera bulb flashes and the high pitched twanging noise?", "That scared me, too! Hey, remember when the girl is in the farmhouse and she stumbles into that room of bones?", "How could I forget? She falls down, she's crying, and she's just covered in all those human bones.", "Yeah, and there's like a lampshade with skin on it.", "That movie destroyed me for years. Like, I think I developed a condition.", "Who could blame you? I can't think of another film that's been nearly as terrifying."], ["Are you a fan of zombie movies?", "Yes, I absolutely love them.", "Me too!  I even like the really cheesy ones.", "Yes, they have a pack of movies at Walmart for like $5 and it has a few bad zombie movies on it.", "I hope The Walking Dead has a movie at some point.", "I think that seems like a logical way to go.", "Maybe have the series end and then have a movie afterwards.", "Yeah, I don't really like prequels but I feel like The Walking Dead needs one.", "It's hard to keep up with indeed.", "Still, nothing beats Night of the Living Dead."], ["Did you ever watch the Excorcist movies?", "Like the Excorcism of Emily Rose?", "No, just The Excorcist.  The original.", "No, I actually never watched it.  Was it good?", "That was one of the scariest movies I had ever seen.  And I hadn't seen it for the first time until the nineties.", "Who was in it again?", "It was Linda Blair.", "Wait, that's the one with the girl in the bed, right?", "Yeah, she's possessed by the demon.", "It's a really popular scene.  I've just never seen it."], ["Did you read Goosebumps as a kid?", "Yup fun books!", "Now, did you see the movie?", "I did, but on my own. No way was I seeing that in theaters alone.", "You'd probably get arrested.", "Funny. So what's your question?", "What did you think of it?", "I don't know how well it stuck to the books or not, but I did enjoy it.", "Is it appropriate for kids? I'm looking to show it to mine.", "I'd say above 10 is fine. it's not scary as much as it is nostalgia for us."], ["Have you seen the movie get out?", "No not yet", "I want to go see it this weekend", "It looks so wierd but i want to see ot too", "Im hoping to have a date night and go", "That sounds fun", "Yea it does", "I might go see ot this weekend now", "I hope you like it", "You too"], ["I hope Alien Covenant is as good as the original.", "Me too, the orginal scared me half to death.", "Yeah, when the alien starts popping out of the guys chest as they are eating, I definetly went and hid under a blanket.", "Ridley Scott knows how to craft a scary movie.", "It was all that fog and those close up shots, you never knew what was around the corner.", "Yes, and in the end when you think yoru safe and Sigourney Weaver is getting undressed and she spots the alien in the escape pod.", "I know i went and hid.", "Yeah, but then she blasts that thing into space and its all better.", "I hope Scott Ridley did as a good a job on the new Alien movie", "I am sure he did at its as scay as the original."], ["I watched this movie called Train to Busan recently and thought it was so good!", "Is that the zombie Korean movie?", "That's the movie. It's about a train that's been infected by a zombie outbreak. The passengers are trying to avoid infection and can't get off the train so it's really suspenseful and scary.", "That's been on my top list to watch. Korean horror movies have really taken a step up in terms of quality. I have gotten tired of movies like The Conjuring and those Paranormal Activity movies.", "Oh this is definitely still a take on zombie movies but they just know how to add good drama to go along with the heavy horror elements. I was at the edge of my seat the whole movie, as it's such a quick pace movie, the zombies run!", "Is this like the World War Z zombies that chase and pile on each other?", "Actually it kind of is, there's one scene where the zombies outside the train are trying to catch onto a train and create a chain to reach the train, it was pretty awesome.", "Do you know who the main characters are in this movie?", "I don't remember their names but the group of characters center around a father and his young daughter as well as a group of people who are really good actors. I cared for all of them, rooting for them to survive.", "I'll have to give Train to Busan a watch, this sounds like the fresh type of horror movie I need to catch."], ["What is your favorite Stephen King movie?", "Carrie", "That is perfect. I love that film.", "I love many other ones too.", "Name a few.", "Cat's Eye, Pet Sematary, Salem's Lot, Christine", "Those are all good.", "Did you ever see Silver Bullet?", "No, is that good?", "It's an amazing werewolf movie."], ["What's your favorite horror movie?", "It's hard for me to say actually. How about you?", "One of my favorites is Dawn of the Dead.", "I absolutely love zombie films. Have you seen Resident Evil?", "I seen a few of them but i haven't caught up on the last two films.", "The Final Chapter is so worth checking out.", "I know the first 3 movies in the franchise were really good.", "Yeah, Extinction was probably my favorite of them all.", "I would like to see a Resident Evil mash up movie with Evil Dead.", "Wow, that actually sounds like a great idea."], ["Have you seen Dracula?", "The 1990's version?  Yes, one of the best movies ever made.", "The score to it was amazing and creepy.", "Plus the way Dracula seemed to unbeatable.", "I remember just being in shock when he fed that baby to his wives.", "And how he controlled wolves to seduce Mina.", "Gary Oldman was fantastic as well.", "Don't forget Anthony Hopkins.", "Yes, as Vanhelsing.  He was awesome.", "He always is though."], ["I just watched Green Room and I will never look at Patrick Stewart the same way again.", "I know! He was really creepy as the neo-Nazi.", "You saw it, too? What did you think?", "I liked it. It was brutal but human and kind of darkly funny at times.", "It was too brutal for me, I had to look away a lot.", "Yeah, the special effects team had a lot of fun with this one.", "I liked how creative some of the survival strategies were. If I was being hunted down by neo-Nazis I would die so fast.", "Well, do not book a gig in a skinhead bar and you should be okay!", "Most of all, I felt kind of bad for the dogs.", "Even the ones eating people?"], ["We spoke about Nightmare on Elm Street losing it's luster after Freddy became too much of a comedian, but Wes Craven's return to direct New Nightmare was pretty good!", "I think the fact that Wes Craven came back to direct really stood out in that movie. I loved the meta theme of that movie.", "It was brilliant! He structured the movie to appear as if we've been watching actors in the movie playing actors in a Nightmare on Elm Street movie!", "I love Heather Langenkamp, and I'm glad Wes brought her back to play Nancy once again, although this time she played herself as Heather, being the actress Nancy!", "The concept of the movie had me sold from the start and when I heard Heather was back I knew I had to check this out back then.", "I think Heather was last scene in Dream Warriors, the Third Nightmare on Elm Street, which was probably the last one of that was decent and a lot of fans really have that as their favorite.", "I enjoyed Dream Warriors a lot. It was fun, it was scary, we got a horrifying Freddy, but there were shades of Freddy getting too corny with his lines.", "Let's not even talk about the next few, but back to New Nightmare, the way the put Freddy in there was so well done. I didn't expect the puppetry to come to life but Wes is a genius. He made this work.", "New Nightmare to me, is a classic, but I think fans that enjoyed the comical wise cracking one liner Freddy, didn't enjoy it as much. The true fans will hold New Nightmare in high regard though.", "It's probably my second favorite to the first Nightmare on Elm Street with a young Johnny Depp, don't forget about that!"], ["What's the wirst horror film you've ever seen?", "Worst would have to be Uncle Sam. It was about a veteran that came back from the dead and wrecked havoc, just awful.", "Ha I've seen that one, my pick would have to be Troll 2.", "No way Troll 2 is amazing in a so bad it's good sort of way.", "I saw nothing redeeming in it and the acting, my God!", "Well when one of the main characters is a real life dentist with zero acting credits, what were you expecting, Al Pacino?", "Well no of course not, but I wasn't expecting George Hardy either.", "Don't be so hard on poor George the dentist.", "Maybe I should give it another watch, it has to be fair been years.", "Absolutely you should, just remember that Nilbog is Goblin spelled backwards, you will understand if you don't remember that line."], ["Hey, what's your favorite horror movie.", "Hmm.  Friday the thirteenth", "Oh, which one?", "The first one when first meet Jason.", "Yeah, that's pretty cool. I always liked the second one best.", "Well, what's your favorite horror movie?", "The Omen.", "That's super creepy.  Damian is Evil!", "I know.  When he shoved that lady off the balcony...", "Yeah, it's the scariest."], ["Did you like The Exorcist?", "I think it was a good film.", "Not great?", "I could name better horror films.", "No way, Linda Blair killed her role.", "She was great in it but I was not a huge fan of the flick.", "I think you could say the film was pretty good.", "For the time period yes.", "I think the element of religion playing into it was risque at the time.", "I think our nation was depraved enough by then to be able to incorporate it into a horror film."], ["Have you ever seen Psycho?", "Yes that's a classic! Alfred Hitchcock was the master of suspense.", "He really earned that title too. That movie was so scary for an old film.", "I think it's because there was so much mystery and suspense rather than in your face gore.", "Right, they don't do it right these days. That's the first movie I can remember with a twist at the end.", "Probably the best twist in a movie in history.", "I agree with that. And Anthony Perkins was born for that role.", "I heard Alfred Hitchcock purposely chose someone who displayed feminine traits.", "Right, so he could look convincing as a mama's boy.", "I know the scene in the shower was and still is one of the scariest in movie history."], ["Hey what was you favorite horror movie?", "Hands down John Carpenter's The Thing.", "Really? What is the reason you chose that old film?", "It's a classic! It's story is impossible to reliably copy and pull off today.", "It was just another alien flick?", "No, it was an alien that assumed the identity of those it killed. The old film really had you guessing who was who.", "That's true. I will admit it was and still is a cult classic.", "Don't you remember they were going to do a remake a few years ago but the director said he didn't want to ruin the film so he did a prequel instead.", "That was suppose to be a remake? I'm glad it wasn't, because you were able to tell who was killed outright.", "Exactly, the original never eluded to who was killed and in what order. The film was perfect in my opinion and modern day directors should really take note of that element."], ["What was the scariest movie you have ever seen?", "Well I watched the movie Black christmas way too young. Still scares me now.", "I think I recall that one. Mainly takes place on a campus at christmas right?", "Ya. I found the serial killer so scary. What is your scariest?", "So many but the conjuring is up there for me.", "I was terrified watching that one.", "Ya it is so scary, and based on true events.", "The warrens are the real people who investigated it right?", "Yes, and apparently there were even some freaky things happening to cast members while filming.", "I did read of vera farminga's laptop being scratched."], ["Do you know if the movie Abattoir is good?", "It is interesting but not for everyone. Do you like the work of Darren Bousman?", "I liked the first Saw. What else did he do?", "He did the cult horror-musical Repo! The Genetic Opera.", "I did not like that one. Is Abattoir more like Saw, or more like Repo?", "It's really like neither but also like both. It is stylized like Repo!, but has a mystery and production value closer to Saw.", "What do you mean when you say Abattoir is stylized?", "It is in the neo-noir genre, and the lead actress, Jessica Lowndes, has this sort of 50s pin-up style. It was so noir at times that I thought it was set in the 40s or 50s.", "Is it in black and white?", "No, it just uses the aesthetic of noir. The colors are actually very striking."], ["Have you heard about the new Saw movie coming out?", "I did hear they are making another one.", "I heard Jigsaw will be in this one.", "Oh, I had not heard who was in it.", "I am not sure why they they killed him off just to have him be in them.", "I don't know why they would go through all the trouble of that.", "I hope it is not silly. Sometimes the sequels get stupid.", "I agree. But these movies seem to keep the attraction of the orginal.", "Let's hope this one does as well. I know I will see it.", "Me too!"], ["Do you remember the Joss Whedon movie, Cabin in the Woods?", "I love that movie!  It was so scary and unique.", "I was so surprised when Chris Helmsworth's character died.", "I wasn't expecting him to hit that invisible wall and fall to his death either.", "It was great when all the bad guys got their revenge at the end.", "Yes, it was strangely satisfying to see them attack the employees.", "I felt bad that the world was ending though.", "Well, yes, the ending indicated that we were all going to be destroyed.", "I suppose not all movies can have a happy ending.", "You never know, the day may have been saved somehow."], ["I just saw Three Extremes.", "Never heard of it.  What's it about?", "Three short horror films directed by three separate East Asians.", "Which film was your favorite?", "Dumplings, by Lillian Lee.", "What happens?", "An aging actress buys dumplings for her youth.", "Sounds innocent.", "The dumplings are made from aborted fetuses.  She kills her own fetus to eat it.", "Sounds gross!"], ["Note to self: Never watch the Exorcist alone at night ever again.", "Wow. That movie gave me nightmares.", "You have to come see IT with me when it comes out.", "No way! You know how much i hate clowns.", "Is the Conjuring sequel any good?", "Its almost as good as the first one.", "Is Ghostbusters considered a horror movie?", "I think it does because it does deal with ghosts.", "Well I'm not going to the beach anymore.", "Let me guess, you finally saw Jaws."], ["Do you like The Evil Dead?", "Yes, I love it", "Have you seen part 2?", "Yes, I love all three.", "There are 3?", "Yes, Army of Darkness is the third one.", "Wow, I never knew that. I will watch it.", "It is really good. Part 1 is the scariest though.", "I know. That part with the pencil was cringe worthy.", "The hand in part 2 was pretty awesome. That whole movie was so gory."], ["There is a new horror movie out.", "Ok those are rare, when they have good reviews, in modern times.", "Yes that is true.", "What is it about.", "The guy from Key & Peele did it?", "So is it a comedy?", "It combines most every element of a film.", "Ok that sounds great.", "Yes it is a great horror film also, Get Out is the name.", "Ok thanks for telling me."], ["Have you ever seen the Texas Chainsaw Massacre?", "I've seen a couple of them.", "Which ones did you see?", "I'm not sure.  I was younger and really into horror back then.", "You aren't now?", "Not so much.  I think I'd cringe to see limbs being sawed off.", "You could watch it with no problem then though?", "Pretty much.  It was terrifying and I loved it.", "Weren't the movies based on a true story?", "I think they were very loosely based on a number of stories."], ["Dont Breathe is such a good film.", "I think it was pretty good to be honest.", "It was a simple horror film without major effects.", "Yeah and sometimes that is the best, you dont need CGI", "Well it was before the days of that.", "But you could still have the visuals.", "The thieves that broke into the house in the beginning of the film.", "I think that set the tone for the entire movie.", "Yeah and it was acted in a way that didnt feel fake.", "Yeah this was a good film when you think about it"], ["Did you think Hellraiser was a good film?", "Yes and no.", "Whys that?", "I like films with killers that could be legitimate.", "So you think the main actor was too fictitious?", "Yeah and that made the movie seem out of touch", "Well all horror films are mostly out of touch so to speak.", "They are but this was fake-ish in my mind.", "I agree that you could say that but its what the genre is about", "The guy almost looked like he was a robot in most of the film."], ["Do you like zombie movies?", "Sort of I guess?", "Why only sort of?  I love them!", "They all are pretty cliche.", "Oh, I get what you mean.  Is there anyone you actually like?", "I guess Resident Evil movies are okay.", "What do you like the best about those?", "I guess I like that they are faster than regular zombies.", "See, they aren't all cliche!", "Yeah, I guess.  I still don't like them though."], ["I just saw Pontypool. Have you seen it?", "I've seen that it's on Netflix, but haven't seen it.", "You should check it out.", "What's it about?", "It's sort of a zombie movie.", "Sort of?", "The entire movie takes place inside a radio studio and you don't see anything until the end.", "Ooh, like War of the World where you just hear the aliens?", "Yeah, sort of. But this is new because the virus is spread aurally, instead of a blood infection.", "That sounds like it could be either really boring, or awesome."], ["Have you seen any creepy movies lately?", "Well the last one I watched was Split.", "Oh, was it pretty creepy?", "Yeah kinda.", "Did you jump a lot?", "There was one part I jumped real bad, toward the end of the movie when he turned into the monstor.", "Oh wow, that does sound creepy.", "But overall it was a really good movie. There was several parts I liked.", "Yeah? I realy like M Night so I'll have to try it.", "Yeah, you should!"], ["I watched the movie \"Devil's Rejects\" last night.", "Oh, I have seen that, Rob Zombie at his best, I've watched it three times.", "Yes, what a crazy show that was, I loved it!  My favorite character is Captain Spaulding.", "He's great, isn't he?  Come and get my FRIED CHICKEN!", "Did you notice that the actor from the Hills Have Eyes has a small role in the film?", "Yep, that's Micheal Berryman, and boy is he ugly, but what a perfect mug for a horror movie!", "I thought the use of \"Freebird\" at the end of the movie when they are in the car was perfect.", "Yes, Zombie always uses songs well, the Allman Bros. song at the beginning of the show was so cool.", "I'm going to have to watch this movie again,  I have a feeling there are plenty of things I missed!", "Yes, play close attention and oh yeah, next time you get ice cream, make sure its Tutti effing Frutti!"], ["What is your favorite horror movie?", "I love everything made by James Wan", "What films has he made?", "The Insidious series, The Conjuring series and others.", "What do you like about them?", "I like the way he can make anything look scary.", "Are there jump scares?", "Yes. Although, Wan uses a jump scare as part of the build-up to the actual scare.", "How is the music in his films?", "That's one thing I especially like. He doesn't use music in the scariest scenes. The silence is terrifying."], ["What's the latest horror movie you've seen?", "Prevenge", "Prevenge? What's that about?", "Instructed by her unborn child, a pregnant woman goes on a killing rampage. She's trying to avenge the wrongful death of her baby's father.", "Wow, that sounds different. Was it good?", "It was, actually! It's a British movie with an element of comedy/satire.", "Who's the director?", "I don't remember her name, but she wrote and starred in the movie as well. It's great to see more women getting involved in the horror genre.", "I agree! Diverse perspectives are always good.", "Yeah, I'm looking forward to checking out any other movies she might do."], ["I just saw The Others.", "That's an oldie, no?", "2001, Nicole Kidman.", "Neat.  What's the plot?", "Nicole and her two kids are holed up in a spooky house, post WW2.", "Is the house haunted?", "Yes, it is.  She tries to get rid of the ghosts.", "Does she succeed?", "No.  In fact, she discovers she and the kids are ghosts!", "Wild, interesting."], ["Have you seen any of the Freddy Krueger movies?", "Yes, I have seen two of them.", "What did you think of Nightmare on Elm Street?", "It had a good plot, and really gave me a good scare.", "It really scared me too. That's why I loved it and went on to watch more movies.", "I really enjoyed the ones that I watched too.", "What scared you the most about the movie?", "Well I would have to say Freddy Kruegar!", "Are you going to watch the rest of the movies in this series?", "Yes, I sure am! I think I will watch Nighmare On Elm Street 3 tonight!"], ["Are you a fan of horror movies?", "No, I'm a bit of a wimp. Maybe I have an overactive imagination.", "It always surprises me how many are coming out in theaters. It seems like there are a few new ones every month.", "I always associate these movies with Halloween and specific circumstances, but it's really an all year thing.", "I've only seen a few in theaters, but you're right, I don't think they were around Halloween.", "Have you seen The Grudge? I saw that one in the theater and couldn't ride an elevator alone for a few weeks after.", "That was a scary one. It was more something jumping out at you and surprising you than just being a scary concept.", "The Sixth Sense got me too. That was more a scary concept than the shocks every few minutes.", "And of course the great twist at the end.", "A very good movie, but still made me want to sleep with the light on for a few days."], ["Hey, have you ever seen the original version of The Exorcist?", "The one with Linda Blair?  I saw it some time ago.", "I think it's one of the scariest movies ever made.", "It really frightened me when I saw it.  It stays with you.", "Yes, I didn't want to turn the lights out when I went to bed after watching it.", "That scene where Linda Blair's character vomits is so gross!", "I have laughed at that part when I've been in the right mood.", "I think it's so eerie when she talks in that possessed voice.", "Oh, that's one of the more disturbing parts.", "I used to do an impression of her voice when I was in college.  People would laugh."], ["Have you ever seen Salem's Lot?", "No I haven't. What's it about?", "It's an old vampire movie.  It's actually the scariest movie made in my opinion.", "Really?  Why?", "The first time I ever saw it i was a child and I guess it made a big impact on me.", "I can understand that.", "There is a scene where this kid is in his room at night and he is woken up to a vampire kid scratching on his window trying to get it.  It was really creepy.", "That does sound scary and I am not even a child!", "I'm telling, you, you should definitely watch this movie.", "Well,since it is scary I will wait and watch it with a group of people during the day!"], ["Hey dude you watch any good horror movies lately?", "Yeah, I actually did, I watched a Get Out.", "How was it?  I heard it was directed by a Jordan Peele.  Isn't he a mostly comedy actor and writer.  It seems a little odd he would direct a horror movie.", "Yes, I thought the same thing but the movie was very well made and it works.", "How so?  What makes it great.  From the trailers it looked like a very serious horror film.", "The movie is more of a horror-comedy satire that deals with people's fears about race in a very smart and funny way. It's very well directed and the plot really takes you on a rollercoaster ride from start to finish.", "Wow that sounds interesting. I'm definitely going to check it out.", "Yeah you should.  It has great performances from the pretty much everyone in the cast.", "Was there anyone in the movie you liked best?", "Definitely Chris' best friend Rod, he really steals the show with his comedic performance but also the great choices he makes in the movie."], ["Have you seen It Follows?", "Yup! What did you think?", "It's weird. An STD demon.", "Right? It's completely unusual for once.", "So, question about it.", "Go ahead.", "If it's given to an astronaut and they end up going to space, would...", "... it follow?", "Ha, nice continuation.", "If Jason can go to space, then so can this. It's probably in their mind anyway."], ["Name your favorite horror movie?", "I don't like horror movies.", "None?", "I've seen some but no, I don't like horror movies.", "Wait a minute. Didn't you say you're a big fan of The Walking Dead?\"", "Yes, I am. My wife finds that hilarious too I like zombie shows and zombie movies.", "But you don't like horror movies? How is that possible?", "I don't know. I guess I like watching people kill zombies, or zombies kill people but I don't like seeing people kill people.", "That's just wierd.", "Yeah, I guess it is. But that's the way I am. I've dislike horror movies since I was a kid. I only saw my first zombie movie about ten years ago though."], ["Are you fan of Wes Craven movies?", "I liked Scream. Did he do anything else?", "Oh for sure. Nightmare on Elm Street", "Is that the one with the claws on the hand", "Yes, Freddy Krueger", "yeah, I remember seeing him in a lot of promos back in the day", "Yes, he was part of teenager's nightmares that would become reality", "Wow, sounds pretty far out", "Yes, some of the early ones were very weird and disturbing to watch.", "Hmm...not sure if I can watch something like that."], ["What's your favorite horror movie?", "I'd have to say A Nightmare on Elm Street", "Oh yeah, that movie's great! Do you mean the first one?", "Yeah, the original Wes Craven film. Although, I did like all of the movies in the series.", "I didn't really like the second one as much as the rest, how about you?", "The second movie is definitely the worst in the series, but it's still fun to watch. I just like watching Freddy kill teenagers.", "Did you know that in the first film, Glen was played by Johnny Depp, and it was his first movie role?", "Oh, totally! He also makes a cameo in the Freddy's Dead film, which I thought was awesome.", "Yeah, that movie was fun. Did you see the 2010 remake of A Nightmare on Elm Street?", "No, I don't like the idea of anyone playing Freddy but Robert Englund."], ["What do you think of them redoing IT?", "I am excited for it.. have you seen the trailer?", "I have and I do think they did a good job creating a creepy vibe.", "I think it will be even better than the original It. It was a tv mini series and this is a movie which makes me think it will be better right away.", "Maybe had not taken that into consideration. Probably won't have time to focus as much on the backstory of the characters.", "True,I hope they don't loose the essence of the story itself. But think it looks amazing.", "The new pennywise is super scary, I love tim curry but the updated version is even scary.", "Bill Skarsgård is set as pennywise in the new version. i don't know him to well, but think he will give a worthy show.", "He seems so young, but then you see him in the make up and trailer and he is so menacing.", "He really is. I am looking forward to his performance. As well as the kid from stranger things performance."], ["What do you think about Romantic Horror movies?", "I do not even think I know of any.", "Sure you do. Like, warm bodies.", "With the Zombies?", "Yes, it is like a love story but also super filled with horror.", "Don't they all just die.", "No, they slowly come back to life.", "How?", "With love! It is equal parts scary and sweet.", "I might check that one out then."], ["The purge is so creepy", "Yes it is", "Im glad theres not really something like that", "Me too", "That would be terrifying", "Absolutely", "I would make sure never to make enemies and be super nice to everyone", "Me too", "I hope something like that never exists", "Me too"], ["So, what genres of movies do you get into other than comedy and action?  Do you watch horror?", "Not in general, though I did like the Evil Dead series and I also liked the Hellraiser series.", "Oh, that's interesting.  Evil Dead is comedy-horror and Clive Barker is supernatural horror and body horror.", "Wow I didn't know that.  I just thought of it as creative horror.", "Well it has to do with what is causing the feeling of horror in you.", "The thing is, it doesn't cause horror as much to me.  Now The Ring, that was more scary to me.", "Yes, that was scary.  I guess different strokes for different folks when it comes to horror.", "Yeah, I think it was visually creative with Pinhead and those other guys.", "So, what else do you remember from the Hellraiser movies?", "I remember the part at the end of one of the movies when that guy said, \"What is your pleasure?\", and he was on that rotating thing."], ["Have you ever seen any horror movies starring Jamie Lee Curtis?", "Yes, I think I have.", "One of her movies is called Halloween that came out in 1978.", "Oh yeah, right. Of course I've seen that movie.", "I always thought of that movie when I went babysitting!", "Me too! Jamie played the part perfectly.", "She was quite a match against Mike Meyers.", "She sure was. I can't think of a better character for him to go up against.", "Did you see the next Halloween movie?", "Yes I did, I didn't think it was as good as the first, but I still liked it. It's a classic."], ["What horror film do you feel should get more attention?", "For recent movies I would say the witch.", "Anya Taylor-Joy as thomasin ,is really incredible in that role.", "Yes she was. I also thought overall that movie was great and underappreciated.", "Ya for such a well done film, did not really get the attention it deserved.", "They put a lot into authenticity of the film.", "How so?", "Well the dialect to start with, but even the costumes. They had the fabric woven the traditional way to have be true to the times.", "Wow I did not know that. Even more impressive now.", "They also had shot in the now rare 1.33:1 aspect ratio ,I guess represent the time/ era better as well."], ["Debate time, horror movie edition.", "Okay, go ahead.", "Evil Dead 2: Remake or sequel?", "That's so easy it's insane.", "I say remake, it's practically scene-by-scene", "And the graphics are better, maybe it's like the new editions like George Lucas did?", "Right!", "Wrong, very wrong.", "What makes you so sure?", "Different cast. Only Ash remains--it can't be a remake with different characters, silly."], ["Have you seen the original Evil Dead?", "Yes the very definition of horror.", "It was awesome.  Those daemons singing we're gonna get you was creepy.", "And that three, how it just violated that poor woman.", "That's how low budget movies should be.", "Yes, and Bruce Campell was awesome.", "Bruce is always awesome.", "The sequels were both good too", "Yeah but for different reasons.", "I know, Evil Dead 3 was hilarious."], ["You've seen Psycho right?", "Only the remake, wasn't it mostly shot for shot anyway?", "It was, but there's something about the black and white that adds to the suspense and while I like Vince Vaughn, he's no Anthony Perkins.", "I'll have to watch it, I do enjoy old horror movies.", "Oh you will undoubtedly love it, then you will want to watch the sequels, won't get enough of Normon Bates.", "I'm pretty excited, maybe I'll watch this Saturday evening.", "Let me know if you do, I'll catch it again. Another one you should check out would be Black Christmas.", "Haven't seen it either, but I hear it influenced Halloween.", "Oh it sure did, without it John Carpenter may have never had the inspiration.", "Wow a world with no Michael Myers, thanks Black Christmas!"], ["I just saw this great horror movie called Lights Out.", "I did not see that yet, is that the one with the blind man hunting people down?", "No, that is Don't Breathe. Lights Out is way better.", "What is it about?", "A young woman from a dysfunctional family reluctantly goes back to help her kid brother face a supernatural threat, while her mentally ill mother resists her.", "Is it a haunted house movie?", "Not exactly. The being can appear in different places, but only when the lights are out.", "That sounds like a childhood nightmare come to life! What is Don't Breathe about then?", "Don't Breathe is the one with the blind man who turns out the lights to track some young thieves in his house.", "Okay, I think I know the difference now."], ["Have you seen The Autopsy of Jane Doe?", "No I haven't but isn't Emile Hirsch in that?", "Yes, Emile Hirsch and Brian Cox play a father and son who run a business operating a coroners office. The local sheriffs bring in an undamaged body from a heinous crime scene and want them to figure out her cause of death.", "Wow, that sounds pretty intriguing! This is a horror movie right?", "Oh yes it definitely is a horror movie. The suspense is excellent. There's a huge aura of mystery and the uneasiness I felt watching this was so terrifying it was good.", "Does the whole film take place in this coroners office?", "Pretty much, it takes place in the coroners office which gives it a creepy claustrophobic feel. The setup is very terrifying and the suspense as they're trying to figure out Jane's death is so unnerving.", "Is this more supernatural horror?", "There's definitely a supernatural horror element about this film. I won't spoil much but the first half of the movie during the autopsy on Jane is really startling with each discovery they find, and there's a lot of strange happenings that occur in the coroners office after the body arrives.", "This sounds really good. I'll have to give it a watch! I think I remember Andre Orvedal directed it, he did a fantastic job with his other movie called Troll Hunter. I'll have to look for this!"], ["Did you ever see any of the Poltergeist movies?", "Yes I've seen them all. Do you have a favorite?", "Well part 1 will always be my favorite but part 2 comes in a close second.", "Same for me, I loved the relationship between the Native American man and the little girl Carolyn.", "She actually died not long after the making of those movies.", "I know, a few people did. There were rumors that the movie was cursed.", "Right because I believe they were toying with subject matter along with relics that they shouldn't have.", "Part 3 wasn't all that good but it's still better than most modern horror movies.", "That's absolutely true. The part where she gets sucked into the puddle in the parking garage was frightening.", "I loved the use of mirrors in that movie. It shined a light on duality."], ["Are you a fan of horror films?", "No! I did like Paranormal Activity, however.", "That was a good one! I never saw the sequels.", "Those were okay, but the original is all you had to watch.", "What a great concept.", "I know! The filmography was fantastic. A truly original idea.", "Do you think more will be made?", "Probably not. They put out like 3 or 4 movies in just a few years.", "I know. They did not take their time with those.", "I liked Paranormal Activity 3 as well."], ["Big fan of horror movies?", "Depends, I really like the 80s slasher flicks", "Which ones?", "Halloween and Friday the 13th", "Oh yeah, Halloween was freaky.", "Yeah, still kind of spooky to watch these days", "Michael Meyers was creepy", "Yes, especially with that mask.", "Yes, All white and brown hair. Very scary looking", "Yes indeed."], ["Have you seen the movie It Comes At Night?", "Yes, and I didn't like it at first.", "I had the same reaction, but than I decided to dig deeper?", "What do you mean, what did you find?", "I found that the ending was supposed to give a feeling of being unresolved.", "Is that so?", "It involved true terror and some questions were never answered.", "I get you, like who was the original carrier of the illness.", "I wondered if the baby was even sick at all.", "So this was the intention of the filmakek to leave us questioning."], ["Have you seen Cabin in the Woods?", "Yes, it's one of my favorite horror-comedies.", "Should I see it?", "Well, sure. It's hilarious, super gory, meta, sexy, and fast-paced.", "Sounds like something I'd like. I heard good things about it.", "Yeah, It had great reviews!", "What did it get?", "Something like 90% on Rotten Tomatoes", "That's awesome.", "For a horror movie, yes, they're usually very poorly made."], ["Have you watched any good horror movies lately?", "I watched Mirrors, have you seen it?", "not at all, tell me about it", "it is a supernatural horror film", "who is the lead actor?", "Kiefer Sutherland,  a suspended police detective", "tell me more", "On Ben's first night of patrol he finds a mirror that appears to be covered with handprints, but only on the reflected side of the glass.", "Mjm that seems very scary", "it is, it is one of my favorites horror films"], ["Have you seen texas chainsaw massacre?", "No ive never watched it", "Its really good", "I dont want to watch it", "Why not?", "I dont like horror movies that are based on true stores", "Oh i guess i can see that", "Yea it just makes it creepy", "I understand that", "Thanks"], ["Have you seen 'Paranormal Activity'?", "Yeah, I didn't care for it though.", "Neither did I. I'd heard such good reviews.", "It just didn't scare me. The acting in the normal scenes was so corny.", "I thought so too - they were kind of bad at normal acting, which made the hysterical acting just seem ridiculous.", "It didn't even creep me out. I was pretty disappointed.", "And there's so many sequels!", "Exactly! I'm sick of Hollywood not making any original horror movies.", "It's all just remake after remake. I liked the English language remake of 'Let The Right One In', though.", "I haven't seen it - I've only seen the original."], ["Have you seen any new horror movies in theaters lately?", "Yeah, my sister and I watched \"Life\" the other day. It's a Sci-Fi horror.", "Oh I watched a trailer on that one. It kind of looks like an off-shoot of Alien.", "Oh I watched a trailer on that one. It kind of looks like an off-shoot of Alien.", "Give me a quick run down of Life?", "No! I will do better then that. How about I take you on Saturday after we get off work.", "I would love that, as long as it does not have a lot of jump scares. I love to see Ryan Reynolds in a Sci Fi movie as well. I loved him as Dead Pool!", "Oh he is a great actor, but then so is Jake Gyllenhall. You won't be disappointed. And \"Life\" as a few good jump scares, but you will be fine. A good horror movie is not good without a few of them to keep you on your toes.", "True. Now you have me all psyched to see it. Saturday won't come soon enough.", "Gives you something to look forwards too!"], ["Have you ever seen the Final Destination series?", "No, what's it about?", "It a really good horror series. There's five movies and they're all about different disasters that people saw before they happened and were able to save everyone.", "Well, that doesn't sound like a horror movie at all!", "You would think, until Death comes back for them all. They start dying in the order they would have if they hadn't been saved, in really gruesome ways.", "Wow! And there's five whole movies about this?", "Well, they all kind of connect. In the first one, one girl survives, but then she tries to help the people in the second one and ends up dying then.", "Cool! Any thing else I might like?", "There's also a twist ending with the last one, but I don't want to spoil it for you!", "I'll let you know if I watch them!"], ["Have you ever seen the movie, It Follows?", "Yes I did, it was really freaky!", "My favorite part is when they actually shoot 'it' and realize that it can't be killed.", "My favorite part is the last scene where 'it' starts throwing the electronic devices in the pool to try and kill the girl its following.", "Yeah that parts really freaky, how it shows up as her dead father.", "Yeah it really illustrated how much 'it' wants to hurt people both mentally and physically.", "It makes me wonder how it all started following people and killing them.", "It is almost like it came from a demonic ritual or some type of weird spiritual thing.", "Yeah, it really does. I wish they made another movie that explained it more.", "That would be interesting, I'd definitely watch it."], ["I'm dying to see that new Annabelle movie?", "Which one is that?", "Its called Annabelle Creation and its about that doll that's possessed.", "Did that come from those Conjuring movies somehow?", "I think so.  I remember that now that you said something.", "Yeah, the doll was in the beginning when the couple were talking about some cases they solved.", "Speaking of, I really liked the Conjuring. Patrick Wilson was good in that.", "He was.  He's never really blown me away though with his acting.", "Did you know that movie is based off of real people?", "Yeah, Ed and Lorraine Warren?"], ["If you have not seen Cabin in the Woods yet, stop and go watch it.", "I saw it! Joss Whedon did great.", "Did you notice Thor was in it?", "Chris Hemsworth? Yeah, he was all right. I liked Marty's character best.", "He made me think of a smarter Shaggy from Scooby-doo.", "He was good at pointing out the obvious things, like maybe not going into the scary basement. He felt like an audience member sometimes.", "Sigourney Weaver's cameo was nice, too.", "I loved the elevator lobby scene. It is probably my favorite, even better than the one in The Shining.", "Did you expect the ending?", "Not at all! I cannot believe they ended it like that!"], ["Hey Bryan, tomorrow is Halloween do you want to have a monster movie marathon?", "Sure Mike what movies do you want to watch?", "I was thinking maybe we can start with Puppet Master, what would you want to go with next", "How about we do the classic Nightmare on Elm Street", "God that movie gave me nightmares when I was a kid.  How about we also add \"Basketcase\"", "Don't think I know that one but sounds good to me, any other good scary movies?", "Jeeper Creppers is a great monster flick also", "Oh yeah I remember that one", "I'll get the beer if you want to pick up some popcorn and chips", "On my way to the store right now.  See you tomorrow night"], ["Did you ever see the Halloween movies?", "I've seen them.  Not a big fan though.", "Oh, I thought Michael Myers was awesome.", "I wouldn't want to meet him in the street, but there are scarier movies.", "He is iconic though, right?", "Definately.  And the Halloween theme is downright awesome.", "Oh yeah, the song is totally creepy.", "Wasn't it a low budget film?", "I think it actually was.  Maybe independent when it came out.", "Well, for being low budget, it didn't do bad."], ["Have you seen the others?", "Yes", "Its one of my favorite movies", "It is a good movie", "I love the twist at the end", "Me too", "It was so interesting", "It was and all through the movie you didnt expect that", "No it was done so well", "Great storyline"], ["Did you like The Ring?", "American or Japanese?", "American. We all know the Japanese originals are superior.", "Of course. And yes, I really liked it.", "I couldn't buy Naomi Watts in it. She was irritating.", "Point taken. But Samara was awesomely creepy.", "Yeah, is that where she crawled out of the screen?", "Yeah, but that's not what bugged me the most.", "What part was?", "When she slowly crawled out of the screen, but teleported next to that guy. It was shocking."], ["What are your thoughts on the shinning?", "I watched this on tv when I WAS VERY YOUNG AND IT HAS SCARED ME SILLY EVER SINCE.", "How young, not that it isn't scary at any age...", "Maybe 8-9, too young. It really impacted me.", "That is very young. There is so much to this movie, you probably did not fully grasp it at that time.", "Very true. so much went right over my head. The more times I see it the more I notice like references to native tribes.", "Yes there is a lot more than first meets the eye. They even have a documentary on the making of the shinning.", "I heard stephen king really did not like the film version and felt it was not his original vision.", "Ya King was not a fan of the film at all. I however am a huge fan and especially of shelley Duvall's performance.", "She was great in this film. I also thought Jack nicholson's performance was oscar worthy."], ["What's your favorite type of horror film?", "I like the home invasion thriller.", "I thought you liked all those big slasher and ghost films.", "Not anymore.", "What changed?", "I don't like things I can't believe in. Ghosts, spirits, exorcisms, and so forth aren't real. So I can't believe in them.", "So why home invasion?", "Because I'm now a home owner and it's a legit fear and can happen. It's something I can relate to.", "You enjoy thinking about your home being invaded?", "No, I just like horror movies and this type strikes close to home."], ["I loved An American Werewolf in London", "For the time period it was made, yeah it was pretty good.", "Would you call it a comedy", "No I would say its horror with comedy mixed in.", "But not like a scary movie.", "No, I liked the idea of the guy never knowing when hes going to turn into a werewolf.", "Thats sort of a scary proposition.", "No its really scary and well put together", "The acting by David Naughton was top notch.", "It was one of his finest works."], ["What was your favorite era of horror films?", "Wow that's tough, The 80's probably with the 70's and 50's close behind.", "The 80's had so many gems.", "It absolutely did, Nightmare On Elm Street, Friday The 13th, even some of the early Halloween sequels.", "Yeah and Michael Myers, Jason Voorhees and Freddy Krueger, that alone wins it for me.", "They are the not so holy Trinity of horror characters in my mind.", "Would have to agree there my friend, even though some sequels we're pretty maligned.", "Make as many films as all three of those characters have and there's bound to be a few stinkers", "Oddly enough even the less harealded films were still enjoyable.", "Yeah can't go wrong with classic horror movies."], ["So do you like Horror movies?", "I do every once in a while, have any suggestions?", "I love Cabin in the Woods, it was so good.", "What is so good about it?", "It just turns the whole horror movie trope on its head.", "So is it even a horror movie?", "Oh yes, it is scary, but it also is very self aware of itself.", "I love those type of movies, who is in it?", "No one really big, except for Thor himself, Christ Hemsworth!", "Thor in a horror movie! I am sold now."], ["Have you seen the new horror movie Get Out?", "Is it the one directed by Jordan Peele?", "Yes! It was a low budget movie, but it grossed so much.", "I saw that one! It was so good!", "It just shows never to underestimate a movie base on their budget.", "So true.  The story line was so intense.", "I was at the edge of my seat the entire time.  Who would have thought Rose's family would be so crazy?", "I would have ran if I met her family.  Chris was so brave to stick it out for the weekend.", "I know! Who would have thought Rod would recognize Logan, or else they wouldn't have figured everything out.", "That's what makes this film so unpredictable."], ["Did you see the Halloween movie marathon AMC had on this weekend?", "yes! I saw all he nightmare on elm streets they had on Friday night.", "Which one did you see first?", "They started with the first film, the one with heather langkencamp!", "She is so great, I love when she's taking a bath-", "And his claws come up!!", "THROUGH THE WATER!!!", "THROUGH THE WATER,,,,,", "{}", "{}"], ["Hey.", "Hey.", "What was the last horror movie that you saw?", "I watched nightmare on elm street not too long ago.", "Where did you see that?", "It was on TV.", "It's a classic.", "Yeah I loved it.", "80's horror movies always take me back to my childhood.", "Yeah same here."], ["Are you a horror movie fan?", "Well actually I am!", "Me too! How many horror movies you watch a week?", "I watch roughly about three a week.", "Do you like old horror classics or the newest horror movies?", "I prefer old horrors.", "So do I , do you like black and white horror films?", "I like a few old classics.", "We should have a movie night so we can watch some old horror flicks.", "Sounds great! I would love it."], ["Did you ever see the Ring?", "That movie freaked me out a little when it came out.", "Everyone was really first getting their cell phones and didn't want to answer them.", "Oh, I remember.  I remember finding out my brother was watching the movie.", "Did you call him right after?", "Yes.  It was so funny!", "I bet he freaked out!", "Yeah, he did!  He thought he was getting a call because he watched the movie.", "I bet there were a lot of people doing that around the country.", "Oh, I bet."], ["Have you ever seen The Ring?", "Yes I have and it was terrifying!", "I couldn't even look at a vhs tape after watching that movie.", "Same here! I was afraid that watching the video within the movie might put me in danger too.", "That movie freaked a lot of people out. The sequel wasn't all that great.", "That's true, even with Naomi Watts in it again it still fell short.", "Have you seen the new version?", "I have and I wish I could get the time back that I spent on it.", "Me too, it was pretty bad. I love when the girl Samara steps out of the tv screen though.", "That never gets old to me. I always wonder though, why don't they just pull the plug?"], ["Are you more of a Friday the 13th or Nightmare on Elm Street fan?", "I'm definitely more of a Friday the 13th fan. I've watched the whole series of 10 and the remake countless of times.", "I think I started off more of a Nightmare on Elm Street fan but after they made Freddy Krueger too comical, it lost me.", "Yeah I think I with Friday the 13th you know what you're getting with Jason, he never says a word, he just goes on his way with his cleansing of Crystal Lake.", "Actually Jason does go through changes. Did you notice ever since Friday the 13th Part 2 and on, he obtained something new each movie.", "What do you mean? I know they kill him off every movie but he comes back some how. I'm not sure about the changes you mentioned.", "Well excluding the first one, which was his mother as the killer, in the second one he got the sack over his head, the third one he got the mask, the fourth one the machete, the fifth one we don't count since it wasn't him, the sixth one he's basically a zombie revived, the seventh one is when Kane Hodder took over the role of Jason, the eighth one he can basically teleport, the ninth one he's reborn, the tenth one he's a cyborg!", "Oh I see! Yes, he definitely does gain something every movie. I think my favorite was either the 4th one or the 6th one. I did find the seventh one, The New Blood, interesting with Tina and her telekinetic powers.", "I think Friday the 13th Part 7, the New Blood, is definitely underrated. It gets a bad rap because the studio had to cut a lot of footage to get in to go into the ratings.", "I wish we got 7 in it's entirety some of the footage I saw looked pretty brutal. I think it would of been a top three if it was released as the director intended."], ["Are you a werewolf movie fan?", "Yes, I like them all.", "Which one do you like the best?", "An American Werewolf in London", "Did you see the original Wolf man?", "Yes, with Lon Cheney Jr.", "I have one for you. Did you see Bad Moon?", "I love that one!", "Cool, not many people know about that one.", "I know all of the werewolf movies."], ["Did you have a chance to see The Conjuring yet?", "I just watched it last night on HBO.", "Can you believe that it is based on a true story?", "I know, creepy right?", "When the mom started getting bruises on her, I was terrified.", "That part was scary because it felt like ghosts could finally really hurt a person.", "I jumped when the demon was on top of the bureau in the girls' room though.", "Oh, that part made me scream out loud.  I woke up my dog!", "It was great to finally see a movie that was scary without gore.", "You are right, there wasn't the gross factor in this one."], ["I loved the horror movie The Crazies. Did you ever watch that one?", "Thats with Timothy Olyphant , right?", "Yes.", "Funny how he's a cop in that one too.", "Yes, he does seem to play a policeman a lot.", "That was a pretty good movie.", "Could you imagine having an outbreak like that and people going nuts.", "Seems like they do anyway.", "True. Real life has become a horror movie.", "Sad but true."], ["Hey have you seen a good vampire movie recently?", "Not in a while. I think A Girl Walks Home Alone at Night was good.", "The Iranian one with Sheila Vand on a skateboard?", "Yes, the vampire girl on a skareboard! It was slow but moody.", "Have you seen Only Lovers Left Alive?", "No, what is that one?", "Tilda Swinton and Tom Hiddleston play vampire lovers on different sides of the world. It is moody, too.", "Is it a modern vampire movie or a historical one?", "It takes place in modern times. In fact, they restrict themselves to specially \"purified\" blood because the modern lifestyle makes himan blood gross to them.", "Haha, organic vampires, I love it."], ["I think one of the best horror movies of the '80s is Fright Night.", "It's great.  I liked the humor in it.", "It did have a sense of humor about the whole genre.", "I like the actor that play Jerry Dandridge.", "Yes, that's Chris Sarandon.  He's pretty great.", "I liked the bits where he flirted with Charlie's mother.", "Yeah, that was amusing.  He's a sexy guy.", "I liked the scene where he breaks into Charlie's room and threatens him.", "That was classic.  That would scare me to death if someone like that moved in next door.", "It's really not given the credit it's due."], ["What was your favorite horror movie that came out last year?", "Hush. You?", "Are you telling me to be quiet?", "No, the movie Hush. It's about a home invasion but the woman is a deaf-mute writer and has to survive.", "Neat! My favorite was 10 Cloverfield Lane.", "How much did that link up with Cloverfield?", "I know they said it's in a \"shared universe\" but there was almost no connection.", "Really? None?", "Yeah, it seems like the invasion that happens was the same species that fell to earth in Cloverfield.", "Seems good but I hate that it's the same \"universe\" but doesn't work well. Kind of like Prometheus and Alien, right?"], ["What's your favorite scary movie?", "That's funny, because that line is in my favorite scary movie.", "You must be talking about Scream.", "Scream is by far my favorite horror movie franchise. I like guessing who the killer is.", "I always get it wrong. I thought Dooey was the killer in every movie.", "Wow! You were ay off.", "Which one of the Scream movies was your favorite?", "It was definitely the first one. It made me jump quite a bit.", "Not to mention, it was the one that was the most unpredictable.", "The only one I didn't really like was the third one."], ["Did you like Let Me In?", "It was such a good film! I am glad you brought it up!", "The themes in it were so real", "Yeah bullying is an issue", "And I think people neglect their children when they have money.", "Yeah for real and thats why it was such a good horror film.", "So you have that back story to know why they did what they did.", "Exactly and you are on the edge of your seat.", "Not knowing what could set the boy off.", "Yeah and it was made recently, in a time when the horror genre is dying off"], ["I love spooky movies", "I like them for the atmosphere", "I know thats the best part", "Yeah how it builds up tension", "And then once that is built up it scares you", "Yep thats the best part", "Glad someone finally agrees", "Who would disagree", "I do not know many who like horror movies", "They are lame"], ["What do you think is a great horror film?", "Leprechaun is great.", "I agree. Have you seen Wishmaster?", "Of course. It is amazing.", "I like old horror movies like Hellraiser and An American Werewolf in London.", "Those are great films.", "I even like the old, old ones like The Wolf Man from 1941 and Dracula wkith Bela Lugosi.", "Have you seen any new horror movies?", "Yeah, I don't like them as much.", "Me neither. I think they are boring. I prefer the classics."], ["I just saw Rosemary's Baby at film class.", "Cool.  Who's in it?", "A young Mia Farrell and John Cassavetes.", "Neat.  What's it about?", "Cassavetes has the devil impregnate Mia.", "Crazy.  How's the acting?", "Great.  Ruth Gordon's in it.", "From Harold and Maude?", "Yes, she plays a cool but evil neighbor.", "Sounds spooky to me."], ["What is your favorite horror movie?", "I love the classics.  Can't go wrong with Friday the Thirteen or Nightmare on Elm Street.", "I love the classics too, but I really love the original Halloween movie.", "I like that one too.  I wish they would stop trying to remake the original though.", "I know.  Me too.  You know another movie that I really like?  Texas Chainsaw Massacre.  The new ones were crazy!", "I agree.  I was on the edge of my seat the entire time!", "I hear the Texas Chainsaw Massacre movies are based on true events.", "No way!  That makes the movies even scarier!", "Know another one that's based on true events?  The Strangers.  That movie kept me up for days!", "I agree!  Definitely one of the scariest movies I've seen!"], ["Has David Lynch done any horror movies?", "That depends on how you define horror. Mostly his films are more weird than scary, though I think Fire Walk With Me was horrific.", "What's that one about?", "It is a prequel, and kind of a sequel, to the TV series he did with Mark Frost, Twin Peaks. It follows Laura Palmer up to when she was murdered.", "I have not seen that show. Is it any good?", "It is amazing! But not as dark as the movie. Sheryl Lee, the main actress, conveys fear and anguish so well in the film, compared to the quirkier show.", "Do I need to see Twin Peaks before I watch Fire Walk With Me?", "You probably should. Especially since there is a new season that has a lot of horror elements, that picks up 25 years after the movie.", "What makes Fire Walk With Me scary?", "There are these supernatural beings and bizarre happenings surrounding Laura Palmer, but nobody but her seems to know about it. She is just a teenager but she is being targeted by spirits from another world."], ["You ever see Friday the 13th?", "I believe so, the one with Jason and the hockey mask?", "Well, yes, but the original one was a bit different.", "How so?", "Well, Jason didn't actually have a hockey mask.", "Oh really, what did he have?", "it was more of a sack with an eye hole", "Creepy", "Yeah, and the big twist was that his mom was the killer at the lake", "I missed that one."], ["Have you seen Green Room?", "Yes, it is so good!", "I know right? I loved the actress from arrested development.", "Alia Shawkat is her name. she was maybe on arrested development. Sam in green room.", "That's right. She looks different now. But still realized where I had seen her prior.Thought she was great in this film.", "She was good, but for me the stand out girl was Imogen Poots.", "She was barely recognizable in the role of amber.", "That was a great role very badass. and she was great in it!", "Agreed she was also very believable. Overall such a thrill ride of a film!", "So many good performances and the plot and pacing was perfect."], ["Is there a certain horror movie you always watch in October?", "Indeed, I always make sure to see Halloween.", "Is that the movie with Jamie Lee Curtis in it?", "Yes, it was her first horror movie.", "I remember now.  She was dubbed The Scream Queen.", "Did you know that she used her own clothes in the film?", "That is neat.  The soundtrack really made the movie scary.", "The music was creepy as well as the mask.", "The mask is actually William Shatner's face painted white.", "It is amazing how creative John Carpenter is."], ["Did you watch the movie Split?", "I did and found it bizarre.", "So its definitely a horror movie.", "Yeah they did a good job with plot development", "I was not a fan of the ending though", "Alot of M Night's movies have bad endings", "Yeah once they get to the twist it falls down", "I am sure he has worked on that", "But split specifically had a good ending, I think he developed that well.", "I would agree but its still not his finest work."], ["I just saw The Fog.", "The original or the reboot?", "Original.", "Yes, John Carpenter is great.", "I loved Adrienne Barbeau.", "Yes, but Jamie Lee Curtis was great as well.", "It was a lot better than the reboot.", "What happens in the end?", "The owner of the ship decapitates the priest.", "Nice ending."], ["Have you see Land of the Dead?", "Yeah, I liked it but it was a clear step back from the first 3 movies in the Dead series.", "I know what you mean.  The acting was a little off for one.", "And zombies learning to think another.  At least one of them did.", "I did like how they set up cities across the world.  Shows that we will find a way.", "I also liked when John Leglazarro came after Dennis Hopper's character.", "When he was a zombie.  That was great, revenge at it's best.", "There was also that gross scene that was like a throw back to Dawn of the Dead.", "When the zombies were basically chowing down.", "A pretty good zombie bite when that one still had a spinal cord too."], ["What's your favorite zombie movie?", "Night of the Living Dead, the original one, hands down.", "I knew you'd pick that cheesy movie.", "Cheesy? It kicked off the zombie genre. It's the best.", "Want to know which one is my favorite?", "What?", "28 Weeks Later.", "Oh, come on. There weren't any zombies in that movie.", "Maybe not by definition, but they were still ravenous people eaters weren't they?", "No, they were a bunch of crazy cannibals. They weren't even reanimated."], ["Have you ever seen Scary Movie from 2000?", "Oh yeah, that is the one with Carmen Electra right?", "Yeah, that's the one. She played the character Drew.", "She was a student at B.A. and her friend was killed by Ghostface.", "Two of the Wayans brothers also played in that movie, Marlon and Shawn.", "They are hysterical. If a movie has a Wayans brother in it you know it's going to be good.", "It was directed by Keenan Ivory Wayans. So yet another Wayans brother in the mix.", "Oh, that's right I forgot that he directed it.", "Have you seen any of the other Scary Movies besides the first one?", "Yes, I've seen them all, one through five."], ["Do you like bloody horror movies?", "It depends.", "Have you seen The Hills Have Eyes?", "Isn't that an old mpvie?", "There is an original version from the 1960s but they made a remake.", "Oh yeah, what's it about?", "Inbred cannibals livinh in remote areas.", "Lots of good deaths?", "Yes and there is a sequel that is more military themed and also good.  Different characters.", "I will have to check those out."], ["Who's would you choose, Neve Campbell or Jamie Lee Curtis for all time best scream queen?", "I think I will have to stick with the classic legendary, Jamie Lee Curtis. She was a pioneer and paved the path for Neve Campbell, her performance in the original John Carpenter's Halloween is still one of the all time best.", "Jamie Lee Curtis also gets my vote, although Neve really revived the term scream queen for her performance in the original Scream and the subsequent Screams that followed it.", "Oh don't get me wrong, Neve was superb as Sidney Prescott in the Scream series, I'm just a little biased towards Jamie Lee Curtis.", "Jamie Lee was the definitive scream queen of the 80's. Prom Night, Terror Train, the Halloween Series, The Fog, there's so many and she just has so much charisma on screen playing these types of roles.", "I'm trying to think of some modern scream queens, and the only name that comes to mind for me of late is Mary Elizabeth Winstead for all the movies she's done so far in horror.", "She's definitely my favorite right now! I think she needs to do more because she's so good in horror roles. Final Destination 3, The Thing, 10 Cloverfield Lane, Black Christmas, she just plays the character so well!", "Those are some nostalgic movies. She really shined in Final Destination 3 and The Thing. I thought the Black Christmas remake was a mess and I was probably disappointed Mary Elizabeth Winstead didn't get a bigger role.", "I heard she took the role unwillingly and said she would do it if her character was killed off?", "I think you have her mixed up with Michelle Trachtenberg, who said she would be in the movie only if her character was killed off because she wouldn't return for any sequels."], ["Seen any good Horror movies lately?", "I have seen a few classic ones lately.", "Like which ones?", "The Exorcist.", "Wow, that one is scary right?", "Very, lots of things to make you jump.", "Would you say it is a good one?", "I think it is one of the best. The Priest is in a shape the whole movie.", "Does the demon girl kill any one?", "Oh, you will have to wait and see. Just wait until you see her and her head turn!"], ["Have you ever seen Nosferatu?", "What in the world is that?", "It's a vampire movie.", "Did it just come out?", "Oh, no.  It's actually a silent film.", "How did you come across that?", "I don't remember, but it was pretty creepy.", "How could something that old be creepy?", "I don't know.  I think it's because of what I read about the actor before.", "Wow.  It's starting to sound interesting."], ["Have you seen a good creative horror movie lately?", "Yes, The Babadook. Have you seen that?", "No, what in the world is a Babadook?", "The Babadook is a creature that appears in this fictional children's book the main character's son wants her to read to him. Except it starts appearing in real life.", "Sounds like one of those CGI monster movies.", "No, they actually used a lot of practical effects! The monster and other elements are presented in this beautifully bizarre way, but without a lot of digital effects.", "Oh that sounds interesting. Who is it by?", "A new director named Jennifer Kent. The movie takes place in Australia but I am not sure if she is Australian herself.", "How long is the movie?", "About an hour and a half. It is based on a short film but I never saw that."], ["Krampus was so scary", "I know, it makes you think of christmas differently", "Its wierd how he takes out a whole neighborhood", "Yes, and you dont win", "Nobody survived, thats strange for a horror movie", "I know, usually at least one person survives", "It was weird", "And definitely scary", "I hope they dont come out with another one", "I would probably watch it though"], ["Do you like those horror flicks that are actually silly?", "Do you mean the spoofs?", "Yes.", "Some of them are OK but others are lame.", "I haven't seen many actually.", "I've seen all the Scary Movie ones.", "I saw one. Parts of it were funny.", "We saw the third one together, right?", "Yes, a few months ago when Josie rented it.", "That's right. It made fun of Scream and other ones."], ["Where would you put The Conjuring on your list of best horror films of all time?", "Nowhere near that list.", "Oh geez why do you say that?", "Because there was nothing scary about that movie.", "I beg to differ and so do alot of movies.", "OK well the list is subjective.", "So what is on your list.", "The top film of all time would be The Shining.", "OK I guess I know where this is headed.", "You can say that but many more people will say its number one than say The Conjuring is even good."], ["Hey Linda, you want to go with me to Friday Fright Night down at Jaspers?", "What are they playing?  I hope not Scary Movie again.", "No, looks like their showing The Exorcist.", "Oh.  The new one or the Original.  I haven't seen the new one.", "No, it's the old one with Linda Blair.", "Uh...sure I'll go.  It's been a while since I've seen that.  Who's in the new one?", "I believe that's The Exorcism of Molly Hartley that you're talking about.", "Oh.  I thought it was a remake of the original.  Well I'd still like to see it.  It looks scary.", "Well then you'll probably want to watch the Haunting of Molly Hartley first I think it comes first.", "Ok.  Well lets go get our fill of green soup."], ["Have you seen any horror movies lately?", "Yes, I've seen 'The Mummy'", "Really, I've heard about that movie.", "Yes, it was pretty awesome.", "What did you like about the movie?", "I liked the fact that the plot kept me guessing and on edge the entire movie.", "I can only respect that.", "I was scared the entire time, but it was awesome.", "I bet, scary movies keep me on edge all of the time.", "You should go check it out, it was a good one."], ["What is your favorite horror movie?", "I think I'd have to say Saw.", "Saw is a good movie.", "Yes, its freaky and awesome.", "Its crazy how the guy tries to teach the people to value their lives in such an extreme way.", "I would die if I had to do any of those things in real life.", "I don't know what I would do in those scenerios.", "Good thing its just a movie, right?", "Yeah really. That movie is nightmare fuel.", "I might have had a nightmare or two about scenes from that movie."], ["Are you a fan of older horror movies?", "Absolutely! Have you seen the Hellraiser series?", "Yes, I love how mysterious and demonic it is.", "Me too, its crazy how they rip peoples faces apart with chains and hooks.", "It is so cool how the cenobites are spawned by using a puzzle cube.", "Yeah, it really adds to the mysteriousness of it all.", "I was a huge fan of the first two movies in the series, but after that it just became random.", "They really started just killing anyone instead of killing the person who unlocks the puzzle cube.", "It fell apart from the old Hellraiser story from the comics.", "Yes it did, its a shame how terrible those movies became later on."], ["What do you think is the best horror movie of all time?", "I'd have to say Rosemary's Baby.", "Really, that's an oldie.  Why do you think that is the best horror movie?", "Because it really showed us the horror that lurks behind everyday life, especially in New York City.", "Did you think that the actors that played Guy and Rosemary Woodhouse did a good job?", "Yes, Mia Farrow was the perfect choice for innocent Rosemary and John Cassavetes did a great job playing the creepy husband Guy.", "Do you remember the part where the old neighbor lady gave Rosemary those drinks when she was pregnant?", "Yes, I do and that is why I never accepted food or drink from anyone but my own family when I was expecting!", "Did you know that the movie was filmed at the Dakota where John Lennon used to live?", "Wow, I didn't know that.  But that building really looked creepy and it looked like the perfect place for a bunch of witches to live!"], ["Were you ever a fan of horror films?", "Some yes.  I like The Evil Dead series.", "I do too!  The Army of Darkness film was my favorite.", "That was probably my favorite as well.  I would love to see a modern day sequel where Ash goes back to the world he was in.", "Do you think Army of Darkness is considered a horror film?  I kind of look at it as just an action film.", "I do believe it is a horror film.", "I just don't think it has the same type of suspense that horror films typically have.  Such as a Friday the 13th movie or The Blair Witch Project.", "I think it possesses the familiar subject matter of horror films.  I believe it has some level of suspense coupled with strange, supernatural monsters.", "Would you say that Army of Darkness is the in the same category as The Shining for example?", "Yes, I would admit that The Shining is a different type of horror film than Army of Darkness.  The comedy in the Army of Darkness may be what sets it apart."], ["Hey there.", "Hello.", "Are you interested in horror movies?", "Yeah love horror movies.", "Cool me too.", "What is your favorite one?", "I like the Halloween movies.", "With Micheal Myers.", "Yeah those are the ones.", "Classics."], ["What older horror movie do you still love?", "For me I have to go with 1992 Candyman.", "That is a goodie.", "I feel like even watching now scares me.", "Virginia Madsen performance in this film is super believable.", "I think also the area they shoot the film adds to the freight. That bathroom scene is so scary.", "Ya just the crime of the area alone is frightening.", "Cabrini-Green housing projects is the area it was shot in .. well partly.", "That must have been truly horrifying. Make sense it felt so authentic.", "Apparently they had to make a deal with the gang to make sure they were safe.I think they had many  gang members as extras."], ["Do you like horror movies?", "Sometimes, if they are realistic.", "I have a great one for you, Devil.", "What is that about.", "It is entirely filmed in a stopped elevator.", "Wow that sounds creepy.", "Yes it is so lifelike for most of it.", "Ok I like that.", "Yes it is super intense with great acting.", "Ok thank you for the recommendation."], ["Do you have any horror movies you think are too scary to watch?", "Yes, the exorcist.", "That one really isnt that scary any more. the special effects are almost laughable.", "I just have a thing about possession. There isn't any avoiding it.", "There are lots of horrors you can't avoid, though.", "That's true, but you can fight them off.", "I suppose so.", "There is no fighting off possession. They have control over your body", "So you're afraid of being locked in your body with no control?", "I think that's a valid fear. Having your body taken over by a demon and forced to watch your limbs moving without your sayso. that's scary."], ["What is a good horror movie you have seen recently?", "An American Werewolf in Paris", "Isn't that the one where the guy meets a nurse?", "No, that is An American Werewolf in London.", "What is the Paris one then?", "It's pretty much the same thing, but no nurse and it is in Paris.", "Is it good?", "It is okay. I saw it when I was a kid.", "What happens in it?", "A guy gets bit by a werewolf, at an underground party, and then he becomes a werewolf."], ["What horror movie are you looking forward to seeing in theaters?", "Flatliners.", "Oh right, I totally forgot that was coming out this year.", "I think it comes out in September.", "Isn't Ellen Page in that movie?", "She is one of the main characters. It also stars my favorite Nina Dobrev.", "I read somewhere that Kiefer Sutherland makes an appearance too.", "I didn't know that. The trailer I saw never showed him.", "Ya, I think he is playing the same character he played in the original movie.", "That make me even more excited to see it!"], ["Have you seen the sixth sense?", "Yes", "Bruce willis was so good in that movie", "Yes he did a really good job", "They made that poor little boy seem creepy", "They did, but it was an overall good movie", "Yes i havent seen it in forever", "Me either", "I kind of want to rewatch it now", "Me too"], ["I just saw Bram Stoker's Dracula.", "Cool.  Who directed?", "None other than Francis Ford Coppola.", "Never saw it.  Who stars?", "Gary Oldman, Winona Ryder, Keanu Reeves, and Anthony Hopkins.", "Any good?", "Yes, it was very close to the book.", "Does Winona make it out alive?", "Yes, she kills Dracula in the end!", "Cool!  Yay for Winona!"], ["Have you seen You're Next?", "Nope. What is it?", "It's a modern-day slasher flick.", "What's the plot?", "It's a family reunion, I think about a dying family member dying and splitting inheritance.", "So what happens?", "The one son brings a group of killers to come in and murder everyone, and split the money themselves.", "Ooh nice. How gorey?", "Well, the first death is absolutely amazing and worth the price alone. Plus he looks like someone I know.", "Sounds good!"], ["Which Wishmaster is the best?", "Part 1", "Really? I love part 2", "Part 2 is great but part 1 is the true Wishmaster.", "What about part 3?", "I did not like it.", "Same here. So, why is part 1 better?", "Because it has a cooler story line.", "Yeah, it was pretty terrifying.", "Yes, and the lead actress was great."], ["Hi", "Hey.", "When was the last time you saw a horror movie?", "I watched Annabelle not too long ago.", "Oh haven't heard of that.", "Yeah it wasn't very good.", "Oh that stinks.", "Yeah saw it in theaters almost walked out.", "Man it must have been pretty bad.", "It was."], ["What's your pick for most underrated horror film?", "That's really tough and there's a few I would consider, how about Nightmare On Elm Street 4?", "Not a bad choice at all, one of the stronger sequels.", "Agreed fully it's not up to par with part 3, or New Nightmare, but feel it's the best aside from those two.", "One things for sure, it tramples all over The Dream Child or Freddy's dead.", "Yeah those two were pretty bad, as was part 2.", "Part 2 would actually be among my most disappointing films. They had a such a classic character and they follow up the first film with that?", "Thankfully they recovered and came out with Dream Warriors next.", "Great point, I do love that movie and it was a really nice touch when Nancy came back.", "Yeah but at the end when Freddy killed her? Excruciating to watch."], ["I heard that you like horror movies. Have you seen anything new lately?", "Yeah I do, I recently watched Get Out.", "Oh yeah! I've been wanting to watch it. Is it any good?", "It's very good. Such a new concept for a movie.", "What was your favorite thing about it?", "I really liked the plot. It was very thought-provoking.", "I hear that it has really good ratings. Lots of people have been raving about it.", "For good reasons too, when you get a chance you should check it out.", "Is it out to rent now?", "I think so."], ["Why are there so many Saw movies.", "People love the franchise and a good horror flick.", "I think the movies are terribly acted.", "They have many gaps in terms of how the movie played out.", "I think you could say that this is the end for it.", "People love the idea of it.", "I think that you could say it is one of the better horror franchises.", "The idea about sawing yourself to get out is bizarre.", "That is the conundrum the writers wanted.", "I would rather have a slasher film with a saw."], ["Which was the better Dawn of the Dead the original or the remake?", "The original for plot line and overall creep factor.  But the remake had better special effects and acting.", "I know what you mean.  Some of the acting in the original was pretty suspect.  And the makeup was just plane lazy.", "But it was way scarier.  The fast zombies just aren't as creepy.", "I know, sometimes they are but it doesn't churn your gut the same way.", "The plot device of the helicopter was pretty solid in the original as well.", "But the sequel had that guy on the roof.  Too bad they couldn't save him.", "Yeah, he added comedic relief when it was needed pretty badly.", "Broke up the gore a little bit.", "I also like the happy ending of the original as well."], ["Have you seen The Evil Dead?", "The original one or the rebooted version?", "The original of course. The new one was good but I don't really count it.", "Yes I love Evil Dead but I liked part II better.", "Part II was definitely better with the inanimate objects coming to life and taunting Ash.", "Oh that was hilarious and frightening at the same time. Is that your favorite scene?", "No my favorite scene is when he had to saw off his hand to get the demon out of it.", "Oh that was horrifying! I don't know if I could have brought myself to do that!", "I know I couldn't have. That was very brave of him.", "He put in so much physicality throughout that entire movie. That's why Bruce Campbell is a cult legend to this day."], ["Are you in to classic films?", "I like old horror movies.", "What would you recommend?", "To get starter? I would start with the classics, something like Dracula.", "Is that anything like the new vampire movies?", "Oh, no. It is a scary one, makes you jump and want to scream.", "The Dracula Untold, that is a horror movie too right?", "Yes, but not as scary as the original Dracula.", "I seen the one with Keanu Reeves, Bram Stroker Dracula.", "That one is a good remake of the classic horror one."], ["Whats your favorite horror movie?", "Mine is probably the haunting, what about you?", "I really liked the conjuring", "That on was good", "It was creepy", "I like annabelle better", "That one was good too", "Anything with dolls is automatically super creepy", "I agree with that", "I dont know what it is about dolls"], ["I heard that they're finally making another Jeepers Creepers movie.", "They are? That's news to me.", "It's called Jeepers Creepers;: Cathedral. Filming is already underway.", "I bet it'll be out by Halloween. Who's in it?", "Meg Foster, Stan Shaw, and, I think, Michael Papajohn.", "Johnathan Breck still playing as The Creeper?", "Defiantly. I can't wait to see it.", "Same here. It takes place after the last movie right?", "Actually, no.  From what I read Creepers 3 takes place between the first and second movie.", "That's disappointing. I really wanted to see what happens to the old guy and his son at the end of the third movie."], ["How did you feel about Signs?", "It was so good.", "The scene where hes  trying to beat the alien with the bat.", "And Mel Gibson tells him to swing away?", "Yeah that scene, it made the movie so great.", "I think Gibson did a great job.", "He did but so did the kids in that film.", "It was pretty cool.", "I just wish they didnt show the aliens, the aura of not knowing what they looked like.", "Yeah I know what you mean but it made you fearful even more."], ["Can you recommend a good horror movie to watch?", "A movie I like a lot is called Session 9.", "Is that a new movie or an older movie?", "Well it depends on what you consider new. It was made in 2001.", "Are there a lot of jump scares in the movie?", "No, there aren't many. It's not really that type of movie but it is very creepy.", "Is it a supernatural horror movie?", "Well I don't want to spoil it too much but the movie very much leaves that an open question for interpretation.", "What is something unique about Session 9?", "The majority of the movie takes place during the day. Not all of it but a large chunk of the movie does."], ["Oh. Ok, here's one.  Who's your favorite horror film actor?", "Hmm. Vincent Price.", "Oh, that's a good one.  How bout your favorite Horror Movie?", "The Raven.", "Great old one.  Do you have a favorite Horror director?", "Tim Burton.  Who's yours.", "Well, I've got to go back to Alfred Hitchcock for that.", "Of course. Who can forget The Birds.", "And of course that old classic Psycho.", "That was really scary for it's time."], ["Have you seen The Skeleton Key?", "I don't think I have. What is it about?", "It's about a nurse who goes to care for an eccentric family and it turns out that there are evil forces at work.", "Who plays the nurse?", "Kate Hudson plays her. She does a good job.", "I usually enjoy Kate Hudson.", "Me too. And the setting for the movie is really cool.", "Where does it take place?", "In the swamps of Louisiana. It adds an eerie feel to everything.", "Oh that sounds amazing."], ["What is the scariest movie that you've ever watched?", "The Exorcist.", "Wow. I saw the original one & it was terrifying.", "Extremely terrifying. What about you?", "The Amityville Horror.", "I haven't seen that.", "It have me nightmares the night that I watched it!", "Goodness, it was that scary?", "Well to me it was, but I'm a scary cat.", "So am I, so I would probably have nightmares about it too. I had them after watching Exorcist."], ["I saw the Exorcist when I was young.", "Oh really. It's too scary.", "I was terrified. I shouldn't have seen it.", "The part with her head spinning around is scary.", "It is scary because demons exist.", "Yes, according to the Bible.", "Possessions really happen in real life.", "I've never heard of one.", "It's documented.", "That would scare me."], ["Are you a Vincent Price fan?", "Yes absolutely. He is great in all of his movies.", "Did you see the original House on Haunted Hill?", "Yes, it was great.", "William Castle directed that movie.", "Yeah and he was involved with Rosemary's Baby too.", "That is a great movie.", "Yeah, Rosemary's Baby might be the best horror movie of all time.", "It is definitely up there with The Exorcist and The Shining.", "Yes, horror was great in the 70's."], ["Have you watched the movie Lights Out?", "Is that the one with Teresa Palmer, Maria Bello , and the ghost spirit that appears in the shadows?", "That's the movie. Have you seen it? I thought it was pretty suspenseful.", "Yes I have watched it. I thought it was pretty well done and loved the concept of how the ghost only appears in the dark and shadows.", "I remember the first time it occurred at the beginning of the movie, it was pretty terrifying and I was definitely pretty spooked by it.", "I thought the gimmick wore thin after awhile though although that creeping feeling we got to witness when the main characters didn't was pretty effective.", "I think we all had moments of fear like that as children so they certainly played on those fears. I could really identify with Teresa Palmers fears as well as the children in the movie.", "I liked how they actually had a background story on the ghost haunting them. Her background story was pretty good, about how she was a friend of the mother's and wouldn't let go of the mother played by Maria Bello.", "I really liked that element of the story too, because it gave it some heart. I was shocked at the ending. You know with Maria Bello's character and all.", "I kind of expected it to end the way it did which was a slight let down for me, but overall I was pretty entertained and enjoyed it a lot."], ["Is there any movie you saw with your parents but instantly regretted?", "Yeah, Titanic for me.", "Why's that?", "Well, it was my first topless scene and I was 13. My dad said I was very annoying on the way home.", "Ha, nice job.", "Thanks. You?", "American Pie. The apple pie scene was pretty bad.", "The webcam scene is far worse.", "True. But at least he put a note on the apple pie at home.", "Ha, I'd love to see that."], ["Do you feel the sixth sense is a horror movie?", "Wow thats a great question.", "I mean it has all the elements.", "Right but it was more of a psychological thriller.", "I would say it was a horror movie.", "Because of the way you learn about Bruce Willis' character?", "Yeah thats the worst kind of horror.", "Knowing what you dont?", "Yeah thinking youre alive the entire time.", "I hope no one is listening! You just spoiled it!"], ["I saw Let the Right One In.", "Isn't that a foreign flick?", "Yes, Swedish.", "Who directed?", "Tomas Alfredson.", "What's it about?", "A 12 year old boy strikes up a friendship with a vampire.", "Cool.  What happens in the end?", "She kills the kids in school who are bullying him, and they run off.", "Sounds like something Hollywood would not do."], ["You've seen The Grudge right?", "Yes, but felt it was mostly okay at best.", "I would agree with your assessment, but you did know it was originally a Japanese movie right?", "I had heard about this, yes but never felt the need to look further into it.", "You really should, Ju-on is much better than it's American remake.", "I know that was the case with The Ring.", "The acting alone tends to set the Asian versions apart, still not sure why they felt Sarah Michelle Gellar was a good choice.", "Yeah she's far from the first actress I think of when thinking scream queens.", "Jamie Lee Curtis she is not!", "Oh absolutely, there's no comparison there. Anyway I'll watch The original version of The Grudge and let you know what I think."], ["Have you seen the Omen", "One of my favorite movies.", "That kid was just plane creepy.  He was fantastic the whole time.", "And all the foreshadowing such as that dog that would make people kill themselves.", "And when he went nuts before going in the church.", "One of the scariest endings I've ever seen.", "What when he's about to kill the kid or when the kid turns around.", "What the kid turns around.", "I know what you mean, it's like we're done for.", "Horror at its best."], ["What's your top horror movie of all time?", "That's easy, it's The Shining.", "Is it a violent movie?", "There is some violence but it's fairly minor. It's much more of an atmospheric psychological type of horror.", "That's interesting. Who made the movie?", "Stanley Kubrick was the director and the movie is very much in his style. Matter of fact, The Shining probably is the best example to show someone interested in his style of film-making.", "That's great. Where does the movie take?", "Most of the movie takes place inside a large hotel, The Overlook hotel in Colorado.", "I heard that The Shining is based on a book. Is that true?", "Yes, it's based on a novel by Stephen King. However, the film is very different from the book."], ["What's your favorite horror movie? Like, absolute favorite.", "Absolute favorite? John Carpenter's The Thing.", "I love The Thing! I'm a big Exorcist fan myself.", "Ooh, that one's good too. I like how a lot of the real tension in the story is about the human characters.", "Yeah, the same is true in the The Thing, really.", "And they both have amazing practical effects! Though I think The Thing wins there, for obvious reasons.", "Yeah, even the part where Regan comes doesn the stairs with her body all messed up does not compare to even the scene with the dog from The Thing.", "Oof, that scene with Regan gives me the creeps. I couldn't walk down the stairs at night after seeing that.", "For me, it's when her head turns around. The sound effect they used for that scares me so much.", "That sound effect is actually made by them folding a leather wallet with stuff inside, I looked it up! Isn't that cool?"], ["Have you ever seen the Exorcist?", "Yes, that movie gave me nightmares.", "One of the scariest and most shocking movies ever made.", "Yeah, that poor little girl being made to do and say those awful things.", "And the misty breath when it was freezing during the exorcism.", "Definitely one of the greatest horror movies ever made.", "It was easily in the top 3.  Not fancy with the special effects either.", "Nope, just creepy voices.  It's a wonderful day for an exorcism.", "I know that part gives me chills.", "Also the soup puke was pretty gross."], ["Have you watched any good horror movies recently?", "Yes, I watched Annabelle.", "Thats the movie about the doll, right?", "Yes, the one that they also show in the Conjuring.", "How was it?", "Really good.", "Was it really scary.", "Yeah, they did a great job.", "What year is that from?", "It came out in 2014."], ["Do you think Rosemary's Baby is scary?", "I do think it's scary.  It's so creepy.", "I like how they don't show a lot of things. It's mostly atmosphere.", "Yeah, that unknown part is the most scary thing.", "Mia Farrow was well cast in it.", "She looks innocent so that is a good contrast with the evilness.", "I don't like to watch that movie at night.", "I understand that.  I always get uneasy.", "The score is very eerie.", "It definitely adds to the feeling of being unsettled by something."], ["Do you think Jurassic Park was a horror film?", "Hmmm, maybe. Maybe it was more of a thriller movie.", "Nah, I think it is a horror movie", "How so?", "Has all the elements, monsters, scary moments, violence", "Yeah, I guess you're right", "Plus there are some jump out of your seat moments", "Right, with the raptors in the kitchen", "And the t-rex picking up the cars in the rain.", "Oh right...classic scene."], ["I just saw The Exorcist in film class.", "Wow, how old is that?", "1973.", "Who was in it?", "Ellen Burstyn, Linda Blair, Jason Miller, and Max von Sydow.", "Cool.  Was it just as sppoky?", "Yes, it really was.", "Who directed it?", "William Friedkin.", "Right. One of the classic horror movies of all time."], ["Do you prefer to watch horror movies at home or the theater?", "I like to watch them at home.", "Same I don't want to embarrass myself in front of other people.", "At home I can scream as much as I like.", "Do you like horror movies that have comedy?", "Yes because it lightens the mood.", "That's why I liked the movie \"Get Out\" so much it was funny and scary.", "I also like strictly horror movies like \"It Follows\".", "I like the genre has a whole.", "Yes I enjoy the horror genre as well."], ["Lets talk about horror movies", "Okay i dont know too much about horror movies?", "Dont like them?", "Sometimes, i have to be in the right mood", "I understanf that", "I liked annabelle though", "That one was good", "It was creepy", "I enjoyed it", "Me too"], ["Did you ever see Cabin in the Woods?", "Yes it was amazing! I love the twist at the end.", "Me too I loved how they poked fun of the horror genre while still creating something scary and fun.", "I thought it was a typical horror movie then they came out of left field with the whole sacrifice plot.", "Yes it was a shocker. The scene where all the monsters were let loose and caused carnage, that was epic.", "I thought it was funny that they hit on the character types that seem to be formulaic in all the movies.", "Right they had the virgin, the not-so-virgin, the jock, the smart guy, and the stoner.", "Right you see them in every scary movie.", "I loved how they basically ended the world because one of them didn't want to be sacrificed. That was so selfish.", "It really was, but it's a movie after all. Can't expect everyone to have high morals."], ["Do you like any of the Stephen King horror movies?", "Yeah they're good. I like Thinner, IT, Christine and Pet Cemetary 2.", "Pet Cemetary 2 was crazy scary. Have you seen the first one?", "Surprisngly, no. How is it?", "It's really good. Have you seen Cujo?", "I wasn't crazy about it. The Saint Bernard didn't scare me.", "Really? The dog was terrifying to me.", "IT is my favorite Stephen King film. The sewer scenes were so scary.", "I hate when he sucked the bully into the tube with the dead lights. So creepy.", "Yes, he was all limp and bug eyed."], ["My friend I saw this horror movie called The house of wax and it was a great exciting horror flick too.", "Oh yeah when did you see the movie and what was the movie about? Was it really scary?", "Well yes of course you know i only go check out the scariest ones. It was staring Jared P. Elisha C.and a few other famous actors I like.", "In the beginning of the movie a car load of friends get a flat tire and they end up in a ghost town they are forced to stop at a wax museum and this turns out to be almost as worse as A night mare on Elm street.", "Cool I like horror movies tell me more about the movie this one sounds really good.", "It was great so okay they begin making tents to spend the night and slowly one by one was going inside the house of wax seeing weird things and disappearing.", "Wow why were they disappearing? and who was causing them to disappear and how were they missing I ?think I know but go on continue.", "Well they were getting murdered one by one and i was so upset to see the actress Paris H.go when one of them caught and slashed her. each body they would hide and then turn them into wax.", "I have got to check this out this horror movie so don't tell me to much about the ending I want to see it for my self.", "Okay but i want to give you a small hint that is shocking the twins at the end turn out to be triplets. I hope you will enjoy the movie because I sure did."], ["Have you see Day of the Dead?", "Yeah, it was good.  Not as good as the first two movies though.", "But it had it's fair points.", "This one was more about people keeping going in the zombie world.", "And learning how to use them.  Who could forget Bub.", "Who shoot that guy at the end and salutes him.", "Maybe the only time I liked a zombie.", "Also a set up for the next movie.", "I know, but it took forever for it to come out.", "I know, and Land of the Dead wasn't as good.  But it served."], ["So, another horror film I've been meaning to see is The Witch.", "Oh, yeah, I've seen that one!", "Really?  Did you like it?", "I thought it was great!  Lots of good performances, really suspenseful.  Now, I gotta warn ya though...", "What's that?", "Well, it's rather slow paced, and that bothered a lot of people.  It's more a psychological drama in many ways than a horror film.", "Oh, well, I can still do that.  As long as the story's interesting.", "Oh, it is.  It's set in the colonial times with this exiled Calvinist family.", "Yeah, I gathered from the trailer is was during the time of the pilgrims.", "Yeah, the director has been praised for really doing his research."], ["What is the Sixth Sense about?", "The Sixth Sense is a great movie. It's a horror movie.", "Yes, I know this, but what happens in it?", "Bruce Willis is psychologist who tries to help out a boy.", "What is wrong with the boy?", "He sees dead people.", "That is very scary! Is this good to watch with families?", "I wouldn't recommend it, since it may scare your children.", "Awesome. Anything else I should know about this?", "There is a very famous plot twist at the end."], ["Do you like horror movies?", "Yeah I do", "What is your favorite one?", "I dont really have a favorite", "I loved Texas Chainsaw Massacre", "That was awesome but not the updated ones", "Yeah I think the Jessica Biel version wasnt that bad", "It wasnt bad it was terrible", "Now now, those actors did a great job", "Yeah of making sure no  one would remember it."], ["Do you remember the Scream movies?", "I think so. They're from the 90s, right?", "Yes, they were so popular back then.", "I want to watch them again just to see the 1990s fashion.", "I'm always impressed that Kevin Williamson wrote it.", "He's most famous for Dawson's Creek, right?", "Yes. I guess they deal with a similar target audience though.", "He definitely knows how to write for a teenage audience.", "I like how Scream is funny, too.", "Exactly. It's a fun horror movie."], ["Have you seen The Conjuring?", "That is one of the best modern horror movies I've seen.", "You're right. Really tastefully done, well made, and actually scary in parts.", "Did you know Ed and Lorraine Warren were actual paranormal hunters?", "Yes I did know that. They were involved in the case with Annabelle also.", "I saw that movie, it creeped me out. I heard they still have that doll housed with the cursed objects.", "Me too and I heard the Warrens visited the house in Amityville Horror when the family was living there.", "I saw that documentary with the son, who actually lived there. She was speaking about the experience.", "Yes and she said she carried a piece of the True Cross into that house with her.", "Right. The Conjuring did their story justice. Not as many people would have known about their bravery if not for that movie."], ["Did you see the Trailer for Black Panther?", "Yup.", "Aren't you excited?", "Meh.", "Meh, why?", "Well, no offense, but I can't relate to a superhero from Africa.", "I understand, but that does sound bad.", "I'm sure I'll like it, but it's like Spider-Man. I just don't care about the character.", "You will, The actor and story are great.", "We'll see."], ["Guess what I'm watching? Yes, Friday the 13th: The Final Chapter.", "Wasn't the last chapter was it? It kept going past that.", "it's still good for a slasher film. And Corey Feldman is in it.", "Oh he was great in that movie. He should of made the next film that used Tommy.", "Jason kills so many innocent victims. Why is he so unreasonable?", "When you're left to drown by irresponsible teens, things go haywire. Do you blame him?", "Tommy's sister is the best survivor. She screams her head off.", "She's beautiful and pretty smart for a blonde. I don't think I saw her again.", "I don't like when we don't witness how they die. We don't get to see how Jason gets that bike riding twin.", "It was most likely a boring kill. We see the most creative damage done."], ["Hey, do you ever watch horror flicks?", "Yeah, I watch them here and there. They aren't really my favorite genre.", "Mine either, but I do enjoy a good fright once in awhile.", "I like to watch the more tamer ones like Hocus Pocus.", "Oh yeah, I've seen that one. I really liked it.", "Better Midler was awesome in that.", "I also like Jurassic Park. That is also considered a tame horror flick.", "That is for sure a classic.", "Ghostbusters is also considered a tamer type of horror movie.", "Bill Murray was brilliant in that."], ["I've been searching the internet for the name of a horror movie I saw when I was, like, 5 or 6. But I can't find it anywhere.", "I don't think I was allowed to watch horror flicks at that age.", "It was the first horror movie I ever saw, so I think it stayed with me a little.", "Everything but the title.", "I believe it aired on TV one night around the late 80s or early 90s.", "Ah, I thought it was in the movie theater. Could have been one of those made for televisions movies.", "Could have been. It was about a married couple that moved new house or were on vacation, or something. And these strange people lived around them.", "How strange?", "One was a fat middle-aged lady with dark hair tied in a bun. She looked very pale and I think she was a witch. The other guy looked like a Bee Gee who kept threatening the wife.", "I'm drawing a blank. But it sounds a lot like that recent Liv Tyler movie, The Strangers."], ["Have you seen flatliners?", "The film with julia roberts ?", "Yes, that is the one.", "Ya a long time ago now. I think  it was pretty scary to me when I was younger.", "Do you know they are remaking flatliners?", "No, I really hadn't thought of this film in forever.", "Ya I think the remake looks like it could be better than the original.", "Really? The original creeped me out.", "Well the new trailer is out and it looks even creepier to me.", "I will have to check it out."], ["If you like period vampire movies, I think you'd like Interview With a Vampire.", "Oh, really?  Who's in that one?", "Brad Pitt and Tom Cruise are the stars.", "That must be pretty mainstream to have them in it.", "It is mainstream, but it's still well-made.  A European directed it.", "Oh, who directed it?", "Neil Jordan directed it.  He does a good job making you feel like you're in that time period.", "Isn't Antonio Banderas in it?", "Yeah, he is in it.  He makes an impression in it.", "I like period movies and vampires a lot so it'd probably be right up my alley."], ["Have you seen any good horror movies lately?", "No, not lately.  But I've been meaning to see the new Alien movie.", "Oh yeah, I'm a little worried that they're going to mess up the franchise.", "I think they're going to do a good job.  But I'm just holding out until It comes out later this year.", "Oh yeah, It is going to be terrifying.  Do you think Skaarsgard is going to do a good job?", "Well, it will be hard to compete with Tim Curry, the original It.  But from the trailers, it looks really scary.", "It definitely does. I'm glad they're remaking it.  I think it needed an update.", "Well, the original was awesome.  But I'm curious to see if they might be more true to the book in this movie.", "Yeah, in the book It was rarely a clown, he usually took the form of some horrible creature.  So I really hope they work with that.", "Me too."], ["Scream, what are you thoughts?", "I liked it. It helped bring back good horror movies.", "Yeah, it was a little unpredictable", "Yes, like the scene where Drew Barrymore gets it at the beginning", "Yes, I wasn't expecting that to happen so early on", "Right, she was supposed to be a main character", "That was a Wes Craven movie, no?", "Yes, Wes Craven of Nightmare on Elm Street fame", "Oh yes, classic 80s flick.", "Yes, big on the 80s slasher genre"], ["Have you seen a scary movie called The Others?", "Yes with Nicole Kidman? That was a great movie.", "I loved it. Never saw the twist at the end coming.", "They did a good job of hiding it. I can understand her reasons though.", "Nicole Kidman's characters reasons for what she did?", "Well not for murdering the children but for everything she did as a ghost when she thought they were alive.", "Oh right. She thought they had a serious photosensitivity to light and she tried to protect him.", "Right. It was sad because you could see she loved them, she just went insane.", "I can't believe people used to take pictures of their dead sitting up and posed.", "That was probably one of the creepiest parts of the movie, those photos of the dead."], ["Are you into horror movies?", "I always liked the Amittyville movies.", "Oh, that stuff was creepy.", "Do you know that it was based on a true story?", "Based is a tricky word though.  I mean, how much really happened.", "I guess.  It still was scary though.", "Oh, I'm not debating that.", "It was really scary for its time.", "What do you think about the remake?", "It wasn't as bad as I was dreading."], ["So, I caught The Void the other night and I'm still trying to figure out what was going on with it?", "Is that the new horror film with Ellen Wong, Kathleen Munroe, and Aaron Poole?", "That's the one, it started out really creepy. Really mysterious and unsettling, then it gets really weird!", "What do you mean? Was it a ghost story or more of an invasion horror movie?", "It was more Love Craft if you're familiar with that genre. It's kind of similar to Clive Barker's Hellraiser.", "Oh I loved that series! Tell me a little more about The Void.", "It's a simple premise really, a group is trapped in a hospital in a small town. Outside there is a group of hooded members circling the hospital. They try to figure out how to escape but inside the hospital something even more sinister is happening.", "That sounds pretty scary. Were there a lot of jump scares, because I can't do jump scares a minute type of horror films anymore.", "There really wasn't a lot of jump scares but there was a lot of unsettling imagery. The practical makeup effects in this film are top notch, a real throwback to the 80's.", "I'll have to give this movie a watch. I'm really intrigued by the practical special effects and makeup work. It's been awhile since we've had that, mostly it's been heavy CGI."], ["Have you seen It follows?", "Yes , I enjoyed it a lot. Really liked the beach and pool scenes.", "Very creepy scenes. I was watching the new face off tv show, have you seen it?", "Ya I like that show why?", "Well the oldest contestant was actually a make up artist on this film, thought that was pretty neat.", "That is cool, makes me want to route for him now that I know.", "Ya I like to support indie films like It follows. Know any of any other good indie horrors?", "I don't know if the witch is indie or not, but it was so well done.", "It was amazing, one of the scariest concepts to me. The last scene images stayed with me a while. creepy to say the least.", "I had read the stephen king loved this film and felt it was truly horrifying as well."], ["I just saw Dawn of the Dead.", "Which version?", "The 1978 version.", "Was it directed by the same guy who did Night of the Living Dead?", "Yes, George Romero, with Ken Foree and Gaylen Ross as lead actors.", "What happens in the movie?", "The group gets stranded in a shopping mall.", "What happens in the end?", "Two people escape in a helicopter.", "I'm surprised anybody makes it."], ["What’s your favorite scary movie of late?", "That’s a hard question to answer, so many to choose from. I would say IT Follows.", "That’s a good one, very scary!", "Yes, it was filmed really well also, some of scenery is very realistic of small town.", "Yes and the story is kind of unique also, I don’t think anything has been done quite like that.", "Agreed, it was different. Have you seen Get Out?", "No I have not, but I have heard good things about it.", "I think I if you like horror and mysteries, it’s a good mixture of the two.", "That’s what I hear, it looked really good in the trailer that I saw.", "Trust me, you would not be disappointed."], ["What types of horror movies are your favorite?", "I love the classics.", "What do you consider classics?", "You know the ones with Jason, Freddy and Michael Myers.", "Oh yeah, those are cool. Who is your favorite killer?", "I'd have to say Michael Myers, he was always so cool about it.", "Yeah,  He had a silence that was creepy yet intriguing.   Who is your favorite?", "I liked Freddy, mainly cause he was funny at the same time and deadly.", "I see that,  He did crack a few jokes.", "But of course Jason was always smooth for his kills, and no matter how fast they ran he caught up to them with his slow walk."], ["When I was a kid, A Nightmare on Elm Street scared me to death!", "It scared me, too.  I saw it for the first time when I was eight years old.", "Oh, no wonder it scared you.  That's young.", "I had a nightmare about my face being burned like his.", "That sounds scary.  His makeup job in the movie looked real.", "I didn't like all the sequels as much as the original.", "Yeah, it was hard to top that first one.", "That girl in the movie was a pretty good actress.  What is her name?", "Her name is Heather Langenkamp.  Yeah, I always liked her screen presence.", "I still watch that movie every October around Halloween."], ["Which Michael Myers Halloween movie is your favorite?", "I like Halloween part 1", "That is a classic. Do you like part 2 as well?", "It's pretty good. I like it, but not as much as part 1.", "Do you like part 3?", "Michael Myers is not in that one.", "Really? That is strange.", "I know. But, part 4 and 5 are good.", "Is there a sixth one?", "Yes and Donald Pleasence is in it."], ["What is a really scary movie we could watch?", "I really liked Paranormal Activity. It was so creepy.", "That's the one about the demon that follows the couple.", "Yes. I think those types of movies are so much scarier than bad guy movies.", "Why?", "Well, a bad guy you can get rid of. An evil ghost though, well, that's a lot harder.", "What about Mike Myers? He kept coming back.", "True.", "I think I'd just rather not be hunted by anything, ghost or human.", "I totally agree!"], ["Have you seen \"Ouija: Origin of Evil\"? I watched it last night.", "Sure have. Before I say anything, what did you think?", "Honestly, I thought it was really so-so. I kept waiting for something to happen, it does in a 15 minute span, and then oh look, everyone is dead.", "Yes, thank you! Everyone I know loved it.", "I was really surprised, so many people recommended it to me!", "Me too! It felt like the spooky moments really dominated the plot rather than the other way around.", "And I really wasn't buying the plot line. A lot of innocent people died in this house in a terrible way, so their ghosts decided to kill a family?", "Right, it seemed like an afterthought. It was like they wrote the movie and went, \"oh man, so why are the ghosts doing this again?\"", "Also, I think they were trying to take borrow that religious turmoil vibe from \"The Exorcist\" with their own priest questioning his faith.", "I think in the movie business they call that an homage so they can skirt being accused of unoriginality."], ["Are you going to see It when it comes out?", "I really want to.", "Did you see the original one?", "I have it on DVD and VHS.", "Oh, so you are a fan.", "I've read the book as well.", "What do you think will be different from the first one?", "I think they'll include more what's behind the monster.", "What do you mean?", "Pennywise wasn't the monster, he was the manifestation.  I want to hear the background of the monster, which is more terrifying."], ["What is your favorite type of horror film?", "I really enjoy psychological thrillers, what about you?", "I like suspenseful horror films.", "I really dont enjoy those, they make my anxiety pretty bad. Does that affect you ?", "Not really, I find that when I watch movies I like to shut my brain off and fully immerse myself.", "That makes sense, I wish I could do that!", "I'm sure you can, it just takes practice. A small glass of wine doesnt hurt either. Whats your favorite psycho thriller?", "I think silence of the lambs. It's interesting and slightly difficult to follow but worth it.", "I've heard everyone say great things but i've actually never watched!", "Wow! You must, it's a classic."], ["I saw this great movie last night called, The Babadook.", "Never heard of that.", "You should look it up. It is Australian and not your usual horror movie.", "What do you mean?", "Well it is more psychological than the usual slasher type horror movies. It has a good story line about a mother and her son.", "I like psychological horror too more than just blood and guts. I like to get really scared and the usual stuff just grosses me out.", "Well you'll like this then. The son thinks the monster in a pop-up book is real and he makes weapons to defend himself and his mother.", "So the kid is the hero", "Kind of. The movie is more about the dark side of grief. You see the mother Amelia, her husband is killed in a car accident the night Sam is born and she never quite got over it.", "Ok, I'm going to take your advice and look for it. We can talk more about it after I watch it."], ["Do you consider the Blair Witch Project a horror movie?", "Its layered so not really.", "What do you mean by that?", "I would almost call it a paranormal movie.", "Arent those almost always horror anyway?", "No, I think its lacking certain elements to make it horror.", "Sometimes playing on your brain is the biggest horror of them all.", "No not true.", "Yeah this movie centered on what could be going on.", "I dont know I think we agree to disagree."], ["Have you seen Jennifers body?", "A while ago", "Same here i was thinking about rewatching it.", "I dont remember too much of it", "I think i liked it", "Its hard with horror movies these days they are either scary or stupid", "Like that mirrors movie it had good potential, but it was awful", "Yea i wasnt a big fan of that myself", "The ring was kind of stupid too", "I agree"], ["A friend of mine wants me to find a really horror movie that's in black and white. Something from the old days.", "Has she heard of Dead of Night?", "I don't think so. What's that about?", "Some guy meets a group of people in a spooky old house where they share nightmares and crazy stories.", "Doesn't sound all that scary.", "You have to see it for yourself. There's even a crazy ventriloquist and his even crazier dummy.", "Okay, ventriloquists and those dummies are always scary to me. I'll look it up. What year was this movie made?", "1945.", "Any good actors in it?", "Ralph Michael is in it and it was written by H. G. Wells."], ["Have you ever seen the Blair Witch Project?", "Yes!  I watched it when I was a teen and then sometimes I rewatch it for Halloween.", "I remember at the time how amazing people though it was.", "Yeah, looking back it doesn't really stand the test of time.", "You can tell it's not real and the story is so unbelievable.", "Yea, but at the time it was uncharted territory.", "Yep, probably one of the first \"reality\" based horror movies.", "They made it look like it actually happened, then kept the actors names pretty quiet for awhile there.", "It's really crazy to think about movies before the internet really took off.", "I can't imagine movies before IMDB."], ["Ok, so horror flicks.  What's your favorite?", "Got to be Nightmare on Elm Street. All of them.", "Yeah, I really liked the first one.  Thought Freddy Kruger was real creepy.", "What is your favorite?", "Oh, I'm more of a horror of the mind kind of guy.  Like Hannibal and the Wolfman.", "Anthony Hopkins kind of stuff.", "Yeah, horror but makes you think too.  Another one is The Rite.", "Seen that.  It's pretty intense. Keeps you on the edge of your seat.", "That's the kind I like.  Where you are biting your nails but still trying to figure just what's going on.", "Yeah, but still nothing like a big old clawed hand coming at you."], ["What is your favorite horror movie of all time?", "Thats a hard question. Whats yours?", "I'd have to say, The Shining .", "You mean the original with Jack Nicholson?", "Definitely. He's the only one who could play Jack.", "I know the remake was good, but not the same.", "Even the way the kid said Redrum was creepy.", "I agree.", "So you never told me your favorite.", "Well I'd have to think, but that one is way up there."], ["Had you ever seen the Shining?", "I'm not sure.  What is it about?", "A writer and his family stays in a mountain resort alone and it's haunted.", "Oh, is that the one by Stephen King?", "Yeah, it was based on his novel.", "Who was in it again?", "Jack Nickelson.", "I've never seen it, but I know the \"Here's Johnny!\" part.", "Oh, everyone knows that.", "I might need to eventually watch it."], ["have you seen Chuckie?", "the doll movie?", "yes, a doll is possessed and becomes evil.", "i saw it a long time ago.", "it is from the eighties.", "i remember it was scary", "i am still afraid of it", "really? it is creepy.", "that laugh is horrifying.", "its only a doll though"], ["Who is the most scary Annabelle or Chucky?", "Chucky! He actually runs towards you and says things.", "What is the name of the horror movie where the man goes insane and breaks down the door?", "I think you mean the Shinning with Jack Nicholson.", "I finally saw The Others. What a twist at the end!", "I told ya it would blow you away.", "You need to see that Spanish zombie movie called REC. It's good.", "Really? I'll try and see it over the weekend.", "Best Saw movie?", "Is that a trick question? The original is still the best."], ["Have you seen 1408?", "Yes that movie was so wierd", "It was really creepy too", "Yes it was, have you seen the alternate ending?", "Yes where it was all made up or something", "Yes, it was really intense", "Im suprised it was that good for just taking place in one room", "Me too", "It has a good plot though", "Yes it does"], ["Hi.", "Hi.", "Have you seen any horror movies lately?", "Yeah.", "What did you see?", "I watched Get Out.", "Oh cool.", "Have you seen it?", "No haven't seen it yet.", "You should it's great."], ["I just saw Ringu.", "Was that the Japanese original of The Ring?", "Yes, it was.", "Who directed it?", "Hideo Nakata", "Who is the female lead?", "Nanako Matsushima", "Does it end the same way?", "Yes, they make copies in both versions.", "Chilling."], ["What's a really good, scary horror movie that you've seen?", "\"Hostel\" was such a scary movie for me.", "I haven't seen it.  What's it about?", "Basically, some young adults that are traveling are used as subjects of torture and death by wealthy people that pay to use them in that way.", "Is it gory?", "Very gory.  Lots of blood and disturbing images.", "Why does it bother you?", "Because it makes you nervous about traveling in places where you are not familiar with the area or the dark secrets that might be there.", "What would be the youngest that you think someone should be to see it?", "Well, it could be disturbing for anyone, but I think at least 16 and probably closer to 18.  Definitely not young kids or pre-teens."], ["I'm on the fence about horror movies.", "What don't you like about them?", "I feel that they give me nightmares. I don't like being scared like that.", "What particularly gives you scared feelings?", "Well, take Hitchcock's Psycho. That creepy guy.", "Oh, you mean the guy who has a strange relationship with his mother?", "Yeah, the guy who acts her out. That's just disturbing.", "Well, it is, but it's also fascinating to those who like horror.", "I do like the cinematics of Sleepy Hollow, though.", "Yeah, that's a good one."], ["Hi have you seen the movie Get out?", "Yes it was great! It took horror movies to a new level.", "I know and the twist at the end was great!", "Have you seen any other horror movies in 2017?", "I seen rings and it was ok. It really explained why the girl is the way she is.", "Really? I think that series is overdone.", "Yes but not as bad as Saw, did you hear there is going to be a Saw 8?", "How ? Jigsaw is dead?", "I am not sure but the plot said the killings will point back to him.", "I may wait for the DVD because most people know the horror sequels are not great."], ["Do you remember the Evil Dead series?", "Those campy B rated horror movies, yes, they were fantastic.", "Yeah, and then the army of Darkness sequal.", "Bruce Campbell was the best, with his chainsaw hand.", "\"This is my boomstick\" is one of his best lines.", "As goofy as they were, they scared me a lot.", "Well, thats what made the goofyness of them so much fun, cause you'd go from laughting to screaming.", "I used to watch them under a blanket.", "Me too, I feel like renting Army of Darkness now and watching it.  Wanna join me?", "Yeah, I could use a good scare."], ["Were you ever into the Halloween movies?", "Yes but I only like part 1. They get kind of repetitive and silly after that.", "I agree with you. Jamie Lee Curtis did a fantastic job as the Scream Queen in all her horror roles?", "Which one was it where she was finally killed by Michael Myers?", "I believe that was in Halloween: Resurrection.", "Right, the one with Busta Rhymes and Tyra Banks. Even though it was silly I kind of liked it.", "I liked it too. I also liked Halloween:H20 when she was the dean of the school and Josh Hartnett was her son.", "That was well done too. I loved the part where she sent her son and girlfriend off and battled Michael by herself.", "That scene really showed that she'd had enough.", "It was just a shame that she was killed off in the next one. I would have loved to see her survive the series."], ["Do you watch horror movies", "Only in daytime and if im not going to be home alone", "Get scared easily?", "Yes i do", "I cant sleep well if im home alone", "I understand, i dont have that priblem though", "That must be nice", "It is", "Do you have a favorite", "The conjuring"], ["So, do you think of a lot of the modern horror films coming out?", "I don't know, I don't really care for too many of them.", "Why not?", "Seems like most of them these days are just pointless jump scares.  to me, jump scares are NOT horror, it's just a cheap trick anyone can do.", "Ahhh... like Paranormal Activity.", "Yeah, exactly... and what tare they up to on those now, like fifty or something?", "Well, what I don't are all these remakes of GOOD horror films.", "Oh, tell me about.. like The Thing?  What the hell?  All that crappy CGI.", "Actually, I think that was supposed to be a prequel to the original.", "Well, either way, it sucked."], ["hey, have you seen the friday the 13th remake they did a few years ago?", "unfortunately i have.", "come on, it wasn't that bad.  it had it's flaws, but i thought it was ok.", "it just seemed a bit campy.", "Isn't that what the friday movies always were?", "to some extent, but this one was over the top.  like the guy having sex with the girl and says \"you have perfect nipple placement.\"", "yeah, that was a bit odd.  seemed like they might have tried to put too much in one movie as well.  kind of skimped over jason's mother", "yeah, that was the cool thing about the first movie a lot of people don't remember.  Jason's mother was the killer, not jason.", "I would have like to see more of her and more of the back story of jason as a child.", "yeah, someone should do a movie on her back when jason was still alive and a child."], ["Hi.", "Hey.", "What is your favorite horror movie of all time.", "Hmm let me think.", "Sure.", "I really liked It.", "The new one?", "Yeah.", "I haven't seen it yet.", "you should."], ["Hey, did you see that new Alien movie yet?", "Covenant? Not yet", "Dude, I went on opening night", "How was it?", "It was really, really bloody", "Was it better than Prometheus?", "It was way better than Prometheus. I thought it actually made Prometheus a better movie?", "In what way?", "It really connected the dots from Prometheus", "Wow. Sounds great!"], ["I just saw Paranormal Activity.", "The first one?", "Yes, 2007.", "Who directed?", "Oren Peli.", "Who were the stars?", "Katie Featherston and Micah Sloat", "I forget, what happens in the end?", "The original ending has the wife killing the husband and disappearing.", "Nice."], ["What was your favorite horror movie?", "Boy, I don't know. Maybe Nightmare on ELm Street.", "Really, that is old.", "Yes, but it's a classic horror.", "That is true. Even the makeup and effects were pretty good.", "Good concept. A killer in your sleep.", "True. They shouldn't have made so many though.", "You're right. They should have stopped at like three.", "They got a little boring after so many.", "Did you like Freddie Vs. Jason? That was a good movie."], ["Do you remember the Blair Witch Project?", "Yeah, I saw that in the theatre.", "Did you like it?", "I wouldn't have categorized it as horror.", "Really, you weren't scared?", "The whole theatre was laughing.  We were nauseated by the camera.", "It didn't look real?", "The day before it came out, the \"missing\" crew came out to give interviews.", "Oh, that ruined it.", "Yeah, I think it would've been scarier if we thought it was real."], ["What is the best horror movie of all time?", "Oh that's a hard one, Nightmare on Elm street?", "Hm, I think maybe its Texas Chainsaw Massacre?", "Those are both classics.", "And both completely terrifying.", "You're right.", "Freddy Kreuger gave me nightmares as a kid.", "Me too!", "He's so scary.", "He wins for sure."], ["Do you remember the orginal Salem's Lot movie?", "No, when was it from?", "1979, it was a Stephen King novel they turned into a movie.", "What's it about?", "Its about an evil house that gets rented by two antique dealers who bring a vampire to the town.", "I love vampire movies, I wonder why I don't know about it.", "Probably because its from the 70's.  But you should see it, its terrifying.", "Is it gorey?", "Not really, just really creepy and suspence full.", "I'm gonna see if they have it on amazon or appletv, I wanna see it now."], ["What is your favorite Lovecraftian horror movie?", "That's a tough question to answer, I have so many as that's my favorite sub genre of horror. I think I would have to say Hellraiser and for a guilty pleasure The Midnight Meat Tran.", "The Midnight Meat Train is the one with Bradley Cooper and Vinnie Jones right? Vinnie plays the butcher on the subway train that brutally murders passengers?", "That's the one. That movie also stars Leslie Bibb and is based off a short from Clive Barker.", "I didn't know Clive Barker did a short on it. I remember enjoying the movie as it was very brutal and so bizarre.", "That's why it's one of my favorites. You start off thinking Bradley is just trying to get a good shot, as his character was a struggling photographer, then he becomes obsessed with Vinnie Jones character of the butcher that he starts to lose himself.", "I had no idea it would turn into a love craft theme horror until that stretch.", "I know, not a lot of people understand this specific genre of horror is considered inspired from the books of HP Lovecraft.", "I try to explain to people what lovecraftian or love craft horror is by telling them it involves demons, time and space, and just cosmo like elements and they still can't get a grasp of it.", "It's somewhat of a tough sub genre to explain because what happens in these movies are so bizarre. It's supernatural but more from the universe rather than straight up aliens, or supernatural demons and ghost."], ["Have you seen that new Allison Williams horror movie?", "I don't think so. What is it called?", "It's called Get Out.", "Oh ok. I've heard of it, but haven't seen it yet.", "I really liked it. It was a nice departure from her role in Girls.", "What is it about?", "She brings her new boyfriend home to meet her family and he finds out that they have sinister plans for him.", "That sounds interesting.", "It is. It's really unexpected and unusual.", "I'll have to check it out"], ["What good horror movie should we watch tonight?", "How about a classic? Like from the 90's.", "You mean like Halloween?", "Yes. They are old, but good.", "Mike Meyers is just a creepy guy to look at.", "Yeah and how many times you think he's dead, he's really not.", "I don't know. Maybe the remake of Halloween.", "I thought that one was great.", "Maybe We will watch the remake of Halloween. Good idea.", "See I come in handy every once in a while."], ["Can you imagine \"The Omen\" was forty-one years ago? It's still on the best horror lists.", "Of course it is. The music alone makes it super scary.", "Gregory Peck and Lee Remick had lots of chemistry. I wonder if they acted together before.", "I don't know, but that kid was so scary. He was so innocent looking, but the evil ones always do.", "I wonder how they pulled off that fall scene. It looked like Hitchcock.", "I know. She was all broken up. It was so good in slow motion.", "Do you think they're going to do a remake? That would be awful.", "They're probably considering it. They can get Bruce Willis to be the Dad.", "Would you just go to a park to meet someone when they seem crazy? That priest even looks crazy.", "If they mentioned my wife I would, but I would have definitely told others, or have others watching me."], ["Hello.", "Hi.", "Do you enjoy horror movies?", "Yeah sure.", "What do you like about them?", "I love the thrill of it.", "Oh okay.", "What about you?", "Yeah I really like how tense they are.", "Yeah."], ["Have you ever seen The Exorcist?", "You bet I have. Scared me so bad I had nightmares for weeks.", "Did you watch it as a child or more recently?", "Oh I saw it as a child, so I appreciate the horror of it now.", "Yeah kids who see it for the first time today think it's cheesy.", "Oh they have no idea the seriousness of the subject matter.", "I agree. When Reagan turned her head all the way around... that was it for me.", "That's one of the scariest scenes along with when she was levitating.", "I felt so bad for the old priest Marin. He walked into that house knowing he was about to give his life.", "I've seen the uncensored version with the spider walk down the stairs. That was absolutely terrifying."], ["I just saw Krampus over the weekend.  Wasn't that the one you told me about?", "The one based at Christmas?  Did you like it?", "I thought it would be scarier.  The scares all seemed to come at once and were predictable.", "It was a bit slow to start.  It took forever for the elves to take the sister.", "What other movie was based in this universe?", "Trick R Treat.  That is the with Sam in it.", "Ah, right.  What did you think of the ending on this one though?", "They left it up to the viewers it seems.  I think they were given another chance.", "I thought that too.", "It is still a little disturbing being left to wander though.  They could be trapped in a snow globe."], ["There is this really cool horror movie from the '80s called Ghost Story that I'd think you'd like.", "What's the plot?", "These elderly man killed a young women when they were young men, and the her ghost comes back to kill them.", "Oh, that's an interesting storyline.", "This actress named Alice Krige plays the woman they killed.  She's super creepy.", "Is this movie based on a book?", "Yes, it is, as a matter of fact.", "Who else is in the film.", "Fred Astaire and John Houseman are two of the old men.  Craig Wasson has a part as a young instructor at a college.", "It sounds like an eclectic cast."], ["hey have you watched any cool horror movies lately.", "yes I watched all 3 ring movies this weekend", "how was that?", "I really enjoy the first two.", "How was the third", "it was weird and kinda boring. I dont like how they didnt use a haunted vhs", "awww that sucks. I like the haunted tape.", "ya I did too. it just wasnt as good or fun as the old ones.", "have you seen any of the Japanese ringu movies?", "Yes they are great I really enjoy them."], ["I miss old horror, like Twilight Zone-style horror.", "Have you seen The Similars?", "I have not heard of that. Is it similar to The Twilight Zone?", "Yes. In fact, the director, Isaac Ezban, was partially inspired by that show.", "Cool, what is it about?", "It takes place in a bus station during a huge storm, where people trapped inside start changing into...something.", "Does it have any famous actors in it?", "It is a Spanish-language movie made in Mexico, and I am not sure if the actors are famous in Mexican cinema.", "Are there subtitles?", "Yes, and the dialogue is paced well so there is a lot of time to read and be creeped out at the same time."], ["Did you see the movie, The Babadook?", "Yes, that is probably one of the scariest movies I have ever seen.", "Do you remember the part when its standing in the kitchen?", "God yes, that part freaked me out so bad. I kept thinking, why are you just staring at it lady, run!", "Haha, I know right. I would have left that house to try to get away from the memories haunting me.", "That was so weird that they made a plot twist like that, even though they kind of hinted at it.", "Yeah, the only thing I don't understand was the worms at the end of the movie.", "I didn't really understand that either, but I think it was symbolic of them learning to feed their negative memories and keep them around, but not give in to them.", "I never looked at it that way, that's a pretty interesting hypothesis.", "Thanks, I actually read a lot about the movie so I didn't make that up on my own."], ["What's your favorite scary movie?", "I love scream, what about you?", "I think I like the Halloween series the best?", "Yeah, that's a good one.", "Mike Meyers has creeped me out since I was a kid.", "A dude in mask with a knife is scary.", "I know, right?!", "I think they're similar don't you?", "Scream and Halloween?", "Yes."], ["Have you ever heard of the movie Rubber?", "No what is it about?", "A killer tire.", "That sounds so fake.", "It was an independent horror film.", "So the tire goes around killing people?", "Essentially, yes thats the movie in a nutshell", "Do you see how stupid that sounds?", "They have to try and kill the tire before it kills them.", "I just dont see that kind of film working in America."], ["Have you watched saw?", "Yes, i havent seen all of them though", "Me either", "They got kind of dumb after the first couple", "I agree with that", "But the first one was good", "Yes the first one was really interesting", "I lost interest after that though", "Me too", "They seemed to just drag them out"], ["What is the scariest japanese-american horror movie?", "I think it is probably The Grudge.", "Was that the one that was originally Ju-On?", "Yes, this one has Sarah Michelle Gellar in it.", "The sound that the boy and woman makes is terrifying.", "Exactly, it is like a creaky groan.", "My favorite part of the movie was when the ghost was under the covers.", "That scene completely blew away my \"safe spot\" when I'm scared.", "There was no happy ending either, which was different at the time it was released.", "Now you never know if a movie is going to end good or bad."], ["Did you see the film, The Babadook?", "yes, i liked it, did you?", "I liked parts of it. I thought the mother role was very well acted.", "Agreed.Essie davis was the actress I think, she really transformed her looks and being into the role.", "She was super creepy and believable. What I did not care for was maybe the end, just feel short for me.", "I do think they created all this tension and fear and then maybe did not pan out the way you expect.", "It left me wanting more or thinking that's it?", "I think it was still well done and scary.", "I do think it was scary and well done but not on my favorites list.", "Fair enough. Not every film can be placed among the very top. Still think it is a good movie."], ["How many of the Scream movies have you watched?", "I think just the first two.", "The first one was the best out of all of them.", "How many were there all together?", "I think four.", "I don't like when they keep making them. They should stop at two.", "Yes, how much could you do with a scary man in a scream mask?", "I agree.", "The first Scream does have the twist of who it actually is though.", "Yeah, the first time you watch it."], ["Have you seen the trailer for the new Annabelle movie?", "With that creepy little doll?", "That comes to life. Yep.", "That movie freaked me out!", "It is a possessed doll.", "In this one she like haunts an orphanage right?", "Yep, and I think possess a kid or two.", "Doll scary movies are always so scary!", "Like Chucky.", "And The Bride of Chucky."], ["What do you think of vampire movies?", "I love them.", "What is your favorite one?", "I like Subspecies.", "Is that American?", "No, it is foreign.", "Cool. What other vampire movies do you like?", "Abbot and Costello Meet Frankenstein is great, cause Dracula is in it. But, it's pretty comedic.", "Nice, have you seen Nosferatu?", "Yes, I love that silent film."], ["What's a good horror movie to check out?", "If you haven't seen it, I'd recommend A Nightmare on Elm Street.", "The one that came out in 2010?", "No, that is a remake and not nearly as good as the original. I'm talking about the one that was made in 1984.", "Who is the main villain in that movie?", "His name is Freddy Krueger, he has a burnt face and wears a glove with knives on his fingers.", "So he just walks around and stabs people with his knife fingers?", "Not exactly. He appears in people's dreams which if you think about it is pretty scary.", "It's just a dream, what's scary about that?", "Because if he kills you in the dream, you die in real life. Also that fact that you have to sleep eventually so there is no escape from him."], ["Did you ever see The Grudge?", "Yes I did and that's one of the scariest movies ever.", "You're so right about that. Did you ever see the Japanese original movie called Ju-On?", "Yes but I relate to the American version better. But it was really good.", "I agree. I was into Asian horror for a good while there.", "Me too. There's an Asian horror called Audition which is pretty creepy.", "I've seen that. What's your favorite Grudge movie?", "Part one of course. It was the scariest and really laid out the story.", "Yeah that creepy voice of hers gave me many nightmares.", "I played a prank on my uncle over the phone once using that voice. He didn't want to admit he was scared but I know he was."], ["Did you watch that scary movie with Jennifer Love Hewitt in it?", "The one from the 90s?  Was it called I Know What You Did Last Summer?", "Ah, yes, that is the one.  They ran over a guy on the road while drinking.", "Freddie Prinze Jr is in it with Sarah Michelle Gellar too.", "I always liked the fact that they are now married.  Still sad that Sarah died in the movie though.", "She could have made it too if she just ran a little faster to the parade.", "What about the death of her sister and the character Johnny Galecki played?", "I was confused about them dying since they had nothing to do with the accident.", "I suppose the killer doesn't have to have a moral compass.", "True.  Had some great jump scares without too more gore."], ["Have you seen Dawn of the Dead?", "Yeah, that was best best of the Romero films.", "In terms of plot and acting I agree all the way.", "The way they negotiated that mall.  You got to know the characters.", "I also liked the way that the characters were all so strong.  Especially the woman.", "At first she wasn't.  But she developed.", "Those zombies creeped me out when the tennis ball fell and they were everywhere.", "One of the creepiest moments I ever saw what when Rodger came out a zombie.  With that walk.", "And he somehow remembered where the food was.", "yeah, that's just plane scary."], ["Have you seen the preview for the new It.", "I have. Uber creepy.", "I think they top ol Tim Curry.", "Yeah, but the first one wasn't all that scary.", "True. I actually watched that on Holloween in a cemetary!", "How'd you pull that off?", "My cousin was renting a place that happened to be smack dab in a cemetary.", "Crazy! Did you get scared?", "No. That's my point. The new one looks way freakier.", "I'll have to agree with you there."], ["I just saw Babadook.", "I heard about that.  Any good?", "Pretty spooky.", "Who directed?", "Jennifer Kent.", "What's it about?", "A monster in a book comes alive.", "Sounds cool.  How does it end?", "The mother keeps the Babadook in her basement!", "Cool!"], ["I saw The Other today.", "How old is that one?", "1972.", "Who was in it?", "Diana Muldaur.", "Wasn't it based on a book?", "Yes, Tom Tryon's novel.", "What happens in the end?", "The grandmother tries to kill the evil twin, but fails.", "Sounds very chilling."], ["What's your favorite way to watch horror movies?", "Alone, on my computer, in the dark, with digital headphones on.", "Sheesh, that's specific. Why?", "It's the best possible way!", "How so?", "It's the best atmosphere: by yourself and the sound really comes through.", "I love it in theaters.", "Why?", "The audience is awesome and it's on a huge screen", "That's why I can't: if there are teens there they egg each other on and talk the whole time. Irritating."], ["Have you seen the new Aliens movie?", "Yes. Have you seen it?", "No, but i really want to because I loved the first one.", "I can't recommend the new Aliens movie because it was really boring.", "Oh No! I think James Cameron's movie are always blockbusters!", "I agree but this time he missed the mark. The movie was a lot different from the first one.", "What was the biggest problem that you had with the movie?", "It did not have Sigourney Weaver, the actress from the original!", "That is funny! Okay, so you are just in love with the original.", "Yeah,  I did like the new reclining seats at the theater so I guess you can go wrong with that."], ["Is Crimson Peak a horror movie or something else?", "That depends. I think it is classified as horror, but it is also a kind of gothic drama.", "Guillermo del Toro's movies always creep me out. Is Crimson Peak like his others?", "Yes. Beautiful and stylistic, with insane practical effects. The special effects makeup for the ghosts is incredible.", "Also it has Tom Hiddleston, who played Loki in the Avengers. How is he in the movie?", "He's all right. He isn't the main character, but if you like him, there is a lot of him.", "One thing I love about Guillermo del Toro is even his darkest movies are hopeful.", "That is what makes me unsure if Crimson Peak is horror. It is atmospheric, and tense sometimes, but never truly horrific.", "What about the ghosts?", "They are definitely spooky!"], ["Have you seen '28 Days Later'?", "No, what's it about?", "It's about a zombie takeover of England. There's really creepy footage of London just completely empty.", "I like zombie movies, I'll have to see it.", "It was directed by the same guy who did 'Trainspotting', too.", "Oh I love that movie. That's scary in its own way.", "There's a sequel too called '28 Weeks Later', but in my opinion it's not as good.", "Same director?", "No, it's a different director and I think that's why it's not as good.", "Always best for horror franchises to keep the same director."], ["Do you remember the movie The Stand?", "The one based off a Stephen King novel?", "I think it might have been.", "Oh, it definately was.  They ran it as a TV series.", "Did you like it?", "It was okay, I guess.  I watch it every couple years.", "I loved it!  Why did you only think it was okay?", "I read the book.  The book was much better.", "Oh, was there much more in the book?", "There was more about the plague and random deaths.  There was a lot more background on the characters too."], ["Do you think Nightmare on Elm Street is the best horror film", "Yes because it was not all about the gore", "Sure that was a huge part of it", "Yeah but it incorporated psychological elements", "Yeah you are right about that too", "I think it played on your head as well", "So that would be the worst kind of horror?", "I think so", "Yeah but Freddy was a scary character too", "He was frightening to look at."], ["Have you seen thirteen ghosts?", "Its been a while", "Same here", "I think i liked it though", "From what i remember it ised to be one of my favorites", "All i remember is the lawyer getting sliced in half by thkse doors that was one of my favorite parts", "Doesnt his eyebals move after his body slides down?", "I believe so", "It was a little creepy and funny", "Yes it was"], ["I've been really into horror movies lately.", "Yes, the same thing is happening to me.", "I just rewatched Halloween last night.", "The original or the remake?", "Obviously the original.  The remake is horrible!", "Halloween is such a great movie, Jamie Lee Curtis is fantastic in it!", "Yes, it's my favorite of all the horror movie killer movies.", "Michael Myers is the best one as well.", "Freddy and Jason have nothing on him.", "I definitely agree with this!"], ["Lets talk about movies", "Okay i love movies", "How about horror?", "Sure those are great", "Have you seen the hoise on haunted hill?", "Yes that one was so good", "Only like two pwople got out at the end right?", "Yes thats it", "Thats not alot", "Nope but at least someone survived"], ["Do you remember Jeepers Creepers?", "It sounds familiar.  Was that a movie?", "Yeah, a horror movie.", "Oh, was it the one with the monster with the eyes.", "I don't remember right, but I think he'd eat eyes.", "Oh, yeah, something like that.", "And that song would play everytime he'd come.", "Yeah, \"Jeepers Creepers.\"", "Was that a real song?", "Yeah, I think from the forties or something."], ["I just saw John Carpenter's Vampires.", "Wow.  Who is in it?", "James Woods, Maximilian Schell.", "What happens in the movie?", "James Woods' team of vampire killers gets wiped out by a group of vampires.", "Wow.  Does he survive?", "Yes.  He and his only surviving partner go after Valek, a master vampire.", "Neat.  What happens in the end?", "They get to kill Valek.  His partner turns into a vampire.  Woods lets him go.", "Sounds pretty interesting."], ["Do you like slasher horror films?", "I must admit that all though the freak me out i do enough them quite a bit.", "Do you have a favorite one?", "I like most of the Friday the 13th movies and the Halloween movies as well.", "Did you get to watch all the Scream movies?", "The Scream movies are great, i love what they did with the slasher movie concept.", "Yeah, having a killer that is fixated on serial killers and slasher movies is a bit of a twist on the genre.", "I hope they make another one in the future.", "Who knows, they will probably end up rebooting the whole franchise for the next generation of kids waiting to be terrorized.", "Well i'll be on deck waiting to buy a ticket myself."], ["Did you ever see 28 days later?", "That's one of my favorite horror movies! It was extremely clever.", "It really was. The directing by Danny Boyle was fantastic.", "I love his cinematic style. It was such a harsh movie but you can still view it multiple times.", "I know I've seen it at least 20 times. I think this is the first zombie movies where they run fast.", "You're right, they're always limping and slow moving.", "The original Night of the Living Dead set off the zombie genre.", "That was an excellent movie. A lot of controversial themes in it too.", "Right, it was really groundbreaking. Feels claustrophobic too, so you get a visceral reaction to it.", "I know. The scene at the end where the hero dies because of a mistake is so sad though."], ["Hey, Jaws came out 42 years ago this summer", "Wow! That's a long time ago.", "Yeah and the movie still holds up", "Yeah, definitely makes me think twice about going into the water at the beach", "Some great acting in that first one", "Yes, Roy Schneider and Richard Dreyfus", "Richard Dreyfus?", "Yes, he was the shark scientist with all the answers...supposedly", "Oh yeah, I forgot about him", "Yeah, I thought he did a good job. Definitely one of his best."], ["Have you watched any good horror movies?", "I saw the Witch.", "Oh, I heard good things about that one.", "It was really good. I have no idea how the writer got them to sound like they're from the early colonial era, including even the accents.", "Will I have to watch it with subtitles?", "I think you might. It could be hard to understand without.", "Was it very depressing?", "It was, but that was necessary. There are tons of touching moments too.", "I might check it out.", "You should. The Witch was about fate and the slope of corruption."], ["What is a really good vampire movie?", "Fright Night", "Oh, is that the one with Colin Farrel?", "Ni, that is the remake. The original one is from 1985.", "Oh cool. I had no idea about that movie.", "It's really good. You should watch it.", "What happens in the movie?", "A vampire moves next door to a kid.", "That sounds scary.", "It is and very fun to watch."], ["I watched that movie, Dead Silence, that you recommended me!", "Did you like it!?", "I did! It was really scary! How did you know dolls creeped me out?", "Don't they creep everybody out?", "Good point. That wall of ventriloquist dummies really freaked me out though!", "The dead boy as a puppet is what really scared me!", "That was really weird too. I was surprised at how they began the story too, they kind of jumped right in.", "Oh, you mean with the death of the main guy's pregnant wife?", "Yeah! Talk about jump scares!", "Tell me about it! What a movie though."], ["Do you consider The Sixth Sense to be a horror movie?", "Yes, of course. Ghosts.", "I looked it up and it's listed as Horror-Thriller.", "Do you agree?", "Well, ghosts don't make it horror, like Casper.", "That's an extreme opposite, though, and shouldn't apply.", "It's not scary is the issue. They see ghosts who have been bloodied, but it's not scary.", "So what's it?", "It's a kid who can see ghosts, and someone just coming to terms with that they're dead.", "So, a psychological thriller?"], ["Can you think of a really scary horror movie to watch tonight?", "How about watching a movie called Willow Creek?", "What kind of movie is it? What's the it's about?", "It is a found footage type of movie and it's about Bigfoot.", "So they make a video of Bigfoot in the movie?", "Well you'll have to watch the movie to find that out. The main characters do bring a video camera with them on a camping trip.", "Why do they have a video camera while camping. That sounds unrealistic.", "The reason given in the movie is that the couple are actually making a documentary about Bigfoot sighting in the area they're camping in.", "Oh cool. So it's just two people in the whole movie.", "Well, there are a few other minor characters but yes, most of the movie is just about couple in their 30's making a Bigfoot documentary."], ["Is scary movie an actual horror movie", "Well yes and no", "How can something be both", "Well technically it is horror", "So it is scary", "Nah it is comedy", "What?", "Well it is horror in its theme and subject matter but overall it is funny", "Well that just a let down i was looking for a scary movie", "Nah it is just a spoof of Wes Cravens movies"], ["So I heard you are a horror movie buff.", "Yeah I have watched horror movies since I was a kid.", "What are some of your favorites?", "I like several, but probably Amityville Horror and Stephen King's It.", "Is Amityville based on a true story?", "Supposed to be.  THere was an actual house and people kept moving out of it.", "Are you going to see the remake of IT?", "Definitely.  I'm a little nervous though, I hope they don't mess it up.", "What do you mean?", "Well I am a big fan of the original.  TIm Curry is an excellent Pennywise and I don't really know if they are going to make the new one look different or act different."], ["I just watched Zombie Land for the first time.", "I love that genre.", "The horror movie but also funny.", "Have you ever seen Shaun of The Dead?", "Is that one set in the UK?", "Yes, funny guy fights zombies.", "Is it scary and funny?", "Yeah, a lot like Tucker Vs. The Evil dead.", "I love that one!", "You should check out Army of Darkness then."], ["Did you watch the Jason movies growing up.", "I did, those Friday the 13th movies scared me to death.", "Yeah, I had nightmares about Jason all the time growing up.", "I don't think our parents knew what we were watching during all those sleep overs.", "I think if they had they wouldn't have let us watch them.", "Which one was your favorite out of them all?", "Friday the 13th, the final chapter.  It was the first one I saw.", "Did you see the other ones?", "Yeah, I think I have seen them all, but that 3rd movie is still my favorite.", "I like the orginal, its still the best of all the 80's slasher films."], ["Did you ever watch the Scream movies?", "I saw them back when they were in theaters.  The first one I saw in 1996.", "The original was the best, I never figured out who the killers were until the end.", "Me too, it never occured to me that there would be two killers.", "The dialogue was so funny with Randy.", "Yes, he had rules that one would have to abide by to successfully survive a horror film.", "I feel sad that Tatum had to die.", "I never was completely convinced that the garage door would have lifted her up though.", "I do feel like that was the most unbelievable part of the movie.", "Yes, garage doors probably have safety features with a weight limit."], ["Did you watch The Happening?", "That movie kind of freaked me out!", "It was pretty good right?", "Yeah, I didn't know what was going on.  M. Night Shyamalan is good.", "Yeah, his movies are pretty good.", "Were you able to sleep after watching it?", "Oh, sure.  I was more aware of my surroundings though.", "I know!  I felt like the plants were watching me!", "Exactly!  I felt like that for like two weeks.", "I feel the same way."], ["I saw Only Lovers Left Alive.", "Who directed it?", "Jim Jarmusch.", "What's it about?", "A vampire couple trying to stay alive in modern times.", "Who stars in the movie?", "Tilda Swinton and Tom Hiddleston.", "Neat.  Do they survive?", "Yes, after a lot of angst.  They end up going after a young couple.", "Cool, I might watch it."], ["why do you even like horror movies?", "its kinda like an emotional roller coaster", "i guess thats why i dont like horror.", "maybe so", "it all seems so pointless for me.", "yeah, you know whats going to happen.", "its so repetitive and boring", "its about the thrill", "thats what i dont like i suppose", "you want real art."], ["Have you seen any good horror movies recently?", "I liked The Invitation and the Purge", "Which one did you like better?", "I liked the Purge, the idea is so crazy!", "What's the plot about again?", "Well one day a year you can do whatever crime you want", "Even murder and steal?", "Yeah, well that's what the whole movie is about", "Is that it?", "Well one family takes in a black guy that others are trying to kill and they have to protect him now"], ["Do you remember the Nightmare on Elm Street movies?", "Oh, those were my favorite!", "Mine too!  I really loved Freddie Kreuger!", "He was such a unique villain.", "Yeah, you never knew what he was going to do.", "Or what was real.", "I don't even mind the remakes.", "Yeah, but the classics are always the best.", "Yeah, there can only be one Freddie.", "I can't even see him on TV without thinking Freddie!"], ["What are some of your favorite horror movies?", "I have a lot. I like horror movies. Some of my favorites are The Exorcist, The Shining, and Don't Breathe was pretty scary.", "Oh, Don't Breathe was awesome.", "Yeah, after seeing the trailer I had to see it.", "That movie was so different on many levels", "Yeah, home invasion is a pretty real world problem.", "Yes, and the being chased by a dog is a big fear of mine.", "How about that turkey baster scene?", "Oh, that was unpleasant.", "Yeah, but Rocky got away in the end and the blind man said nothing. Maybe a part two will be coming soon."], ["Have you ever seen The Omen?", "Oh that's a classic! I watched it first when I was young.", "Me too. My mom was into horror so by default so am I.", "Oh wow. The little boy who played Damien was a frightening character.", "Evil kids in movies are always terrifying. Part 1 was the best.", "It really was. I barely even remember the others.", "Well he basically progressed into higher ranks of political office throughout the series.", "Oh I remember that, just can't remember many details. I remember the dog in the first one though.", "Right, that was his protector. People were willing to give their lives for him.", "Well when you're the Antichrist, a lot of perks come with that."], ["Have you seen any good horror flicks lately?", "It's been a while actually. How about you?", "I did just see A Serbian Film, directed by Srdjan Spasojevic. That was really intense.", "Oh, yeah? How so?", "Well it was really grotesque and difficult to watch.", "Aren't all horror films like that?", "Yeah, but this was one was more like Salo.", "Is that the movie based on the Marquis de Sade novel?", "Exactly, and anything written by him is going to be a difficult watch.", "Sounds like not something I'd want to watch."], ["So what did you feel about the remake of the Nightmare on elm Street?", "I totally hated it!", "Why didn't you like it?", "Where do I even start?", "Ha, well from the beginning.", "The fact that Robert Englund wasn't playing Freddy was mistake number one.", "Yes, that was a box office blunder.", "Secondly, the retelling though not horrible wasn't quite correct with the movies lore.", "What did you think about the movie effects?", "That at least was the best thing about this movie."], ["What was the name of that movie with the guy in the mask", "Their is alot of movies like that", "It was a horror movie", "What kind of mask was he wearing", "He was wearing a white one", "Was it ghost like or small", "It  looked like a ghost", "i think i know the movie", "What movie is it", "I think it is scream"], ["So, this gay Babadook meme has me thinking of the film again. Did you see it?", "Yes. I loved the art with the book illustrations but the scares were somewhat standard fare for horror. The meme is fabulous, though.", "I get what you mean about the  scares but that ending though…", "Oh yes, the ending was brilliant. The big bad isn't banished, merely made manageable. Good twist.", "I read in some interviews that it was a metaphor for grief and/or childhood mental illness.", "Yeah, I can see that. That's a new one. Almost like how Insidious had a haunted child as opposed to a haunted place.", "Yes, except this movie didn't suck the life out of me with boring actors like Patrick Wilson and Rose Byrne.", "Oh my glob, I know right? They're like watching cardboard. Totally took me out of the atmosphere of the tilm. I just wanted them to die.", "Wanting the protagonists to die is a bad thing for horror… like normally you want to root for them.", "Yes, you want your Final Girl to triumph. Not the ill-defined underworld Darth Maul Tiny Tim … thing."], ["We decided to watch all of the Nightmare on Elm Street movies this weekend.", "Oh wow! Those are scary.", "I know they had me scared to go to sleep.", "Yeah because Freddy might get you.", "Well I didn't want to have a nightmare.", "Those movies really make your mind play games.", "I saw them when I was younger but really never let them affect me.", "I think as we get older we know that more dangerous things happen.", "That could be it and our imaginations are more vivid.", "Yes and with those movies it is all about imagination."], ["Oh my god, I just saw a horror movie and it freaked me out.", "That's their purpose.", "Worse than usual.", "Which one is it?", "Insidious, the original one.", "Why did it freak you out?", "I have those same experiences.", "The out-of-body while dreaming?", "More than that, it's the wandering and going places. It's a real thing.", "Dang, that seems freaky."], ["Whats your favorite horror film?", "I would say The Shining.", "Oh wow that was such a great film.", "Yeah I think Jack Nicholson did such a phenomenal job", "It was scary for sure and he did do a great job.", "The scene where he says he is not going to hurt her.", "Yeah I know the rest.", "I thought that was cinema 101.", "It was a very scary moment.", "The entire movie was and it is my go to horror movie."], ["Do you like older horror movies?", "From the 60s and 70s? Yeah, they're my favorites.", "So you've seen 'Night of the Living Dead'?", "Of course, it's a classic!", "What's your favorite horror movie from that era?", "That's tough. Maybe 'The Exorcist' or 'Rosemary's Baby'.", "I've only seen 'Rosemary's Baby' once and I remember it creeped me out.", "Exactly, it's not so much scary as really, really creepy.", "'The Exorcist' is iconic, too.", "I could watch that movie a million times. So original and terrifying."], ["Who'd win in a fight, Jason or Feddy?", "Chucky.", "Chucky?! He's a doll.", "Yeah, that's why he'd win. They'd never see it coming!", "Fine. Have it your way.", "Seriously, Freddy.", "Why?", "He could get in Jason's head.", "I could go with that.", "Plus the claws."], ["Have you seen Cabin in the Woods?", "Yes I have. It happens to be one of my favorite horror/comedy movies.", "Did you know that Joss Whedon was one of the writers of the movie?", "I didn't know that. I love his work on Buffy the Vampire Slayer.", "Me too. I think he also produced the movie too.", "Very cool. Who was your favorite character in the movie?", "I loved Marty. He was always saying some funny stuff.", "I liked him too. I loved Bradly Whitford's character.", "Ya I think his character was named Steve.", "You're right it was Steve. So sad he had to die in the end."], ["Whats the last horror movie you saw?", "The conjuring 2", "Those movies are good", "What about you?", "Paranormal activity", "Those movies are good", "They are, i hate how they go backwards though", "I agree i want a story feom beginning to end", "Not end to beginning", "Ecactly"], ["You ever watch the movie Scream?", "Yeah, and the sequels", "Cool, you know the movie has the right of it.", "What do you mean?", "I mean, that certain things always happen more or less the same way in most horror movies.", "For instance?", "Oh, like the confindent guy or the guy that doesn't believe in the kiler or monster is either the first or next to be killed.", "Yeah, and if there is a basement or an attic, that's were the first victim gets it.", "Also, the guy or gal who says \" I'll be right back\", is always the next to die, mutat, or get zombified.", "True, plus anybody who has sex is fair game for the chopping blow."], ["What is one of your favorite horror movie reboots?", "I enjoyed Friday the 13th from 2009.", "That was an interesting one.  I really liked seeing Jared Padalecki's performance.", "He is really good in Supernatural, so it was a natural pivot for him to do this movie.", "I also was not expecting the death scene with Jenna near the end.", "That was the part that made me sad.  They got so far to the end.", "I'm just glad that Clay was able to find his sister.", "Can you imagine being locked up with only Jason to feed you like she was?", "No, I don't think I would have made it for the 6 months she was there.", "Maybe Jason will stay dead now after this movie."], ["Are you a fan of horror movies?", "Generally I am, though, there are some that are a little too vulgar for my taste.", "What movie do you think is your favorite horror movie of all time?", "That's actually a toss up between Alien and Aliens, both are great.", "Wait.  Alien isn't a horror film, that's a thriller.", "I completely disagree, Alien is the best type of horror.  One where the horror isn't how much blood is on the screen, but instead the amount of fright and anxiety you feel during intense scenes.", "So you don't like bloody, gory horror movies?", "No, I enjoy those as well.  I'm just more impressed by the ability to generate horror without resorting to gore.", "Well, if you had to pick a gory horror movie as your favorite, which one would it be?", "I'm thinking the latest Evil Dead movie would be high on my list."], ["Did you watch the Friday the 13th movies growing up?", "Not really.  I've probably seen them all though.", "Oh, but you didn't like them?", "No, I found that Jason was pretty boring.", "He kills everyone.  How is that boring?", "It's just a cycle of death.", "What do you mean?", "He only uses a machete.  Victims are all councilers.", "Well, he did go to Manhatten that one time.", "Oh, that one wasn't so bad!"], ["Do you want to go see a horror show tonight.", "Sure.  I saw that Screemdream is out now.  Looks pretty scary.", "No.  I like the old B rated horror flicks like the ones they play at 5th avenue.", "Oh, that sounds good.  Something like \"The Swamp Thing\".", "Exactly, an old black and white flick.  I think the original Dracula is playing.", "With Bela Lugosi?", "Yeah, that's a classic for sure.", "Ok, that sounds good.  But next week we've got to go see something modern like Light's Out.", "I've heard that one will keep you on the edge of your seat.", "Yeah, I've heard it's an unsettling, fright-filled experience."], ["I just watched The Shining made in 1980. Have you seen it before?", "Oh, yes I have move than once.", "Jack Nicholson is perfect for the part that he played.", "I can't imagine anyone else playing that part.", "It really scared me the first time I saw it. The acting was so good it seemed real.", "I agree, the acting seemed effortless. Great actors in this one.", "What about when Jack has typed Red Rum over and over.", "That was so creepy. It was great.", "Then of course there is the famous ax in the door scene.", "That scene is hands down one of the best most iconic scenes in horror history."], ["I just saw Thirst.", "A foreign movie?", "Korean, Pan Chan-wook.", "Any good?", "Yes, a vampire love story.", "Who are the stars?", "Song Kang-ho and Kim Ok-bin.", "What happens in the end?", "The stars burn up in the morning sun.", "Wow, dramatic."], ["Seen any good horror movies recently?", "I have watched a few. I enjoyed crimson peak have you seen it?", "I did watch it a few years ago now. I liked the costumes in that film.", "The costumes added a lot to the atmosphere and time it took place in.", "I also thought the cinematography was very well done. But was it really a horror?", "I thought so. It has some plot twist that may have been more thriller but I thought it was very creepy and scary and fits the horror category well.", "Mia Wasikowska has a kind of creepy vibe to her in general. Very gothic feel to the film and her.", "Maybe it is her pale skin. And yes gothic is a very good descriptor of the films feel and look.", "Guillermo del Toro is very skilled at producing some evry visually appealing scary movies.", "True I liked pan's labyrinth as well."], ["What is your favorite Jason Voorhees movie?", "That is a tough one, but I liked Freddy vs. Jason.", "That movie also starred Kelly Rowland from Destiny's Child.", "Of course the best actor from this movie is Robert Englund.", "The original Freddy Krueger.  I'm so glad he came back for this movie.", "Me too.  He has a humor and twist that is hard for another actor to duplicate.", "Freddy made a big mistake resurrecting Jason though.", "He was definitely over confident in his ability to be able to control him.", "That was an epic fight scene at Camp Crystal Lake.", "I would love to see a sequel adding in other horror movie villains.  Michael Myers maybe?"], ["What do you think is the best teen vampire movie?", "The Lost Boys and it is the best vampire movie altogether.", "Is that the one with Cory Haim in it?", "Yes and Feldman", "They were a great duo.", "Yeah they were and very funny on screen.", "Did you think The Lost Boys was scary?", "Yes it was.", "What is the scariest scene?", "The part when they are flying over the cop."], ["The Rob Zombie movie \"House of 1000 Corpses\" is quite disturbing.", "Yes, I agree, I was a bit freaked out the further along the movie went.", "When they pulled into Captain Spaulding's place, I thought he was just a weird, funny guy.", "I know, I started freaking out a bit when they rode the Murder Ride, I knew something wasn't right.", "Probably when things really got bad was when they dressed the people up as rabbits and put them down that hole in the ground.", "Right, that was terrifying and the girl running for her life and coming face to face with that monster Dr. Satan.", "You know, that was so bad, he was extra creepy.", "The worst part of the whole thing was the end, you know, when she rose out of the ground and that horrible place.", "Yes, I truly thought she was safe, and all I could think was \"run girl run!\".", "Of all people to pick her up, Captain Spaulding, well, we both know what happens now, and the movie doesn't even have to continue!"], ["What do you think is hitchcocks scariest film?", "Psycho, I think this is his scariest ever, don't you?", "It is good. but scariest for me is The bird's.", "I think the they are both worthy of being in the horror category. Psycho is far more scary though.", "I don't agree. THE FACT THAT NATURE IS SO UNCONTROLLABLE AND CAN JUST TURN ON HUMANS ANYTIME IS THE ULTIMATE SACRE.", "no need to yell.. Just kidding. It is a scary concept. But still say psycho look at what that says about human nature and how sick some people are.", "I think we will have to agree to disagree on hitchcocks scariest. Anthony Perkins certainly creeped me out in this role.", "Perkins is the ultimate creep in this role. Did you ever notice how he walks up the stairs in the main house?", "Yes actually, he kind of sashes, sways his hips like a woman.", "I often wonder if this was perkins natural movement or a character choice.. either way worked well for the role."], ["Which Psycho did you like better?", "The original was fine.", "Norman Bates was seriously a disturbed character.", "Yeah the entire premise was bizarre.", "It was a great film because of its gruseome demeanor.", "The updated version was not bad either.", "Yeah but the original really made Bates who he was.", "I think he was so disturbing", "There was alot of truth in the film", "I think thats why it scared so many people"], ["I heard that the new Tom Cruise Mummy movie didn't do so hot its opening weekend.", "I guess his movie star mojo works better in Mission Impossible movies.", "Personally, I prefer the classic Universal horror films anyway. Nothing will ever top them.", "Those creaky old things? They're so...old.", "My friend, you do not appreciate the masterfulness of the original Frankenstein, Dracula, Wolf Man, and Mummy movies. They are amazing.", "They're in black and white. Boring.", "Karloff was incredible. His stage presence, even playing Frankenstein's Monster with no dialogue.", "Not my cup of tea. Now Freddy Krueger, that's a horror villain.", "Nah, modern horror films are mostly shock cuts and gouts of blood. Just watch the original Dracula with the lights out, you'll pee your pants.", "Okay, maybe I'll rent one-- just one, mind you-- and check it out. Draculal - I thought Lugosi was badass in that movie about Ed Wood."], ["Has Johnny Depp been in any good horror movies?", "Yeah, he has been in a lot. He got his start in A Nightmare on Elm Street.", "Which is his best one?", "In my opinion, probably Sleepy Hollow, the Tim Burton one.", "I just hated Dark Shadows, though. Or most Tim Burton movies lately.", "Sleepy Hollow is also one of Tim Burton's better movies!", "How does it compare to Beetlejuice?", "It is not as good, and maybe not as creepy.", "Give me a good reason to watch Sleepy Hollow.", "Christopher Walken plays one of the scariest movie villains of all time in it."], ["Have you seen any horror movies lately?", "I actually saw a good one a few weeks ago, I don't remember the name though.", "What was it about?", "It was about a doll that came to life and killed everyone.", "Oh, I think I saw that in the theatres!", "No, I don't remember it being in the theatres, this one was indie.", "Oh, so it wasn't Annabelle?", "No, but it was heavily influenced by the genre.", "I wish you remembered the name.", "When I do, I'll let you know!"], ["Do you like horror movies?", "Sometimes", "I love them", "I dont watch them too often", "I watch them all the time", "Is horror your favorite genre?", "Yes it is, i love all horror movies", "I only like some", "Thats wierd", "Not really"], ["What is your favorite Friday the 13th movie?", "I love the third one.", "I didn't see that one.", "Are you a fan of the series?", "Of course.", "Then you have to see part 3.", "Nice. I will check it out.", "It is the first movie where Jason wears the hockey mask.", "That is awesome. Do they show his face?", "Yeah, it's very cool."], ["have you seen It Follows?", "no, not yet.", "it is interesting.", "What do you mean?", "a spirit follows a young girl everywhere she goes at a slow pace.", "What happens if it catches her?", "it attacks her.", "what happens?", "she has to stay one step ahead.", "sounds scary."], ["Have you watched any of those horror movies I lent you yet?", "Yes I finally watched The Cabin in the Woods. Even after hearing about the movie that ending was a twist!", "I find that to be one of the best horror movies I ever watched. It was not predictable at all.", "No, that movie defied all expectation. I really liked the part where they showed the panel of monsters they could choose from.", "I know when I saw that panel and heard them taking bets from different teams all over the world I was really confused, but I wanted to know what was going on.", "It did a good job explaining how the objects in the basement correlated to the different monsters. Using Dana to explain it while she figures it out herself was a good method.", "Yes, they did a good job providing the information we needed to understand without being boring. What did you think when that zombie family came out to attack the kids in the beginning?", "That part was kind of predictable as soon as I heard the story they were reading. It just helped set it up to be even better when it went so far out of normal horror movie territory.", "I sill do not quite understand how the ritual saves humanity, but I guess this time it didn't.", "No, Marty and Dana refuse to finish the ritual so that is the end of the Facility, and I assume the world if their rules are correct."], ["Bye Bye Man was the worst Horror movie I've ever seen!", "Oh yeah that movie was terrible, completely unoriginal and not to mention boring.", "Yeah totally, I saw Lights out though and though that was really good.", "Definitely, that one was really scary, by the same guy who made the Conjuring movies right?", "Yeah I think so.", "Conjuring two was pretty good I thought, did you see it?", "Yeah I liked it a lot, thought the monster looked a little cheesy though.", "Yeah I think so too, the nun wasn't very scary looking. I liked the voice when the girl was possessed a lot though.", "Yeah that was pretty creepy.", "Still, I thought the first one was a little better."], ["Have you ever seen Night of the Living Dead?", "The original black and white film?", "Yeah, so you've seen it?", "Sure, I love that one!", "Me too!  What do you love most about it?", "I don't know.  The whole movie is actually tense and has a sense of fear.", "It's actually scarier than some of the zombie movies today.", "You are right about that.", "Have you seen any of the sequels?", "Sure, but none of them match up to the originals."], ["I just saw Curandero.", "I heard about that.  Any good?", "Not bad.  Spanish flick about a Satanic cult.", "Who is in the movie?", "Carlos Gallardo and Gizeht Galatea.", "I heard about her.  She's hot!", "Oh yes, and tough too.  She plays a cop.", "Neat.  What happens in the end?", "The curandero does his job.  He and the cop survive.", "I'm glad they make it out alive."], ["Are you familiar with The Texas Chainsaw Massacre?", "Yes, it's one of my all time favorite horror films.", "Do you think it is the best?", "No, but it is in the top ten for sure.", "What about part 2?", "I love part 2 as well. It's way different though.", "How is that?", "Part 2 is more of a cult movie and part 1 is much scarier.", "Yes, that scene with the hook is really frightening.", "I agree. That movie seemed so realistic."], ["How do you feel about the Texas Chainsaw Massacre?", "I think it was pretty good.", "For a horror movie I thought it was campy", "Some of them always are.", "I just thought it leaned on generic stuff.", "Not really, it was alright on its own", "Did you see the one with Matthew McConaghey?", "Yeah that was terrible.", "Sometimes reprises can be boring", "He just didnt do a good job with it"], ["What is your favorite horror movie?", "I like the Michael Meyer's series, Halloween.", "That series is scary.", "It is!  Do you like the old series or the new one?", "I love the old series, the new one stinks.", "I agree, the older ones were made better.", "What part was your favorite?", "I would say the 2nd movie because that is when you hear about his back story.", "I can't believe his back story.  It was so scary.", "I know,  I felt sorry for him because of the way he grew up."], ["HI! have you seen Anabelle the horror movie?", "No I haven't", "You should watch it! it terrifying!", "I read that it was not that scary", "you should watch it alone", "I used to have a doll just like the one on the movie", "So,probably thats the reason you don't want to watch it right?", "I guess so", "Why don´t you come over and we can watch it togheter", "Sure, why not, I will be there in the afternoon"], ["House of Horror's Emporium.  How can I help you?", "HI, I was looking for the original Texas Chainsaw Massacre. Do you have it in?", "Ah, well, let me check.  That was when about...77, 76?", "1974.  Long time ago.  Lot of gore for that era.", "Oh, yeah, that was in the golden age of blood and body parts.", "Well, I'd like to see it again if you guy got it in.  That or The Shining with Jack Nicholson.", "Well, let me check here.  No, no looks like Texas Chainsaw is out right now.  Want me to check The Shining?", "Yeah, hopefully you have that.  I want something that's really gonna scare me again.  That movie always did that.", "Here's Jonny.  Yep got it.  I'll put it behind the shelf for you.", "Great. Hey another one of his I might want to see is Wolf.  You got it in?"], ["I really want to see The Babadook.", "Really? It just looks okay, to be honest.", "Yeah, but I want to see it because it's pride month and apparently The Babadook is an LGBT horror movie.", "What? How does that even exist?", "Apparently there's some kind of underlying plot points which a lot of gay people familiarize with.", "For some reason I feel like the Babadook might be a monster coming out of the closet.", "No no, I don't think i will be that easy. I do know however that the Babadook does have jazz hands and a top hat.", "It does sound kind of good, and gay people tend to have good taste. There aren't a lot of gay horror movies, I think maybe Martyrs is the only other one I've seen.", "Martyrs? What's that about?", "Oh it's crazy. Probably one of the goriest movies I've ever seen. They literally skin a girl alive and  only leave the face."], ["Have you seen the horror movie Uzumaki?", "What is that? Is it really scary?", "Uzumaki is by a Japanese manga artist I believe. His stories are truly horrifying... I mean campy.", "Campy like Scary Movie or campy like, you're lying to me!", "Campy like... well you'll have to see it. This isn't like Scary Movie but it isn't that horrifying.", "I feel like you're lying to me since you made me watch Human Centipede!", "Okay, it is kind of more like Human Centipede where it's bad campy but your brain might fill in the gaps.", "Ew! I still hate you for that!", "But it's not entirely like Human Centipede and less disgusting.", "I don't believe you and I'm not watching anymore horror movies with you!"], ["So, have you seen any good horror movies recently?", "Oh yeah, I actually have. I just saw the new Mummy movie, the one with Tom Cruise.", "Really? How was it? I heard it wasn't very good. At least it seemed that a lot of critics didn't seem to like it.", "I actually thought it was pretty good. It was a good, summer tentpole, popcorn movie.", "What did you like about it? How much was it like the classic Universal monster movies?", "Well, I definitely liked how they portrayed the Mummy. She felt both new and interesting, but, at the same time, still grounded in the world of Universal's classic monsters. Also, the overall movie had a neat sort of classic, B-Moive monster movie vibe to it.", "Oh, that is kind of cool. Where there any other references in the movie to Universal's other monsters?", "Yeah, there totally were. I don't want to say exactly what they were because I don't want to spoil anything, but I would say definitely keep an eye out when the main characters reach the \"lab.\"", "That sounds pretty cool! Maybe I will check it out.", "I would. You will for sure be entertained!"], ["have you seen the VVitch?", "no, is it any good?", "I was really surprised, you should really see it", "what's it about?", "it follows a frontier family during the early 17th century, whose new born suddenly vanishes in the wilderness", "is it a horror movie?", "yeah its somewhat of a thriller. a bunch of strange events unfold after the disappearance of the child", "I might have to check that out", "you really should, its well acted and the cinematography is amazing", "i'll see if i can stomach it!"], ["Did you ever seen \"night of the living dead\" ?", "Oh, yeah.  That's a classic.", "I got scared watching it as a child.", "I didn't see it until I was an adult.", "I snuck into the living room where my parents were watching it.", "It would be pretty scarry for a kid.", "It was.  I had nightmares for a long time after that.", "Really, was it the zombie's climbing out of their graves like in Thriller?", "Exactly, I still don't watch horror movies because of it.", "Wow, I can't get enough of them."], ["I saw the most awesome horror movie the other day.", "Really, what was it called?", "It's Get Out, I think you've heard about it.", "Yeah, I heard it was good! You liked it?", "I loved it! It was a different type of horror movie than I've seen recently.", "I've been looking for a new type of horror movie. It seems like every horror movie is the same stuff.", "No, it was different. Totally unexpected. Not that it was super scary but there was so much suspense.", "What was your favorite part?", "When you see it, pay attention to the part about the grandparents. You'll know what I'm talking about when you see it.", "Awesome, thank you!! I'm definitely going to watch it soon."], ["Have you seen the movie Dead Silence?", "Yes, I loved it. I thought it was very creepy!", "I agree, I thought the effect of everything going silent when Mary Shaw was about to attack was an excellent effect.", "It was, the poem created a very creepy ambiance as well.", "Yes it really did. The twist ending really surprised me as well.", "Oh you mean when you found out that Edward was dead all along and Ella was the perfect doll?", "Yes, that was a real surprise to me!", "Me too! I find ventriloquist dolls very creepy, so it was a good overall premise for the movie.", "Yes it was, the scene in the theater when they find all the dolls and Mary Shaw is possessing them is so scary!", "Yes it is! Especially the clown doll."], ["Have you seen Get Out?", "Yea, that was creepy!", "I thought it was good. It didn't really scare me though.", "Even at the end?", "Yea, I saw the ending coming, you could tell his girlfriend was in on it the whole time.", "Not me, I was shocked.", "It took me a while to figure out what exactly was happening though.", "Yea me too, I couldn't figure out why the staff at the house was acting so weird towards the main character.", "Yea, but it all made sense in the end.", "Well, kind of. It was pretty crazy."], ["Hi.", "Hey.", "Do you like horror movies?", "Sometimes.", "What do you mean?", "I have to be in the mood for them.", "Ah okay.", "What about you?", "Yeah I love them.", "Cool."], ["I just saw Rabid.", "Isn't that an oldie?", "Yes, 1977.", "Who is in it?", "Marilyn Chambers!", "The porn star?", "None other.", "Any nude scenes?", "Just a few.", "I bet she looked great in them!"], ["Did you see the movie Get Out?", "Not yet! I missed it in theaters and was going to order the blu ray.", "It's Great! Jordan Peele is clearly a horror movie fan.", "Why do you say that?", "You can pick out references to others classic horror movies.", "I think I read something about that in a review in relation to the commentary.", "Did you know that Katherine Keener is in it?", "What? I had no idea.", "Yup. She plays the mom of Rose. The Co-lead.", "Oh! That's her? I read that the mom was scary!"], ["Have you seen Get Out yet?", "I did! I absolutely loved it!", "Me too! Such a good slow-burn horror movie.", "Yeah, not so reliant on constant jumps and jolts. Very creepy.", "And the ending was great!", "Yeah, I really liked how they trick us into feeling a sense of dread when the police lights appear in the distance.", "I agree. It really makes the viewer feel what many black men probably feel when they see them in general.", "I love it when movies can successfully pull off a strong message like that.", "Me too, especially when they can still be entertaining.", "This was an excellent film and I can't wait to see what he comes up with next."], ["Would you consider Get Out a horror movie?", "No it was more suspense", "Some of the themes sort of beg to differ.", "Thats true but I dont think anything was scary", "Sure it was, the actors did a great job of that.", "This is true, I guess you could say it was a horror movie.", "There were elements of that movie that were so scary", "Like what?", "How the townspeople seemed so convoluted.", "I think its really subjective but I am leaning towards agreeing with you."], ["Seen any good zombie movies lately?", "Yes! I just saw a Korean film called Train to Busan that was insane.", "Really? What sets it apart from other zombie movies?", "It all takes place on this bullet train so its confined and claustrophobic. And the zombies are fast so when people try to move between trains all hell breaks lose.", "Was it gory?", "Extremely gory but in a unique over the top way. They had some set pieces like I've never seen but it also has a heart so you care about the people who are in jeopardy.", "Caring about characters in horror movies is so rare. They're usually so disposable.", "The director, Yeon Sang-ho, obviously spent time getting the characters right so there is more at stake.", "Korea has done some really great horror films like I Saw the Devil and Tale of Two Sisters. They bring something new to the horror table.", "I totally agree! Kim Jee-woon's I Saw the Devil is probably one of the best horror films in the crime genre out there."], ["Do you like scary moves? My all time favorite scary movie has to be the original \"Amityville Horror\".", "Absolutley, that house was crazy. I couldnt imagine living there. It looks creepy to begin with.", "My favorites are those that could be real. You know dealing with paranormal.", "Oh so like the \"Exorcist\" too?", "Yes, calling in the priest, and then stabbing the crucifix in her private part. Terrible, but wicked.", "I would hate to have been that preacher. Neck turning all the way and projectile vomiting.", "It was pretty gross. Or how about the move with that little lady who talks in the baby voice. It's creepy.", "Poltrigiest? That one?", "Yess, that movie scared me so bad when i was little. I was scared of elevators and bath time after that.", "You better watch a cartoon before you go to bed tonight or the little lady will come to you through the tv static!!! Just kidding"], ["Were you ever into the Paranormal Activities movies?", "I've watched a lot of them, but I don't know if I was a fan.", "Didn't they scare you?", "Not really.  I mean, they had a scare factor, but the believability wasn't there.", "Oh, they freaked me out!  I couldn't sleep.", "I didn't have a problem sleeping.  They were just another movie.", "You were never scared that your house might be haunted?", "No.  I mean, it was just a movie.", "But there are things that you can't see!", "The believability just wasn't there for me."], ["Have you seen a good horror movie lately?", "Yes, I sure did Friday night.", "What did you see?", "I seen The Conjuring 2, it was better than part 1.", "What were the best parts?", "There is a spooky demon that takes form of an evil nun.", "Wow, what else was it about?", "A hauting in England of a family of 4 and a girl gets possessed, by an old spirit that was really the nun demon.", "Sounds like a cool twist, anyone familiar?", "Lorraine and her husband Ed who were involved with the Amityville story were there to see if the claims were fake."], ["Just watched House of A 1,000 Corpses last night.", "That was a great movie.", "Yes,those characters in that were just so odd and unlikeable.", "Especially the daughter with the blonde hair.", "I couldn't stand her character. That annoying laugh.", "Did you like Captain Spaulding?", "No, he is just as bad.", "I agree. They were all freaky.", "It really had a terrifying story to it though.", "Yeah, I wouldn't want to be stuck in their home."], ["What horror movie was the funniest you have seen?", "I would say krampus.", "I found that actually scary.", "Come on,the whole premise is comical. Then look at toni collette I think of her as a comedic actress.", "Toni Collette is multi-faceted. Sure there are comedies films of hers, but what about six sense. I think of her just as a great actress.", "I suppose that is true I forgot about some of her other roles. I still thInk krampus is a comical horror film.", "I suppose I agree that there is a comical aspect, the idea of an evil santa is somewhat funny.", "That's is what I am saying. Also some of the lines are funny.", "Like what lines? can you quote any?", "Take this one for example, and so many others...Max: Are we going to be okay? [Omi talks in German] Max: What? Aunt Dorothy: She said we're fucked!"]]}